Repository: ScilabOrg/scilab
Catalog: scilab/modules/polynomials/locales/*/polynomials.po
Languages: fr_fr, pl_pl

source: %s: Input argument #%d must be real.
fr_fr: %s: L'argument d'entrée n° %d doit être réel.
pl_pl: %s: Parametr wejściowy #%d musi być wartością rzeczywistą.

source: %s: Unexpected type for input argument #%d.
fr_fr: %s: Type non admis pour l'argument d'entrée n° %d.
pl_pl: %s: Nieoczekiwany typ argument wejściowy #%d.

source: %s: Wrong number of input argument(s): %d expected.
fr_fr: %s: Mauvais nombre d'arguments d'entrée: %d est attendu.
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano %d.

source: %s: Wrong size for input argument #%d: A polynomial expected.
fr_fr: %s: Mauvaise taille pour l'argument d'entrée n° %d: Un polynôme est attendu.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: oczekiwano wielomiany.

source: %s: Wrong size for input argument #%d: A rational fraction expected.
fr_fr: %s: Mauvaise taille pour l'argument d'entrée n° %d: Une fraction rationnelle est attendue.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: oczekiwana racjonalna część .

source: %s: Wrong size for input argument #%d: A row vector expected.
fr_fr: %s: Mauvaise taille pour l'argument d'entrée n° %d: Un vecteur ligne est attendu.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: oczekiwany wektor wierszowy.

source: %s: Wrong size for input argument #%d: A single input, single output system expected.
fr_fr: "%s: Wrong size for input argument n° %d: Single input, single output system expected.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: pojedyncze wejście, system oczekuje pojedynczego wyjścia.

source: %s: Wrong size for input argument #%d: A square matrix expected.
fr_fr: "%s: Mauvaise taille pour l'argument d'entrée n° %d: Une matrice carrée est attendue.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: oczekiwana macierz kwadratowa.

source: %s: Wrong type for input argument #%d: A floating point number or polynomial or rational fraction array expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: un tableau de flottants, de polynômes ou de fractions rationnelles est attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: Oczekiwano liczby rzeczywistej lub wielomianu lub racjonalnej części tablicy.

source: %s: Wrong type for input argument #%d: Linear dynamical system or polynomial array expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Un système dynamique linéaire ou un polynôme est attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: Oczekiwano liniowego układu dynamicznego lub tablicy wielomianów.

source: %s: Wrong type for input argument: Polynomial array expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée: Un tableau de polynômes est attendu.
pl_pl: %s: Niewłaściwy typ dla argumentu wejściowego: Oczekiwana jest tablica wielomianów.

source: %s: Wrong value for input argument #%d: Must be in the set {%s}.
fr_fr: "%s: Mauvaise valeur pour l'argument d'entrée #%d: Elle doit être dans l'ensemble {%s}.
pl_pl: %s: Zła wartość parametru wejściowego #%d: Musi być w ustawieniu {%s}.

source: %s: incompatible input arguments %d and %d
fr_fr: %s: Les arguments d'entrée n° %d et n° %d sont incompatibles.
pl_pl: %s: argumenty wejściowe %d oraz % d są niezgodne.

source: Computing determinant: Be patient...
pl_pl: Obliczanie wyznacznika: Bądź cierpliwy ...

source: Polynomials
pl_pl: Wielomianów
