Repository: ScilabOrg/scilab
Catalog: scilab/modules/windows_tools/locales/*/windows_tools.po
Languages: ru_ru

source: %s: Wrong type for input argument #%d: String expected.
ru_ru: %s: Неверный тип аргумента #%d: Ожидалась строка.

source: %s: Wrong type for input arguments: String expected.
ru_ru: %s: Неверны типы аргументов: Ожидались строки.

source: %s: Cannot open Windows registry.
ru_ru: %s: Не удалось открыть реестр Windows.

source: %s: Cannot query value of this type.
ru_ru: %s: Не удалось запросить значение этого типа.

source: %s: Wrong value for input argument #%d: '%s' expected.
ru_ru: %s: Неверное значение аргумента #%d: Ожидалось '%s'.

source: Only on Windows Mode, not in Console Mode.
ru_ru: Только в оконном режиме, не в консольном.

source: %s: Wrong type for input arguments: Strings expected.
ru_ru: %s: Неверны типы аргументов: Ожидались строки.

source: %s: The file %s does not exist.
ru_ru: %s: Файл %s не существует.

source: %s: Wrong size for input argument #%d: String expected.
ru_ru: %s: Неверный размер аргумента #%d: Ожидалась строка.

source: %s: This feature has not been implemented.
ru_ru: %s: Эта функциональная возможность ещё не реализована.

source: %s: Wrong value for input argument #%d: Non-negative integers expected.
ru_ru: %s: Неверный тип аргумента #%d: Ожидалось неотрицательно целое число.

source: %s: Wrong type for input argument #%d: Non-negative integer expected.
ru_ru: %s: Неверный тип аргумента #%d: Ожидался неотрицательное целое число.

source: %s: Wrong input argument #%d: '%s' or '%s' expected
ru_ru: %s: Неверный аргумент #%d: Ожидался '%s' или '%s'

source: %s: Wrong type for input argument #%d: Non-negative integers expected
ru_ru: %s: Неверный тип аргумента #%d: Ожидалось неотрицательное целое число

source: %s: Wrong type for input arguments.
ru_ru: %s: Неверные типы аргументов.

source: %s: Cannot open file %s.
ru_ru: %s: Не удалось открыть файл %s.

source: %s: Wrong value for input argument: %s.
ru_ru: %s: Неверное значение аргумента: %s.

source: see help
ru_ru: см. справочную систему

source: %s : Memory allocation error.
ru_ru: %s : Ошибка выделения памяти.

source: %s: Wrong value for input argument: Non-negative integers expected.
ru_ru: %s: Неверное значение аргумента: Ожидалось неотрицательное целое число.

source: %s: Wrong type for input argument: Scalar expected.
ru_ru: %s: Неверный тип аргумента: Ожидался скаляр.
