Repository: ScilabOrg/scilab
Catalog: scilab/modules/core/locales/*/core.po
Languages: fr_fr, ja_jp

source: Startup execution:
fr_fr: Initialisation:
ja_jp: 活動開始の実行:

source: loading initial environment
fr_fr: Chargement de l'environnement de travail
ja_jp: 初期環境を取り込む

source: &File
fr_fr: &Fichier
ja_jp: ファイル(&F)

source: &Edit
fr_fr: &Edition
ja_jp: 編集(&E)

source: &Preferences
fr_fr: &Préférences
ja_jp: お気に入り(&P)

source: &Control
fr_fr: &Contrôle
ja_jp: コントロール(&C)

source: &Applications
ja_jp: アプリケーション(&A)

source: &Toolboxes
fr_fr: Boites à ou&tils
ja_jp: ツールボックス(&T)

source: results may be inaccurate. rcond = %s1
fr_fr: Les résultats peuvent être inexacts. rcond = %s1
ja_jp: 結果は不正確かもしれません。状態 = %s1

source: %s: The file %s does not exist.
fr_fr: %s : Le fichier %s n'existe pas.
ja_jp: %s: ファイル %s は、存在しません。

source: %s: Wrong input argument #%d: Path to a scilab script file expected.
fr_fr: %s : Mauvais argument d'entrée n°%d : Un chemin vers un script Scilab attendu.
ja_jp: %s: 入力引数が正しくありません #%d: scilabスクリプト・ファイルへのPathを予想しました。

source: Checking: %s
fr_fr: Vérification : %s
ja_jp: 調査: %s

source: %s: Please check: %s.
fr_fr: %s : Merci de vérifier : %s.
ja_jp: %s: 確認してください: %s.

source: %s: File doesn''t exist: %s
fr_fr: %s : Le fichier n''existe pas : %s
ja_jp: %s: ファイルは存在しません: %s

source: %s: Requires Scipad.
fr_fr: %s : Nécessite Scipad.
ja_jp: %s: Scipadを必要とします。

source: %s: Wrong number of input argument(s): At least %d expected.
fr_fr: %s : Mauvais nombre d'argument(s) en entrée : Au moins %d attendus.
ja_jp: %s: 入力引数の不正な数値です: 少なくとも %d が予想されます。

source: %s: %s is a uneditable hard coded function.
fr_fr: %s : %s est une fonction non éditable.
ja_jp: %s: %s は編集できない備えられた関数です。

source: %s: Unable to find Perl file: %s
fr_fr: %s : Impossible de trouver le fichier Perl : %s
ja_jp: %s: Perl ファイル は見つかりません: %s

source: %s: Wrong type for input argument #%d: Strings expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée %d : Chaîne attendue.
ja_jp: %s: 入力引数の不正な型です #%d: 文字列を想定します。

source: %s: No perl command specified.
fr_fr: %s : Commande perl non fournie.
ja_jp: %s: 明確なPerlコマンドではありません。

source: %s: Unable to find Perl in ''%s''
fr_fr: %s : Impossible de trouver Perl dans "%s"
ja_jp: %s: ''%s'' でPerlを見つけられません

source: %s: Unable to find Perl.
fr_fr: %s : Impossible de trouver Perl.
ja_jp: %s: Perlを見つけられません。

source: %s: System error: Command executed: %s
fr_fr: %s : Erreur système : Commande exécutée : %s.
ja_jp: %s: システム・エラー: コマンドは実行されました: %s

source: %s: Wrong number of input arguments: At least %d expected.
fr_fr: %s : Mauvais nombre d'arguments en entrée : Au moins %d attendus.
ja_jp: %s: 入力引数の不正な数値です: 少なくとも %d が予想されます。

source: Error(s) : see help powershell'';''verify your script without scilab.
fr_fr: Erreur(s) : voir help powershell'';''vérifiez votre script sans Scilab.
ja_jp: エラー: パワーシェルのヘルプを見てください '';'' scilab 抜きであなたのスクリプトを確認してください。

source: Only for Microsoft Windows.
fr_fr: Seulement disponible sous Microsoft Windows
ja_jp: Microsoft Windows のみ

source: Powershell not found.
fr_fr: Powershell introuvable.
ja_jp: パワーシェルが見つかりません。

source: %s: Wrong type for input argument #%d: String expected.
fr_fr: %s : Mauvais type pour l'argument n°%d : Chaîne de caractères attendue.
ja_jp: %s: 入力引数のための不正な型です #%d: 文字列が予想されます。

source: Obsolete: Define SCIHOME and HOME before to launch Scilab.
fr_fr: Obsolète : Définissez SCIHOME et HOME avant de lancer Scilab.
ja_jp: 習慣: 事前に SCIHOME と HOME を定義して Scilab を始めて下さい。.

source: is already compiled.
fr_fr: est déjà compilé.
ja_jp: 既にコンパイルされています。

source: %s: Wrong value for input argument #%d: Defined variable expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Une variable définie attendue.
ja_jp: %s: 入力引数ための値が不正です #%d: 定義変数が予想されます。

source: %s called at line %s of %s
fr_fr: %s appelé à la ligne %s de %s
ja_jp: %1$s は、%3$s の %2$s 行を呼び出しました。

source: %s called at line %s of %s instruction.
fr_fr: %s appelé à la ligne %s de l'instruction %s.
ja_jp: %1$s は、%3$s指令 の %2$s 行を呼び出しました。

source: %s called under %s
ja_jp: %s は、%s のもとに呼び出されました

source: %s called at line %s of macro %s
fr_fr: %s appellé à la ligne %s de la macro %s
ja_jp: %1$s は、%3$sマクロ の %2$s 行を呼び出しました。

source: User variables are:
fr_fr: Vos variables sont :
ja_jp: ユーザー変数は:

source: Using %s elements ouf of %s
fr_fr: Utilise %s éléments sur %s
ja_jp: %2$s を超えた要素で %1$s を使っています

source: %s: Wrong number of input arguments: %d or %d expected.
fr_fr: %s : Mauvais nombre d'argument d'entrée : %d à %d attendus.
ja_jp: %s: 不正な番号の入力引数です: %d または %d を想定します。

source: %s: Wrong value for input argument #%d: ''%s'' or ''%s'' expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : ''%s'' ou ''%s'' attendu.
ja_jp: %s: 入力引数 #%d で不正な値: ''%s'' または ''%s'' を想定します。

source: %s: Wrong size for input argument #%d: A string expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Une chaîne de caractères attendue.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 文字列を想定します。

source: %s: Wrong value for input argument #%d: Value greater than 0 expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Valeur plus grande que 0 attendue.
ja_jp: %s: 入力引数 #%d で不正な値: 0が予想したよりも大きな値です。

source: %s: Wrong size for input argument #%d: A scalar expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Un scalaire attendu.
ja_jp: %s: 入力引数 #%d で不正な値: スカラーを想定します。

source: %s: Wrong type for input argument #%d.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d.
ja_jp: %s: 入力引数のための不正な型です #%d.

source: %s: Wrong type for input argument.
fr_fr: %s : Mauvais type pour l'argument d'entrée.
ja_jp: %s: 入力引数のための不正な型です。

source: %s: Wrong values for input argument #%d: '%s' or '%s' expected.
fr_fr: %s : Mauvaises valeurs pour l'argument d'entrée n°%d : '%s' ou '%s' attendu.
ja_jp: %s: 入力引数 #%d で不正な値: '%s' または '%s' を想定します。

source: %s: Wrong values for input argument #%d: A int expected.
fr_fr: %s : Mauvaises valeurs Wrong pour l'argument d'entrée n°%d : Un int attendu.
ja_jp: %s: 入力引数 #%d で不正な値: 数値を想定します。

source: %s: Wrong values for input argument #%d: Must be in the interval [%d, %d].
fr_fr: %s : Mauvaises valeurs pour l'argument d'entrée n°%d : Doit être dans l'interval [%d, %d].
ja_jp: %s: 入力引数 #%d で不正な値: [%d, %d] 間隔であるべきです。

source: %s: Wrong type for input argument #%d: A string or a scalar expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un chaîne de caractères ou un scalaire attendu.
ja_jp: %s: 入力引数 #%d で不正な型: 文字列、またはスカラーを想定します。

source: %s: Wrong value for input argument #%d: '0' or '1' expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : '0' ou '1' attendu.
ja_jp: %s: 入力引数 #%d で不正な値: '0' or '1' が想定されます。

source: %s: Wrong value for input argument #%d: A int expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Un int attendu.
ja_jp: %s: 入力引数 #%d で不正な値: 数値を想定します。

source: %s: Wrong value for input argument #%d: Must be in the interval [%d, %d].
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Doit être dans l'intervalle [%d, %d].
ja_jp: %s: 入力引数 #%d で不正な値: [%d、%d] 間隔であるべきです。

source: %s: Wrong size for inputs arguments.
fr_fr: %s : Mauvaise dimension pour les arguments d'entrée.
ja_jp: %s: 入力引数で不正なサイズです。

source: %s: Wrong type for inputs arguments.
fr_fr: %s : Mauvais type pour les arguments d'entrée.
ja_jp: %s: 入力引数で不正な型です。

source: %s: An error occurred.
fr_fr: %s : Une erreur est survenue.
ja_jp: %s: 間違いが起こりました。

source: %s: Wrong type of input argument #%d: String expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Chaîne de caractères attendue.
ja_jp: %s: 入力引数 #%d で、不正な型: 文字列を想定します。

source: %s: Wrong type for input arguments #%d or #%d: Strings expected.
fr_fr: %s : Mauvais type pour les argument d'entrée n°%d ou n°%d : Chaînes de caractères attendues.
ja_jp: %s: 入力引数 #%d または #%d で不正な型: 文字列を想定します。

source: Warning: Problems with %s.
fr_fr: Attention : Problèmes avec %s.
ja_jp: 警告: %sの問題があります。

source: %s: Wrong value for input argument #%d: '%s' or '%s' expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : '%s' ou '%s' attendu.
ja_jp: %s: 入力引数 #%d で不正な値: '%s' または '%s' を想定します。

source: %s: Wrong number of output arguments: %d expected.
fr_fr: %s : Mauvais nombre d'arguments de sortie : %d attendus.
ja_jp: %s: 出力引数で不正な番号: %d を想定します。

source: %s: Wrong file VERSION %s.
fr_fr: %s : Mauvais fichier VERSION %s.
ja_jp: %s: %s ファイルバージョンが不正です。

source: %s: Wrong module name %s.
fr_fr: %s : Mauvais nom de module %s.
ja_jp: %s: %s モジュール名が不正です。

source: %s: Wrong file VERSION in %s.
fr_fr: %s : Mauvais fichier VERSION dans %s.
ja_jp: %s: %s のファイルバージョンが不正です。

source: %s: Wrong value for input argument #%d: '%s' expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n° %d : '%s' attendu.
ja_jp: %s: 入力引数 #%d で不正な値: '%s' が想定されます。

source: %s: Wrong type for input arguments #%d and #%d: Strings expected.
fr_fr: %s : Mauvais type pour les argument d'entrée n°%d et n° %d : Chaînes de caractères attendues.
ja_jp: %s: 入力引数 #%d と #%d で不正な型: 文字列を想定します。

source: %s: Cannot alloc more memory. Try gstacksize('max').
fr_fr: %s : Impossible d'allouer plus de mémoire. Essayez gstacksize('max').
ja_jp: %s: これ以上メモリの確保ができません。 gstacksize('max')を試してください。

source: %s: Out of bounds value. Not in [%lu,%lu].
fr_fr: %s : Hors des valeurs limites. Pas dans [%lu,%lu].
ja_jp: %s: 値を越えています。[%lu,%lu] ではないです。

source: %s: Wrong type for input argument #%d: Scalar, '%s' or '%s' expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Scalaire, '%s' ou '%s' attendu.
ja_jp: %s: 入力引数 #%d で不正な型: スカラー、 '%s' または '%s' を想定します。

source: %s: Wrong type for argument #%d: Scalar, '%s' or '%s' expected.
fr_fr: %s : Mauvais type pour l'argument n°%d : Scalaire, '%s' ou '%s' attendu.
ja_jp: %s: 引数 #%d で不正な型: スカラー、 '%s' または '%s' を想定します。

source: %s: Invalid library %s.
fr_fr: %s : Librairie invalide %s.
ja_jp: %s: 無効なライブラリ %s.

source: %s: Invalid '%s' value.
fr_fr: %s : Valeur '%s' incorrecte.
ja_jp: %s: 不正な値 '%s'

source: %s: function-name is incorrect.
fr_fr: %s : function-name est invalide.
ja_jp: %s: 不正確なファンクション名です。

source: %s: Wrong value for input argument #%d: Must be %s.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Doit être %s.
ja_jp: %s: 入力引数 #%d で不正な値: %s である必要があります。

source: %s: Wrong type for input arguments #%d or #%d.
fr_fr: %s : Mauvais type pour les arguments d'entrée n°%d ou n°%d.
ja_jp: %s: 入力引数 #%d または #%d で不正な型です。

source: %s: Impossible to read %s gateway.
fr_fr: %s : Impossible de lire la gateway %s.
ja_jp: %s: 入り口 %s を読むことができません。

source: %s: Invalid module name : %s.
fr_fr: %s : Nom de module invalide : %s.
ja_jp: %s: モジュール名が間違っています: %s.

source: %s: Cannot allocate more memory. Try stacksize('max').
fr_fr: %s : Ne peux pas allouer plus de mémoire. Essayez stacksize('max').
ja_jp: %s: これ以上メモリを割り当てできません。 スタックサイズ('max')を試みてください。

source: %s: Wrong value for input argument #%d: Scalar, '%s' or '%s' expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Scalaire, '%s' ou '%s' attendu.
ja_jp: %s: 入力引数 #%d で不正な値: スカラー '%s' または '%s' を想定します。

source: %s: Wrong type for input argument #%d: Scalar, '%s' or '%s'.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Scalaire, '%s' ou '%s'.
ja_jp: %s: 入力引数 #%d で不正な型: スカラー '%s' または '%s' です。

source: WARNING: %s
fr_fr: ATTENTION : %s
ja_jp: 警告: %s

source: WARNING: %s
fr_fr: AVERTISSEMENT : %s
ja_jp: 警告: %s

source: Internal Functions:
fr_fr: Fonctions internes :
ja_jp: 内部関数:

source: Commands:
fr_fr: Commandes :
ja_jp: コマンド:

source: %s: Wrong number of input arguments.
fr_fr: %s : Mauvais nombre d'arguments d'entrée.
ja_jp: %s: 不正な数値の入力引数です。

source: %s: Wrong value for input argument #%d: '%s', '%s', '%s' or '%s' expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : '%s', '%s', '%s' ou '%s' attendue.
ja_jp: %s: 入力引数 #%d で不正な値: '%s', '%s', '%s' または '%s' を想定します。

source: %s: Wrong value for input argument #%d: '%s', '%s', '%s' or '%s'.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : '%s', '%s', '%s' or '%s'.
ja_jp: %s: 入力引数 #%d で不正な値: '%s', '%s', '%s' または '%s'。

source: %s: Wrong value for input argument #%d: '%s', '%s' or '%s'.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : '%s', '%s' ou '%s'.
ja_jp: %s: 入力引数 #%d で不正な値: '%s', '%s' または '%s'。

source: %s: Wrong value for input argument #%d: '%s', '%s', '%s' expected. Input argument #%d must be '%s'.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : '%s', '%s', '%s' attendus. L'argument d'entrée n°%d doit être '%s'.
ja_jp: %s: 入力引数 #%d で不正な値: '%s', '%s', '%s' を想定します。入力引数 #%d で '%s' が要求されます。

source: using %10d elements out of %10d.
fr_fr: utilise %10d éléments parmis %10d.
ja_jp: %2$10d を超えた要素 %1$10d を使います。

source: and %10d variables out of %10d.
fr_fr: et %10d variables parmis %10d.
ja_jp: そして、%2$10d を超えた変数 %1$10d です。

source: Your variables are:
fr_fr: Vos variables sont :
ja_jp: あなたの変数です:

source: Your global variables are:
fr_fr: Vos variables globales sont :
ja_jp: あなたの全体変数です:

source: Error
fr_fr: Erreur
ja_jp: エラー

source: Fatal Error: Can't create table for scilab functions.
fr_fr: Erreur fatale : Ne peux pas créer la table des fonctions Scilab.
ja_jp: 致命的エラー: scilab関数のためのテーブルを作ることができません。

source: Error: Impossible to define %s environment variable.
fr_fr: Erreur : Impossible de définir la variable d'environnement %s.
ja_jp: エラー: 定義環境変数 %s は可能ではありません。

source: Consortium Scilab (DIGITEO)
ja_jp: Scilab コンソーシアム (DIGITEO)

source: Warning: the operational team of the Scilab Consortium doesn't provide and doesn't support this version of Scilab built with
fr_fr: Attention : l'équipe opérationnelle du Consortium Scilab ne fournit et ne supporte pas la version Scilab compilée avec des anciennes versions des compilateurs Microsoft.
ja_jp: 警告: Scilabコンソーシアム運営チーム ビルドしたこのScilabのバージョンをサポートせずに供給してはなりません

source: Impossible to load %s library: %s
fr_fr: Impossible de charger la bibliothèque %s : %s
ja_jp: %s ライブラリをロードできません: %s

source: Impossible to load %s function in %s library: %s
fr_fr: Impossible de charger la fonction %s dans la bibliothèque %s : %s
ja_jp: %2$s ライブラリの %1$s 関数をロードできません: %3$s

source: Impossible to call %s in %s library: %s
fr_fr: Impossible d'appeler %s dans la bibliothèque %s : %s
ja_jp: %2$s ライブラリの %1$s 呼び出しができません: %3$s

source: SIGSTP: aborting current computation
fr_fr: SIGSTP : Arrêt du calcul en cours
ja_jp: SIGSTP: 現在の計算を中止します

source: Trying to stop scilab in the middle of an interface.
fr_fr: Tentative d'arrêt de Scilab au milieu d'une interface.
ja_jp: インターフェースの途中でscilabの中断を試ます。

source: Do you really want to abort computation (y or n ?)
fr_fr: Voulez-vous vraiment arrêter le calcul (y ou n ?)
ja_jp: 計算を中断しますか(y または n ?)

source: Memory in use: %*ld %%
fr_fr: Mémoire en court d'utilisateur : %*ld%%
ja_jp: 使われているメモリ: %*ld %%

source: Total Physical Memory (Kbytes): %*I64d
fr_fr: Mémoire physique totale (Kbytes) : %*I64d
ja_jp: 合計物理メモリ(キロバイト): %*I64d

source: Free Physical Memory (Kbytes): %*I64d
fr_fr: Mémoire physique libre (Kbytes) : %*I64d
ja_jp: 空き物理メモリ(キロバイト): %*I64d

source: Total Paging File (Kbytes): %*I64d
ja_jp: 合計ページファイル(キロバイト): %*I64d

source: Free Paging File (Kbytes): %*I64d
ja_jp: 空きページファイル(キロバイト): %*I64d

source: Total Virtual Memory (Kbytes): %*I64d
fr_fr: Mémoire virtuelle totale (Kbytes) : %*I64d
ja_jp: 合計仮想メモリ(キロバイト): %*I64d

source: Free Virtual Memory (Kbytes): %*I64d
fr_fr: Mémoire virtuelle disponible (Kbytes) : %*I64d
ja_jp: 空き仮想メモリ(キロバイト): %*I64d

source: Free Extended Memory (Kbytes): %*I64d
fr_fr: Mémoire étendue disponible (Kbytes) : %*I64d
ja_jp: 空き拡張メモリ(キロバイト): %*I64d

source: Operating System:
fr_fr: Système d'exploitation :
ja_jp: オペレーティングシステム:

source: Number of processors: %d
fr_fr: Nombre de processeur : %d
ja_jp: プロセッサ数: %d

source: Video card: %s
fr_fr: Carte graphique : %s
ja_jp: ビデオカード: %s

source: Video card driver version: %s
fr_fr: Version du driver de la carte graphique : %s
ja_jp: ビデオカード ドライバ バージョン: %s

source: Screen size: %d x %d %d bits
fr_fr: Taille de l'écran : %d x %d %d bits
ja_jp: スクリーン・サイズ: %d x %d %d ビット

source: The SCI environment variable is not set.
fr_fr: La variable d'environnement SCI n'est pas définie.
ja_jp: SCI環境変数の設定ができません。

source: Cannot load the module declaration file: %s.
fr_fr: Impossible de charger le fichier de déclaration de module : %s.
ja_jp: モジュール宣言ファイルをロードできません: %s

source: Error: Could not parse file %s.
fr_fr: Erreur : Ne peux pas analyser le fichier %s.
ja_jp: エラー: ファイル %s の構文解析ができません。

source: %s module not found.
fr_fr: module %s introuvable.
ja_jp: %s モジュールが見つかりません。

source: Error: Not a valid module file %s (encoding not '%s') Encoding '%s' found.
fr_fr: Erreur: Fichier module %s invalide (l'encodagei n'est pas '%s') Encodage '%s' trouvé.
ja_jp: エラー: 妥当なモジュールファイル %s ではありません(エンコーディング '%s' でありません) エンコーディング '%s' が見つかりません。

source: Version: %s
ja_jp: バージョン: %s

source: Compilation date: %s
fr_fr: Date de compilation : %s
ja_jp: コンパイル日: %s

source: Compilation time: %s
fr_fr: Heure de compilation : %s
ja_jp: コンパイル時間: %s

source: Compiler Architecture: %s
fr_fr: Architecture de compilation : %s
ja_jp: コンパイラー・アーキテクチャ: %s

source: Compiled with %s
fr_fr: Compilé avec %s
ja_jp: %sでコンパイルされました

source: XML version: %s
fr_fr: Version de la bibliothèque XML : %s
ja_jp: XML バージョン: %s

source: Enable
fr_fr: Activé
ja_jp: 有効

source: TCL version: %s
fr_fr: Version de Tcl : %s
ja_jp: TCL バージョン: %s

source: TK version: %s
fr_fr: Version de Tk : %s
ja_jp: TK バージョン: %s

source: Path separator: %s
fr_fr: Séparateur de path : %s
ja_jp: PATHセパレータ: %s

source: Directory separator: %s
fr_fr: Séparateur de répertoire : %s
ja_jp: ディレクトリー・セパレーター: %s

source: PCRE Version: %d.%d
fr_fr: Version de PCRE : %d.%d
ja_jp: PCRE バージョン: %d.%d

source: SCI environment variable not defined.
fr_fr: La variable d'environnement SCI n'est pas définie.
ja_jp: SCI環境変数が見つかりません。

source: Warning
fr_fr: Attention
ja_jp: 警告

source: SCIHOME not defined.
fr_fr: Variable SCIHOME non définie.
ja_jp: SCIHOME が見つかりません。

source: TMPDIR not defined.
fr_fr: Variable TMPDIR non définie.
ja_jp: TMPDIR が見つかりません。

source: %s: Wrong type for input argument #%d: Named variable expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Variable nommée attendue.
ja_jp: %s: 入力引数 #%d で不正な型: 名前変数を想定します。

source: %s: Wrong type for input argument #%d: Compiled macro expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Macro compilée attendue.
ja_jp: %s: 入力引数 #%d で不正な型: 編集マクロを想定します。

source: %s: No more memory.
fr_fr: %s : Plus de mémoire disponible.
ja_jp: %s: これ以上メモリがありません。

source: %s: Out of code.
fr_fr: %s : Plus de code.
ja_jp: %s: コードから

source: %s: stack size exceeded (Use stacksize function to increase it).
fr_fr: %s : taille de la pile dépassée (utilisez la fonction stacksize pour augmenter la taille de la pile).
ja_jp: %s: スタックサイを超えました(使用した stacksize を増やすと作用します)

source: %s: Wrong %s value %d instead of %d.
fr_fr: %s : Mauvaise valeur %s %d au lieu de %d.
ja_jp: %1$s: %4$d の代わりの値 %3$d は不正 %2$s です。

source: %s: code %d not yet implemented.
fr_fr: %s : code %d pas encore implémenté.
ja_jp: %s: コード %d は実行されません。

source: %s: Unknown code %d at index2 %d.
fr_fr: %s : code inconnu %d à index2 %d.
ja_jp: %1$s: index2 %3$d でコード %2$d が不明です。

source: %s: Old version of if and while not implemented.
fr_fr: %s : Ancienne version de if et while pas implémentée.
ja_jp: %s: 古いバージョンです、そして、ときには実行されません。

source: %s: Wrong type value.
fr_fr: %s : mauvaise valeur de type.
ja_jp: %s: 型の値が不正です。

source: %s: Unknown operator %d.
fr_fr: %s : Opérateur %d inconnu.
ja_jp: %s: 未知のオペレータ %d です。

source: %s: Wrong fromwhat value %s.
fr_fr: %s : Mauvaise valeur fromwhat %s.
ja_jp: %s: 不明な値 %s で不正です。

source: %s: wrong code %d.
fr_fr: %s : mauvais code %d.
ja_jp: %s: 不正なコード %d

source: Error: Could not parse file %s
fr_fr: Erreur : Impossible d'analyser le fichier %s
ja_jp: エラー: ファイル %s の構文解析ができません

source: Error: Not a valid version file %s (should start with <MODULE_VERSION> and contains <VERSION major='' minor='' maintenance='' revision='' string=''>)
fr_fr: Erreur : Fichier version %s invalide (devrait commencer par <MODULE_VERSION> et contenir <VERSION major='' minor='' maintenance='' revision='' string=''>)
ja_jp: エラー: 妥当な入口のファイル %s ではありません(<MODULE_VERSION>で始まり、<VERSION major='' minor='' maintenance='' revision='' string=''>を含みます)

source: Error: Not a valid version file %s (encoding not 'utf-8') Encoding '%s' found
fr_fr: Erreur : Fichier version %s invalide (l'encodage n'est pas 'utf-8') Encodage '%s' trouvé
ja_jp: エラー: ファイル %s のバージョンがはっきりしません('UTF-8'ではありません) エンコーディング '%s' が見つかりません。

source: Type '%s' or '%s' to return to standard level prompt.
fr_fr: Saisissez '%s' ou '%s' pour revenir au niveau de prompt normal.
ja_jp: 型 ’%s’ または、’%s’ 標準状態のプロンプトへ戻ります。

source: Error: could not parse file %s
fr_fr: Erreur : Impossible d'analyser (parser) le fichier %s
ja_jp: エラー: ファイル %s を構文解析できません

source: Error: Memory allocation.
fr_fr: Erreur d'allocation mémoire.
ja_jp: エラー: メモリ割り当て。

source: Error: Not a valid gateway file %s (should start with <GATEWAY> and contain <PRIMITIVE gatewayId='' primitiveId='' primitiveName=''>)
fr_fr: Erreur : Fichier gateway %s invalide (devrait commencer par <GATEWAY> et contenir <PRIMITIVE gatewayId='' primitiveId='' primitiveName=''>)
ja_jp: エラー: 妥当な入口のファイル %s ではありません(<GATEWAY>で始まり、<PRIMITIVE gatewayId='' primitiveId='' primitiveName=''>を含みます)

source: Error: Not a valid gateway file %s (encoding not 'utf-8') Encoding '%s' found
fr_fr: Erreur : Fichier gateway %s invalide (l'encodage n'est pas 'utf-8') Encodage '%s' trouvé
ja_jp: エラー: 妥当な入口のファイル %s ではありません('UTF-8'ではありません) エンコーディング '%s' が見つかりました。

source: Error returning tlist, memory full.
fr_fr: Erreur en retournant un tlist, mémoire pleine.
ja_jp: tlist の戻りエラー、メモリ不足です。

source: tlist not completely filled.
fr_fr: tlist partiellement remplie.
ja_jp: tlist は完全には満たされませんでした。

source: List full.
fr_fr: Liste pleine.
ja_jp: リストが一杯です。

source: Unexpected opcode, please report into the Scilab bug tracker.
fr_fr: Code opérateur inattendu. Merci de reporter un bug sur le bug tracker Scilab.
ja_jp: 思いがけないオペレーションコードです、どうぞScilabバグ追跡へ報告して下さい。

source: Functions compiled with very old versions are no more handled.
fr_fr: Les fonctions compilées avec de très anciennes versions ne sont plus supportées.
ja_jp: とても古いバージョンで編集された機能は、もはや取り扱われません。

source: Can't go to directory %s.
fr_fr: Ne peux pas aller dans le répertoire %s.
ja_jp: ディレクトリに行けません %s.

source: Invalid buffer.
fr_fr: Buffer Invalide.
ja_jp: 無効なバッファです。

source: Unknown error.
fr_fr: Erreur inconnue.
ja_jp: 不明なエラーです。

source: Can't get current directory.
fr_fr: Impossible d'obtenir le répertoire courant.
ja_jp: 現在のディレクトリを得ることができません。

source: No space to allocate Scilab stack.
fr_fr: Pas assez de mémoire pour allouer le coeur (stack) de Scilab.
ja_jp: Scilabスタックにスペースがありません。

source: %s: argument %d should be a list of size at least %d.
fr_fr: %s : argument %d doit être une liste de taille au moins %d.
ja_jp: %s: 引数 %d は、最も小さなサイズ %d のリストであるべきです。

source: %s: Wrong type for argument %d: Real matrix expected.
fr_fr: %s : type invalide pour l'argument %d : matrice réelle attendue.
ja_jp: %s: 入力引数 %d で不正な型: 実行列を想定します。

source: %s: Wrong size for argument %d: (%d,%d) expected.
fr_fr: %s : Mauvaise taille pour l'argument %d : (%d,%d) attendue.
ja_jp: %s: 入力引数 %d で不正なサイズ: (%d,%d) を想定します。

source: %s: Wrong type for argument %d (List element: %d): Real or complex matrix expected.
fr_fr: %s : Mauvais type pour l'argument %d (Elément %d de la liste) : Matrice réelle ou complexe attendue.
ja_jp: %s: 入力引数 %d で不正な型(要素リスト: %d): 実数 または複素行列を想定します。

source: %s: Wrong type for argument %d: Real or complex matrix expected.
fr_fr: %s : Mauvais type pour l'argument %d : Une matrice réelle ou complexe attendue.
ja_jp: %s: 入力引数 %d で不正な型: 実数 または複素行列を想定します。

source: %s: Too many names.
fr_fr: %s : Trop de noms.
ja_jp: %s: 名前が多すぎます。
