Repository: ScilabOrg/scilab
Catalog: scilab/modules/core/locales/*/core.po
Languages: fr_fr, ja_jp

source: %s: Wrong type for argument %d: List of size at least %d expected.
fr_fr: %s : Mauvais type pour l'argument %d : Liste de taille au moins %d attendue.
ja_jp: %s: 入力引数 %d で不正な型: サイズのリストは、最も小さな %d と予想しました。

source: %s: Wrong type for argument %d (List element: %d): Int matrix expected.
fr_fr: %s : mauvais type pour l'argument %d (élément de la liste : %d) : Matrice d'entiers attendue.
ja_jp: %s: 入力引数 %d (要素リスト: %d) で不正な型: 数値行列を想定します。

source: %s: Wrong size for argument %d: At least %d expected.
fr_fr: %s : Mauvaise taille pour l'argument %d : Au moins %d attendu.
ja_jp: %s: 入力引数 %d で不正な型: スカラー、最少量 %d を想定します。

source: %s: Wrong type for argument %d (List element: %d): Boolean matrix expected.
fr_fr: %s : Mauvais type pour l'argument %d (Elément %d de la liste) : Matrice de booléens attendue.
ja_jp: %s: 入力引数 %d (要素リスト: %d) で不正な型: ブール行列を想定します。

source: %s: Wrong type for argument %d: Boolean matrix expected.
fr_fr: %s : Mauvais type pour l'argument %d : Matrice booléenne attendue.
ja_jp: %s: 入力引数 %d で不正な型: ブール行列を想定します。

source: %s: Wrong type for argument %d (List element: %d): Sparse matrix expected.
fr_fr: %s : Mauvais type pour l'argument %d (Elément %d de la liste) : Matrice creuse attendue.
ja_jp: %s: 入力引数 %d (要素リスト: %d) で不正な型: 疎行列を想定します。

source: %s: Wrong type for argument %d: Sparse matrix expected.
fr_fr: %s : Mauvais type pour l'argument %d : Matrice creuse attendue.
ja_jp: %s: 入力引数 %d で不正な型: 疎行列を想定します。

source: %s: Wrong type for argument %d (List element: %d): Vector expected.
fr_fr: %s : mauvais type pour l'argument %d (élément de la liste : %d): Vecteur attendu.
ja_jp: %s: 入力引数 %d (要素リスト: %d) で不正な型: ベクトルを想定します。

source: %s: Wrong type for argument %d: Vector expected.
fr_fr: %s : Mauvais type pour l'argument %d : Vecteur attendu.
ja_jp: %s: 入力引数 %d で不正な型: ベクトルを想定します。

source: %s: Wrong type for argument %d: Real vector expected.
fr_fr: %s : Mauvais type pour l'argument %d : Vecteur réel attendu.
ja_jp: %s: 入力引数 %d で不正な型: 実数ベクトルを想定します。

source: %s: Wrong size for argument %d: %d expected.
fr_fr: %s : Mauvaise taille pour l'argument %d : %d attendu.
ja_jp: %s: 入力引数 %d で不正なサイズ: %d を想定します。

source: %s: Wrong type for argument %d (List element: %d): Scalar expected.
fr_fr: %s : Mauvais type pour l'argument %d (Elément %d de la liste) : Scalaire attendu.
ja_jp: %s: 入力引数 %d (要素リスト: %d) で不正な型: スカラーを想定します。

source: %s: Wrong type for argument %d: Scalar, '%s' or '%s' expected.
fr_fr: %s : Mauvais type pour l'argument %d : Scalaire, '%s' ou '%s' attendu.
ja_jp: %s: 入力引数 %d で不正な型: スカラー、'%s' または '%s'を想定します。

source: %s: Wrong type for argument %d (List element: %d): Matrix of strings expected.
fr_fr: %s : Mauvais type pour l'argument %d (Elément %d de la liste) : Matrice de chaînes de caractères attendue.
ja_jp: %s: 入力引数 %d (要素リスト: %d) で不正な型: 文字列、または行列を想定します。

source: %s: Wrong type for argument %d: Matrix of strings expected.
fr_fr: %s : Mauvais type pour l'argument %d : Matrice de chaîne de caractères attendue.
ja_jp: %s: 入力引数 %d で不正な型: 文字列の行列を想定します。

source: %s: Wrong type for argument %d (List element: %d): String matrix expected.
fr_fr: %s : Mauvais type pour l'argument n°%d (élément %d de la liste) : Matrice de chaînes de caractères attendue.
ja_jp: %s: 入力引数 %d (要素リスト: %d) で不正な型: 文字行列を想定します。

source: %s: Wrong type for argument %d: String matrix expected.
fr_fr: %s : Mauvais type pour l'argument n°%d : Matrice de chaînes de caractères attendue.
ja_jp: %s: 入力引数 %d で不正な型: 文字行列を想定します。

source: %s: Wrong type for argument %d: List expected.
fr_fr: %s : Mauvais type pour le paramètre %d : Liste attendue.
ja_jp: %s: 入力引数 %d で不正な型: リストを想定します。

source: %s: Wrong type for argument %d: Polynomial matrix expected.
fr_fr: %s : Mauvais type pour l'argument %d : Matrice polynomiale attendue.
ja_jp: %s: 入力引数 %d で不正な型: 多項式行列を想定します。

source: %s: Wrong type for argument %d : Polygon expected.
fr_fr: %s : Mauvais type pour l'argument %d : Polygone attendu.
ja_jp: %s: 入力引数 %d で不正な型: ポリゴンを想定します。

source: %s: Wrong type for argument %d: Working int matrix expected.
fr_fr: %s : Mauvais type pour l'argument n°%d : Matrice de travail d'entiers attendue.
ja_jp: %s: 入力引数 %d で不正な型: 働く数値行列を想定します。

source: %s: Wrong type for argument %d (List element: %d): Row vector expected.
fr_fr: %s : Mauvais type pour l'argument %d (Elément %d de la liste) : Vecteur ligne attendu.
ja_jp: %s: 入力引数 %d (要素リスト: %d) で不正な型: 行ベクトルを想定します。

source: %s: Wrong type for argument %d: Row vector expected.
fr_fr: %s : Mauvais type pour l'argument %d : Vecteur ligne attendu.
ja_jp: %s: 入力引数 %d で不正な型: 行ベクトルを想定します。

source: %s: argument %d >(%d) should be a column vector.
fr_fr: %s : l'argument %d >(%d) devrait être un vecteur colonne.
ja_jp: %s: 引数 %d>(%d) 列ベクトルであるべきです。

source: %s: Wrong type for argument %d: Column vector expected.
fr_fr: %s : Mauvais type pour l'argument %d : Vecteur colonne attendu.
ja_jp: %s: 引数 %d で不正な型: 列ベクトルを想定します。

source: %s: Wrong type for argument %d (List element: %d): Boxed pointer expected.
fr_fr: %s : Mauvais type pour l'argument %d (Elément de liste : %d): Pointeur lufact attendu.
ja_jp: %s: 入力引数 %d で不正な型(要素リスト: %d): 箱矢印 を想定します。

source: %s: Wrong type for argument %d: Boxed pointer expected.
fr_fr: %s : Mauvais type pour l'argument %d : Pointeur lufact attendu.
ja_jp: %s: 入力引数 %d で不正な型: 箱矢印 を想定します。

source: %s: Wrong type for argument %d: Matrix expected.
fr_fr: %s : Mauvais type pour l'argument %d : Matrice attendue.
ja_jp: %s: 入力引数 %d で不正な型: 行列を想定します。

source: %s: entry point %s not found in predefined tables or link table.
fr_fr: %s : point d'entré %s non trouvé dans la table prédéfinie ou dans la table de liens.
ja_jp: %s: 予め定義されたテーブル、またはリンク・テーブルで入口 %s を見つけられません。

source: %s: Wrong type for argument %d: Function or string (external function) expected.
fr_fr: %s : Mauvais type pour l'argument %d : Fonction ou chaîne de caractères (fonction externe) attendue.
ja_jp: %s: 引数 %d で不正な型: 関数、または文字列(外部関数) を想定します。

source: %s: Incompatible sizes.
fr_fr: %s : Tailles incompatibles.
ja_jp: %s: 互換性がないサイズです。

source: %s: Optional argument %d not given and default value %s not found.
fr_fr: %s : L'argument optionnel %d n'est pas donné et la valeur par défaut %s n'est pas trouvée.
ja_jp: %s: オプション引数 %d は与えられません、また 値 %s は見つかりません。

source: %f: No more space to store string arguments.
fr_fr: %f : Plus de place pour stocker les arguments de type chaîne de caractères.
ja_jp: %f: 入力引数の保存文字列にこれ以上スペースがありません。

source: %s: Wrong type for argument %d (List element: %d): Matrix of handle expected.
fr_fr: %s : mauvais type pour l'argument %d (élément de la liste : %d) : Matrice de handle attendue.
ja_jp: %s: 入力引数 %d で不正な型(要素リスト: %d): ハンドルの行列を想定します。

source: %s: Wrong type for argument %d: Matrix of handle expected.
fr_fr: %s : mauvais type pour l'argument %d : Matrice de handle attendue.
ja_jp: %s: 入力引数 %d で不正な型: 行列、またはハンドルを想定します。

source: %s: Wrong number of input argument(s): %d expected.
fr_fr: %s : Mauvais nombre d'argument(s) en entrée : %d attendu.
ja_jp: %s: 入力引数の不正な数値です。: %d が予想されます。

source: %s: Wrong number of input argument(s): %d to %d expected.
fr_fr: %s : Mauvais nombre d'argument(s) d'entrée : %d à %d attendu.
ja_jp: %s: 入力引数の不正な数値です。: %d から %d が予想されます。

source: %s: Wrong number of output argument(s): %d expected.
fr_fr: %s : Mauvais nombre d'argument(s) de sortie : %d attendu.
ja_jp: %s: 出力引数の不正な数値です。: %d が予想されます。

source: %s: Wrong number of output argument(s): %d to %d expected.
fr_fr: %s : Mauvais nombre d'argument(s) de sortie : %d à %d attendus.
ja_jp: %s: 出力引数の不正な数値です。: %d から %d が予想されます。

source: %s: Optional arguments name=val must be at the end.
fr_fr: %s : Le paramètre optionnel name=val doit être à la fin.
ja_jp: %s: オプションの引数 name=val は、終わりにあるべきです。

source: %s: Unrecognized optional arguments %s.
fr_fr: %s : Le paramètre optionnel %s n'est pas reconnu.
ja_jp: %s: 承認されていないオプションの引数 %s です。

source: Optional argument list is empty.
fr_fr: La liste d'arguments optionnels est vide.
ja_jp: オプションの引数リストは空です。

source: Optional arguments list:
fr_fr: Liste d'arguments optionnels :
ja_jp: オプションの引数リスト:

source: and %s.
fr_fr: et %s.
ja_jp: と %s.

source: %s: bad call to %s! (1rst argument).
fr_fr: %s : mauvais appel pour %s! (Premier paramètre).
ja_jp: %s: %s の良くない呼び出しです! (一番目の引数)

source: %s: (%s) too many arguments in the stack edit stack.h and enlarge intersiz.
fr_fr: %s : (%s) trop de variables dans la pile. Editez stack.h et augmentez intersiz.
ja_jp: %s: (%s) スタックの多すぎる引数のため、stack.hを編集してintersizを大きくします。

source: %s: (%s) bad third argument!
fr_fr: %s : (%s) Le troisième paramètre est faux !
ja_jp: %s: (%s) 三番目の引数が良くありません!

source: %s: Wrong type for argument: Complex expected.
fr_fr: %s : Mauvais type pour le paramètre : Complexe attendu.
ja_jp: %s: 引数で不正な型: 複素行列

source: %s: bad call to %s!
fr_fr: %s : Mauvais appel pour %s!
ja_jp: %s: %s の良くない呼び出しです。!

source: %s: argument %d > (%d) should be a complex matrix.
fr_fr: %s : Le paramètre %d > (%d) devrait être une matrice complexe.
ja_jp: %s: 引数 %d > (%d) 複素行列であるべきです。

source: %s: bad call to %s (third argument %c).
fr_fr: %s : Mauvais appel pour %s (Le troisième paramètre %c).
ja_jp: %s: %s の呼び出しが良くありません(三番目の引数 %c)

source: %s: (%s) bad second argument!
fr_fr: %s : (%s) Mauvais second paramètre!
ja_jp: %s: (%s) 二番目の引数が良くありません!

source: %s: createcvarfromptr: too many arguments on the stack, enlarge intersiz.
fr_fr: %s : createcvarfromptr : trop de variables sur la pile. augmentez intersiz.
ja_jp: %s: createcvarfromptr: スタックで多すぎる引数です、intersiz を大きくしてください。

source: %s: Recursion problems. Sorry ...
fr_fr: %s : Problèmes de récursivité. Désolé ...
ja_jp: %s: 回帰問題。すみません....

source: %s: %s is not a Scilab function.
fr_fr: %s : %s n'est pas une fonction Scilab.
ja_jp: %s: %s はScilab関数ではありません。

source: built in
fr_fr: intégré
ja_jp: 内蔵

source: Invalid time domain.
fr_fr: Domaine de temps invalide.
ja_jp: 不正時間領域。

source: Invalid system.
fr_fr: Système invalide.
ja_jp: 不正システム。

source: A non square matrix!
fr_fr: Une matrice non carrée !
ja_jp: 正方行列でありません!

source: Invalid %c,%c matrices.
fr_fr: Matrices %c,%c invalides.
ja_jp: %c の間違い,%c 行列。

source: %s: internal error, info=%d.
fr_fr: %s : erreur interne, info=%d.
ja_jp: %s: 内部エラー、情報=%d

source: %s: intersiz is too small.
fr_fr: %s : intersiz est trop petit.
ja_jp: %s: intersiz はあまりにも小さいです。

source: %s argument
fr_fr: %s paramètre
ja_jp: 引数 %s

source: argument number %d
fr_fr: Argument numéro %d
ja_jp: 引数番号 %d

source: %s and %s arguments
fr_fr: Les paramètres %s et %s
ja_jp: %s と 引数 %s

source: %s argument and argument %d
fr_fr: Le paramètre %s et le paramètre %d
ja_jp: 引数 %s と %d 引数

source: arguments %d and %d
fr_fr: Les paramètres %d et %d
ja_jp: %d 引数 と %d

source: should be square
fr_fr: devrait être carré
ja_jp: 平方であるべきです

source: should be a vector
fr_fr: devrait être un vecteur
ja_jp: ベクトルであるべきです

source: should be a row vector
fr_fr: devrait être un vecteur ligne
ja_jp: 列ベクトルであるべきです

source: should be a column vector
fr_fr: devrait être un vecteur colonne
ja_jp: 欄ベクトルであるべきです

source: should be a scalar
fr_fr: devrait être un scalaire
ja_jp: スカラーであるべきです

source: %s: %s has wrong dimensions (%d,%d), expecting (%d,%d).
fr_fr: %s : %s n'a pas les bonnes dimensions (%d,%d), (%d,%d) attendues.
ja_jp: %s: %s は不正な次元 (%d,%d) を持っています, (%d,%d) を想定します。

source: %s: %s has wrong %s dimension (%d), expecting (%d).
fr_fr: %s : %s n'a pas la bonne %s dimension (%d), (%d) attendue.
ja_jp: %s: %s の不正な %s 次元(%d), 予想(%d).

source: first
fr_fr: premier
ja_jp: 最初に

source: second
fr_fr: deuxième
ja_jp: 次に

source: %s: %s has wrong length %d, expecting (%d).
fr_fr: %s : %s n'a pas la bonne taille %d, (%d) attendue.
ja_jp: %s: %s は不正な長さ %d をもっています, (%d) を想定します。

source: %s: %s have incompatible dimensions (%dx%d) # (%dx%d)
fr_fr: %s : %s a des dimensions incompatibles (%dx%d) # (%dx%d)
ja_jp: %s: %s 互換性がない次元 (%dx%d) # (%dx%d) を持っています。

source: %s: %s have incompatible dimensions.
fr_fr: %s : %s a des dimensions incompatibles.
ja_jp: %s: %s 互換性がない次元を持っています。

source: %s: %s should be a list with %d-element being %s.
fr_fr: %s : %s devrait être une liste avec %d-élément étant %s.
ja_jp: %s: %s は、%d-要素が %s なので、リストであるべきです。

source: square
fr_fr: carré
ja_jp: 平方

source: a vector
fr_fr: un vecteur
ja_jp: ベクトル

source: a row vector
fr_fr: un vecteur ligne
ja_jp: 列ベクトル

source: a column vector
fr_fr: un vecteur colonne
ja_jp: 欄ベクトル

source: a scalar
fr_fr: un scalaire
ja_jp: スカラー

source: %s: argument %d(%d) has wrong %s dimension (%d), expecting (%d).
fr_fr: %s : argument %d(%d) n'a pas la bonne dimension %s (%d), valeur attendue (%d).
ja_jp: %s:引数 %d(%d) 不正 %s 範囲 (%d), 予想 (%d).

source: GetDataFromName: variable %s not found.
fr_fr: GetDataFromName : variable %s non trouvée.
ja_jp: GetDataFromName: 変数 %s は見つかりません。

source: %s: Variable %s not found.
fr_fr: %s : Variable %s introuvable.
ja_jp: %s: 変数 %s は見つかりません。

source: Undefined variable %s.
fr_fr: Variable indéfinie %s.
ja_jp: 変数 %s は定義されていません。

source: %s: argument must be a string.
fr_fr: %s: argument doit être une chaîne de caractères.
ja_jp: %s: 引数は文字列でなくてはなりません。

source: Cannot find Windows temporary directory.
fr_fr: Ne peux pas trouver le répertoire temporaire Windows.
ja_jp: Windows 一時ディレクトリが見つかりません。

source: Impossible to create : %s
fr_fr: Impossible de créer : %s
ja_jp: 作り出すことができません : %s

source: Scilab version "%d.%d.%d.%d"
ja_jp: Scilabバージョン "%d.%d.%d.%d"

source: Scilab version "%d.%d.%d.%d" %s
ja_jp: Scilabバージョン "%d.%d.%d.%d" %s

source: Scilab Version Info.
fr_fr: Information de la version de Scilab.
ja_jp: Scilabバージョン情報。
