Repository: ScilabOrg/scilab
Catalog: scilab/modules/pvm/locales/*/pvm.po
Languages: de_de, it_it, uk_ua

source: %s: An error occurred: %s
de_de: %s: ein Fehler ist aufgetreten: %s
it_it: %s: Si è verificato il seg. errore: %s
uk_ua: %s: сталася помилка: %s

source: %s: Error while creating processes: %s.
de_de: %s: Fehler beim Erzeugen des Prozesses: %s.
it_it: %s: Si è verificato un errore durante la creazione dei seg. processi: %s.
uk_ua: %s: під час створення процесів сталася помилка: %s.

source: %s: No more memory.
de_de: %s: kein weiterer Speicher.
it_it: %s: Memoria esaurita.
uk_ua: %s: доступну пам’ять вичерпано.

source: %s: No such file or directory.
de_de: %s: keine solche Datei oder Verzeichnis.
it_it: %s: Non c'è alcuna directory o file simile.
uk_ua: %s: немає такого файла або каталогу.

source: %s: Unknown type or not yet implemented
de_de: %s: unbekannter Typ oder noch nicht implementiert

source: %s: Unknown type or not yet implemented.
de_de: %s: unbekannter Typ oder noch nicht implementiert.

source: %s: Wrong first input argument: '%s' or '%s' expected.
de_de: %s: falsches erstes Eingangsargument: '%s' oder '%s' erwartet.
it_it: %s: Il primo argomento in ingresso è sbagliato: era atteso ''%s'' o ''%s''.
uk_ua: %s: помилковий перший параметр: слід використовувати «%s» або «%s».

source: %s: work space (stacksize) is too small d
de_de: %s: Arbeistbereich (Stackgröße) ist zu klein d.
it_it: %s: lo spazio di lavoro (stacksize) è troppo piccolo

source: %s: work space (stacksize) is too small.
de_de: %s: Arbeitsbereich (Stapelgröße) ist zu klein.

source: (group,instance) already exists
de_de: (Gruppe, Instanz) existierte bereits
it_it: (gruppo,istanza) già esistente
uk_ua: Група або екземпляр вже існує

source: Already doing operation
de_de: Arbeit im Begriff
uk_ua: Операція вже виконується

source: Already in group
de_de: bereist in Gruppe
it_it: È già presente nel gruppo
uk_ua: Вже у групі

source: Bad message id
de_de: Falsche ID der Nachricht
it_it: Id del messaggio sbagliato
uk_ua: Помилковий ідентифікатор повідомлення

source: Bad parameter
de_de: falscher Parameter
it_it: Parametro errato
uk_ua: Помилковий параметр

source: Barrier count mismatch
de_de: Fehler beim Zählen der Grenze
uk_ua: Не збігається кількість викликів barrier

source: Can not decode received msg
de_de: kann eigende Nachricht nicht dekodieren
it_it: Non è possibile decodificare un messaggio ricevuto
uk_ua: Не вдалося декодувати отримане повідомлення

source: Can not get memory
de_de: Kann Speicher nicht belegen
it_it: Non è possibile ottenere della memoria
uk_ua: Не вдалося отримати пам’ять

source: Daemon pvmd is not responding
de_de: Hintergrundprozess pvmd reagiert nicht.
it_it: Il demone pvmd non risponde
uk_ua: Фонова служба pvmd не відповідає на запити

source: Error MALLOC in pvm_error
de_de: Fehler MALLOC in pvm_error
it_it: Errore di MALLOC in pvm_error
uk_ua: Помилка MALLOC у pvm_error

source: Error pvm_halt - signal
de_de: Fehler pvm_halt- Signal
it_it: C'è un errore in pvm_halt - signal
uk_ua: Помилка: отримано сигнал pvm_halt

source: Error pvm_reduce: Not scalar type
de_de: Fehler beim pvm_reduce: kein Skalartyp.
it_it: Errore in pvm_reduce: non è di tipo scalare
uk_ua: Помилка pvm_reduce: нескалярний тип

source: Error pvm_reduce: Unknown reduction operation %s
de_de: Fehler pvm_reduce: unbekannte Reduktionsoperation %s
uk_ua: Помилка pvm_reduce: невідома операція спрощення — %s

source: Failed to exec new slave pvmd
de_de: Fehler beim Ausführen des untergeodneten pvmd
uk_ua: Не вдалося виконати новий допоміжний pvmd

source: Function not implemented
de_de: Funktion nicht implementiert
it_it: Funzione non sviluppata
uk_ua: Функцію не реалізовано

source: Host already configured (Duplicate host)
de_de: Rechner bereits konfiguriert (doppelter Rechner)
it_it: L'host è già configurato (Host doppione)
uk_ua: Вузол вже налаштовано (дублювання запису)

source: Host failed
de_de: Rechner fehlgeschlagen
it_it: L' host è fallito
uk_ua: Помилка вузла

source: No current buffer
de_de: Kein aktueller Buffer
it_it: Non c'è un buffer al momento
uk_ua: Немає поточного буфера

source: No group with that name
de_de: keine Gruppe mit diesem Namen
it_it: Non c'è alcun gruppo con tale nome
uk_ua: Групи з такою назвою не існує

source: No parent task
de_de: kein übergeordneter Prozess
it_it: Nessun processo padre
uk_ua: Немає батьківського завдання

source: No such (group,instance)
de_de: Kein derartige (Gruppe, Instanz)
it_it: Nessun (gruppo,istanza) simile
uk_ua: Немає такої групи або екземпляра

source: No such executable
de_de: kein derartige ausführbare Datei
it_it: Non c'è un simile eseguibile
uk_ua: Немає такого виконуваного файла

source: No such host
de_de: Kein solcher Rechner
it_it: Non c'è un simile host
uk_ua: Немає такого вузла

source: No such instance in group
de_de: Keine deratige Instanz in der Gruppe
it_it: Non c'è alcuna instanza simile nel gruppo
uk_ua: У групі немає такого екземпляра

source: No such task
de_de: kein derartiger Prozess
it_it: Non c'è alcun processo simile
uk_ua: Немає завдання з такою назвою

source: Not in group
de_de: Nicht in der Gruppe
it_it: Non è nel gruppo
uk_ua: Не належить до групи

source: Null group name is illegal
de_de: Null Gruppenname illegal
it_it: "Nessuno" è illegale come nome per un gruppo
uk_ua: Порожні назви груп неприпустимі

source: Out of resources
de_de: Nicht genügend Ressourcen verfügbar
uk_ua: Вичерпано ресурси

source: PVM exists
de_de: PVM existiert
it_it: PVM esiste
uk_ua: PVM існує

source: PVM not found
de_de: PVM nicht gefunden
it_it: PVM non è stato trovato
uk_ua: PVM не знайдено

source: PVM parallel Toolbox
de_de: PVM paralleles Werkzeug
uk_ua: Набір інструментів PVM

source: Pvmd system error
de_de: Pvmd System Fehler
it_it: C'è stato un errore di sistema in pvmd
uk_ua: Системна помилка pvmd

source: Pvmd-pvmd protocol mismatch
de_de: Pvmd-pvmd Protokoll Fehler
it_it: Discordanza nel protocollo pvmd-pvmd
uk_ua: Розбіжність у протоколі pvmd-pvmd

source: Read past end of buffer
de_de: Lese letztes Ende des Buffers
it_it: Leggere la precedente fine del buffer
uk_ua: Читання даних поза межами буфера

source: Scilab PVM module not installed.
de_de: Scilab PVM Modul nicht installiert.
it_it: Il modulo PVM di Scilab non è installato.
uk_ua: Модуль PVM Scilab не встановлено.

source: The configuration file %s is used.
de_de: Die Konfigurationsdatei %s wird verwendet.
it_it: Il file di configurazione %s è in uso.
uk_ua: Використано файл налаштування %s.

source: The standard configuration file $SCI%s will be used. With SCI=%s SCI will have to be set on remote hosts in order to spawn scilab
de_de: Die Standartkonfigurationsdatei $SCI%s wird verwendet. Mit SCI=%s SCI wird auf entfernten Rechner eingestellt um Scliab zu starten
it_it: Verrà usato il file di configurazione standard $SCI%s. Dove SCI=%s SCI sarà impostato su degli host remoti al fine di generare scilab
uk_ua: Буде використано стандартний файл налаштування $SCI%s. З SCI=%s Щоб мати змогу викликати Scilab з віддалених вузлів слід встановити змінну середовища SCI

source: The standard configuration file $SCI%s%s needs the environment variables %s, %s, %s to be set. PVM can not be started.
de_de: Die Standart Konfigurationsdatei $SCI%s%s benötigt die Umgebungsvariablen %s, %s, %s gesetzt. PVM kann nicht gestartet werden.
it_it: Il file di configurazione standard $SCI%s%s necessita che le variabili d'ambiente %s, %s, %s siano impostate. PVM non può essere avviato.
uk_ua: Для нормальної роботи стандартного файла налаштування $SCI%s%s слід визначити змінні середовища %s, %s, %s. У поточному стані PVM неможливо запустити.

source: Unknown Error
de_de: unbekannter Fehler
it_it: Errore sconosciuto
uk_ua: Невідома помилка

source: Warning: PVM_ROOT is not set.
de_de: Warnung: PVM_ROOT ist nicht gesetzt.
it_it: Attenzione PVM_ROOT non è impostato.
uk_ua: Попередження: не встановлено PVM_ROOT.

source: Warning: PVM_ROOT is set to %s
de_de: Warnung: PVM_ROOT ist nach %s gesetzt.
it_it: Attenzione: PVM_ROOT è impostato a %s
uk_ua: Попередження: PVM_ROOT встановлено у значення %s

source: Warning: The standard configuration file $SCI%s was not found. We supposed that PVM and scilab are in standard place on your net (Cf. man pvmd3)
de_de: Warnung: die Standartkonfigurationsdatei $SCI%s kann nicht gefunden werden. Wir nehmen an, daß PVM und Scilab sich in Ihrem Netzwerk an Standartplätzen befinden (Cf. man pvmd3)
it_it: Attenzione: Il file di configurazione standard $SCI%s non è stato trovato. Si è supposto che PVM e scilab fossero nel luogo usuale sulla vostra rete (Ved. man pvmd3)
uk_ua: Попередження: не знайдено стандартний файл налаштування $SCI%s. Припускалося, що у вашій мережі PVM і Scilab встановлено за стандартними адресами (див. man pvmd3)

source: but there exists no configuration file:
de_de: es existiert keine Konfigurationsdatei:
it_it: purtroppo non esiste alcun file di configurazione:
uk_ua: але файла налаштування не знайдено за адресою:

source: %s: Unknown or not yet implemented type.
uk_ua: %s: невідомий або ще не реалізований тип.

source: %s: workspace (stacksize) is too small.
uk_ua: %s: робочий простір (розмір стеку) занадто малий.

source: OK
uk_ua: Гаразд

source: %s: Unknow type or not yet implemented
it_it: %s: Tipo sconosciuto o non ancora implementato.

source: Already oing operation
it_it: Operazione già in corso

source: Error pvm_reduce: Unknow reduction operation %s
it_it: Errore in pvm_reduce: l'operazione di riduzione %s è conosciuta

source: Out of ressources
it_it: Le risorse sono esaurite
