Repository: ScilabOrg/scilab
Catalog: scilab/modules/matio/locales_macros/*.po
Languages: fr_fr

source: %s mlist type not yet implemented.
fr_fr: Le type %s mlist n''est pas encore implémenté.

source: %s not yet implemented.
fr_fr: %s n''est pas encore implémenté.

source: %s: Cannot open file %s.
fr_fr: %s : Impossible d''ouvrir le fichier %s.

source: %s: Could not open file ''%s''.
fr_fr: %s : Impossible d''ouvrir le fichier %s.

source: %s: No variable read in file ''%s''. Check if your file is not corrupted.
fr_fr: %s : Impossible de lire le fichier ''%s''. Veuillez vérifier qu''il n''est pas corrompu.

source: %s: This feature has not been implemented: %s.
fr_fr: %s : Cette fonctionnalité n''a pas été implémentée : %s.

source: %s: Wrong type for input argument #%d: Matrix of strings expected.
fr_fr: %s : Type erroné de l''argument d''entrée n°%d : Une matrice de chaîne de caractères attendue.

source: All inputs must be character strings.
fr_fr: Toutes les entrées doivent être des chaînes de caractères.

source: Attempt to write an unsupported data type to an ASCII file.
fr_fr: Tentative d''écriture d''un type de données non supporté vers un fichier ASCII.

source: Error while writing MI.
fr_fr: Erreur à l''écriture du MI.

source: Found Datatype=%d, expecting %d.
fr_fr: Type de données trouvé : %d, Attendu : %d.

source: Invalid level 5 binary MAT-file!.
fr_fr: Fichier binaire MAT niveau 5 invalide !

source: MATLAB 5.0 MAT-file, Generated by Scilab
fr_fr: MAT-file MATLAB 5.0, Généré par Scilab

source: Name conflict: it is not possible to save variable with name %s.
fr_fr: Conflit de nom : il n''est pas possible d'enregistrer la variable sous le nom %s.

source: Not implemented DataType: %d.
fr_fr: Type de données non implémenté : %d.

source: Option %s not implemented: IGNORED.
fr_fr: Option %s non implementée : IGNORÉ.

source: Option -v7 added.
fr_fr: Option -v7 ajoutée.

source: Scilab string matrix saved as Matlab Cell.
fr_fr: La matrice de chaînes de caractères Scilab a été enregistrée en tant que Matlab Cell.

source: Unknown Class.
fr_fr: Classe inconnue.

source: Unknown integer type: %s.
fr_fr: Type d''entier inconnu : %s.

source: Variable %s can not be saved in ASCII file: IGNORED.
fr_fr: Impossible d'enregistrer la variable %s au format ASCII : IGNORÉ.

source: Variable %s can not be saved in level 4 MAT-file: IGNORED.
fr_fr: Impossible d'enregistrer la variable %s dans MAT-file niveau 4 : IGNORÉ.

source: Version %d MAT-file not implemented.
fr_fr: MAT-file version %d non implémenté.

source: savematfile: could not save variable named %s.
fr_fr: savematfile : Impossible d'enregistrer la variable nommée %s.
