Repository: ScilabOrg/scilab
Catalog: scilab/modules/graphic_export/locales/*/graphic_export.po
Languages: pl_pl, zh_cn, zh_tw

source: Scilab graphic module disabled -nogui or -nwni mode.
pl_pl: Moduł graficzny Scilab niesprawny tryb -nogui lub -nwni.
zh_cn: 在-nogui或-nwni模式下Scilab的图形模块被禁用。
zh_tw: Scilab graphic 模組 已被-nogui or -nwni模式停用.

source: Scilab Graphic export module not installed.
pl_pl: Scilab nie zainstalowany moduł eksportu grafiki.
zh_cn: Scilab的图形导出模块没有被安装。
zh_tw: Scilab Graphic 匯出模組未安裝.

source: %s: Wrong value for input argument #%d: '%s' or '%s' expected.
pl_pl: %s: Nieprawidłowa wartość parametru wejściowego #%d: oczekiwano '%s' lub '%s'.
zh_cn: %s：输入参数#%d的值错误：应该为'%s'或'%s'。
zh_tw: %s: 第 %d 個輸入參數數值錯誤: 應為 '%s' 或 '%s'.

source: %s: OpenGL error during export.
pl_pl: %s: OpenGL błąd podczas exportu.
zh_cn: %s：在导出时发生OpenGL错误。
zh_tw: %s: 匯出過程中OpenGL錯誤.

source: %s: Unable to create export file, permission denied.
zh_cn: %s：无法创建导出文件，权限不足。
zh_tw: %s: 無法建立匯出檔.禁止操作.

source: %s: GL2PS error during export.
pl_pl: %s: GL2PS błąd podczas exportu.
zh_cn: %s：导出时发生GL2PS错误。
zh_tw: %s: 匯出過程中 GL2PS 錯誤.

source: %s: Unable to create export file, figure is too complex.
pl_pl: %s: Nie można utworzyć pliku eksportu, figura jest zbyt skomplikowana.
zh_cn: %s：无法创建导出文件，figure太复杂。
zh_tw: %s: 無法建立匯出檔.圖太複雜.

source: %s: Wrong type for input argument #%d: Positive integer expected.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwana dodatnia liczba całkowita.
zh_cn: %s：输入参数#%d的类型错误：应该为正整数。
zh_tw: %s: 輸入參數型別有誤#%d: 正整數才對.

source: %s: Wrong type for input argument #%d: Single character string expected.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwany pojedynczy ciąg znaków.
zh_cn: %s：输入参数#%d的类型错误：应该为单字符字符串。
zh_tw: %s: 輸入參數型別有誤#%d: 單一字元字串才對.

source: %s has been replaced by %s
pl_pl: %s został zastąpiony przez %s
zh_cn: %s已经被%s替换
zh_tw: %s 已經被%s 置換掉

source: %s: %s must be called before any action.
pl_pl: %s: %s musi być wywoływana przed jakimkolwiek działaniem.
zh_cn: %s：%s必须在其他操作前被调用。
zh_tw: %s: %s 必須在任何動作之前被呼叫.

source: %s: Wrong number of input arguments: Function has no input argument with ''%s'' or ''%s'' drivers.
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: Funkcja nie ma argumentu wejściowego z ''%s'' lub ''%s'' sterowników.
zh_tw: %s:輸入參數數目有誤:函式沒有''%s'' or ''%s'' 驅動程式的輸入參數.

source: %s: Wrong number of input argument: String expected with ''%s'', ''%s'', ''%s'' or ''%s'' drivers.
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: Oczekiwano ciągu znaków z ''%s'', ''%s'', ''%s'' lub ''%s'' sterowników.
zh_cn: %s：输入参数的数目错误：String expected with ''%s'', ''%s'', ''%s'' or ''%s'' drivers.
zh_tw: %s:輸入參數數目有誤:''%s'' or ''%s'' 驅動程式的''%s'', ''%s''字串輸入參數才對.

source: %s: Wrong type for input argument #%d: String expected.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwany jest ciąg znaków.
zh_cn: %s：输入参数#%d的类型错误：应该为字符串。
zh_tw: %s: 第 %d 個輸入參數型態錯誤: 應該是字串型態.

source: %s: Wrong number of input arguments: %d to %d expected.
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano od %d do %d.
zh_cn: %s：输入参数的数目错误：应该为%d到%d个参数。
zh_tw: %s: 輸入參數之數目錯誤: 應為 %d 到 %d 之數.

source: %s: Wrong type for input argument #%d: Integer expected.
pl_pl: %s: Nieprawidłowy typ parametru wejściowego #%d: Oczekiwana wartości całkowita.
zh_cn: %s：输入参数#%d类型错误：应该为整数。
zh_tw: %s: 第 %d 個輸入參數型態錯誤: 應為一整數.

source: %s: Wrong value for input argument #%d: ''%s'' or ''%s'' expected.
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: oczekiwana "%s" lub "%s" .
zh_cn: %s：输入参数#%d的值错误：应该为''%s''或者''%s''。
zh_tw: %s: 第 %d 個輸入參數數值錯誤: 應為 ''%s'' 或 ''%s'' .

source: %s: EMF format only available under Microsoft Windows OS.
pl_pl: %s: Format EMF dostępny tylko w systemie Microsoft Windows OS.
zh_cn: %s: EMF格式只可在微软Windows操作系统中可用。
zh_tw: %s: EMF格式只在Microsoft Windows OS之下是有效的.

source: %s: Unable to execute pstoedit.
pl_pl: %s: Nie można wykonać polecenia pstoedit.
zh_tw: %s: 不能執行pstoedit.

source: xbasimp has been replaced by toprint for printing and by xs2ps for the file export
zh_cn: 在打印时xbasimp已经被toprint代替，在文件导出时被xs2ps代替
zh_tw: xbasimp已經被列印的toprint 和匯出檔案的xs2ps 取代掉。

source: %s: Unable to locate pstoedit. Please install pstoedit or add it to the PATH to be able to use this feature.
pl_pl: %s: Nie można znaleźć pstoedit. Proszę zainstalować pstoedit lub dodać do PATH, aby móc korzystać z tej funkcji.
zh_cn: %s：无法找到pstoedit，如使用这个功能请安装pstoedit或者添加它所在目录到PATH中。
zh_tw: %s:不能執行pstoedit. 請安裝pstoedit或者將它加入PATH 以便使用這個功能.

source: %s: Wrong value for input argument #%d: ''%s'', ''%s'', ''%s'', ''%s'', ''%s'' or ''%s'' expected.
pl_pl: %s: Niewłaściwa wartość argumentu wejściowego #%d: oczekiwana jest ''%s'', ''%s'', ''%s'', ''%s'', "%s" lub "%s".
zh_cn: %s：输入参数#%d的值错误：应该为''%s''，''%s''，''%s''，''%s''，''%s''或''%s''。
zh_tw: %s:輸入參數值有誤:#%d: ''%s'', ''%s'', ''%s'', ''%s'', ''%s'' or ''%s'' 才對.
