Repository: ScilabOrg/scilab
Catalog: scilab/modules/graphics/locales/*/graphics.po
Languages: fr_fr, pl_pl, pt_br

source: Wrong size for '%s' property: Must be in the set {%s}.
fr_fr: Mauvaise dimension pour la propriété '%s': Doit être dans l'ensemble {%s}.
pl_pl: Zły rozmiar dla '%s' własności: musi być w zestawie {%s}.

source: Wrong size for '%s' property: Must have %d columns.
fr_fr: Mauvaise dimension pour la propriété '%s': Doit avoir %d colonnes.
pl_pl: Nieprawidłowy rozmiar własności '%s': musi mieć %d kolumn.

source: Wrong size for '%s' property: Row vector expected.
fr_fr: Mauvaise dimension pour la propriété '%s': Un vecteur ligne attendu.
pl_pl: Nieprawidłowy rozmiar własności '%s': oczekiwany jest wektor wierszowy.

source: Wrong size for '%s' property: Scalar expected.
fr_fr: Mauvaise dimension pour la propriété '%s': Un scalaire attendu.
pl_pl: Nieprawidłowy rozmiar własności '%s': oczekiwany jest skalar.

source: Wrong size for input argument: %d or %d expected.
fr_fr: Mauvaise dimension pour l'argument d'entrée : %d ou %d attendu.
pl_pl: Nieprawidłowy rozmiar argumentu wejściowego: oczekiwany jest %d lub %d.
pt_br: Tipo errado para o argumento de entrada: Esperava-se %d ou %d.

source: Wrong type for '%s' property: '%s' handle or '%s' handle expected.
fr_fr: Mauvais type pour la propriété '%s': Un handle '%s' ou un handle '%s' attendu.
pl_pl: Nieprawidłowy typ dla '%s' własności: '%s' handle lub '%s' handle oczekiwanego.

source: Wrong type for '%s' property: Graphic handle array expected.
fr_fr: Mauvais type pour la propriété de '%s' : Tableau d'identificateur graphique attendu

source: Wrong type for '%s' property: Handle expected.
fr_fr: Mauvais type pour la propriété '%s': Un handle attendu.
pl_pl: Nieprawidłowy typ dla '%s' własności: handle oczekiwane.

source: Wrong type for '%s' property: Integer expected.
fr_fr: Mauvais type pour la propriété '%s': Un entier attendu.
pl_pl: Nieprawidłowy typ własności '%s': oczekiwana jest wartość iteger.

source: Wrong type for '%s' property: Real expected.
fr_fr: Mauvais type pour la propriété '%s': Un réel attendu.
pl_pl: Nieprawidłowy typ własności '%s': oczekiwana jest wartość real.

source: Wrong type for '%s' property: Real matrix expected.
fr_fr: Mauvaise valeur pour la propriété '%s': Une matrice réelle attendue.
pl_pl: Nieprawidłowy typ własności '%s': oczekiwana jest macierz wartości real.

source: Wrong type for '%s' property: Real or '%s' handle expected.
fr_fr: Mauvais type pour la propriété '%s': Un réel ou un handle '%s' attendu.
pl_pl: Nieprawidłowy typ dla '%s' własności: zmienna real lub handle oczekiwane'%s' .

source: Wrong type for '%s' property: String expected.
fr_fr: Mauvais type pour la propriété '%s': Une chaîne de caractères attendue.
pl_pl: Nieprawidłowy typ własności '%s': oczekiwany jest łańcuch znaków.

source: Wrong type for '%s' property: String matrix expected.
fr_fr: Mauvais type pour la propriété '%s': Une matrice de chaînes de caractères attendue.
pl_pl: Nieprawidłowy typ własności '%s': oczekiwana jest macierz łańcuchów znakowych.

source: Wrong type for '%s' property: Typed list expected.
fr_fr: Mauvais type pour la propriété '%s': Une liste typée attendue.
pl_pl: Nieprawidłowy typ dla '%s' własności: oczekiwana wpisana lista.

source: Wrong type for input argument: Tlist expected.
fr_fr: Mauvais type pour l'argument d'entrée : Tlist attendu.
pl_pl: Nieprawidłowy typ dla argumentu wejściowego: oczekiwano Tlist.
pt_br: Tipo errado para o argumento de entrada: Esperava-se Tlist.

source: Wrong value for '%s' property.
fr_fr: Mauvaise valeur pour la propriété '%s'.
pl_pl: Nieprawidłowa wartość właściwości '%s'.

source: Wrong value for '%s' property: %s or %s expected.
fr_fr: Mauvaise valeur pour la propriété '%s': %s ou %s attendu.
pl_pl: Nieprawidłowa wartość właściwości '%s': oczekiwana jest %s lub %s.

source: Wrong value for '%s' property: An Integer between %d and %d expected.
fr_fr: Mauvaise valeur pour la propriété '%s': Un entier entre %d et %d attendu.
pl_pl: Nieprawidłowa wartość właściwości '%s': oczekiwana jest wartość integer pomiędzy %d i %d.

source: Wrong value for '%s' property: Must be '%s'.
fr_fr: Mauvaise valeur pour la propriété '%s': Doit être '%s'.
pl_pl: Nieprawidłowa wartość właściwości '%s': musi być '%s'.

source: Wrong value for '%s' property: Must be -1 or a valid color index.
fr_fr: Mauvaise valeur pour la propriété '%s': Doit valoir -1 ou un index de couleur valide.
pl_pl: Nieprawidłowa wartość dla '%s' własności: Musi być -1 lub ważnego wskaźnika koloru.

source: Wrong value for '%s' property: Must be a handle on a axes.
fr_fr: Mauvaise valeur pour la propriété '%s': Doit être un handle vers un axes.
pl_pl: Nieprawidłowa wartość dla '%s' własności: handle musi być na osi.

source: Wrong value for '%s' property: Must be a valid color index.
fr_fr: Mauvaise valeur pour la propriété '%s': Doit être un indice de couleur valide.
pl_pl: Nieprawidłowa wartość dla '%s' musi być ważny wskaźnik koloru.

source: Wrong value for '%s' property: Must be a valid handle.
fr_fr: Mauvaise valeur pour la propriété '%s': Doit être un handle valide.
pl_pl: Nieprawidłowa wartość dla '%s' własności: Handle musi być ważne.

source: Wrong value for '%s' property: Must be between %d and %d.
fr_fr: Mauvaise valeur pour la propriété '%s': Doit être entre %d et %d.
pl_pl: Nieprawidłowa wartość właściwości '%s': musi być pomiędzy %d i %d.

source: Wrong value for '%s' property: Must be in the set {%s}.
fr_fr: Mauvaise valeur pour la propriété '%s': Doit être dans l'ensemble {%s}.
pl_pl: Nieprawidłowa wartość właściwości '%s': musi być w zestawie {%s}.

source: Wrong value for '%s' property: Smaller values expected.
fr_fr: Mauvaise valeur pour la propriété '%s': Une plus petite valeur attendue.
pl_pl: Nieprawidłowa wartość właściwości '%s': oczekiwane są mniejsze wartości.

source: You are not using a legend object.
fr_fr: Vous n'êtes pas en train d'utiliser un objet legend.
pl_pl: Nie używasz obiektu legendy.
pt_br: Você não está utilizando um objeto legend.

source: You must first specify an %s for this object.
fr_fr: Vous devez spécifier un %s pour cet objet.
pt_br: Você primeiro deve especificar um %s para este objeto.

source: automatic
fr_fr: automatique

source: lower left
fr_fr: en bas à gauche

source: lower right
fr_fr: en bas à droite

source: select the curve tip display function
fr_fr: sélectionner la fonction d'affichage d'étiquette de courbe

source: upper left
fr_fr: en haut à gauche

source: upper right
fr_fr: en haut à droite

source: Jet
pt_br: Jato

source: %s: Misplaced optional argument: #%d must be at position %d
pt_br: %s: Argumento opcional deslocado: #%d deve estar na posição %d

source: %s: Wrong type for input argument #%d: '%s' or handle expected.
pl_pl: %s: Nieprawidłowy typ dla argumentu wejściowego #%d: oczekiwano '%s' lub łączy.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se '%s' ou um manipulador.

source: Demo of %s().
pt_br: Demonstração de %s().

source: %s: Wrong type for input argument #%d: Single double or boolean vector expected.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um único double ou um vetor de booleanos.

source: %s: Wrong type for input argument #%d: Single double expected.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um único double.

source: %s: Using xgetmouse with a flag to avoid the event queue to be cleared is obsolete. This functionnality will be permanently removed in Scilab 5.1.
pt_br: %s: Utilizar xgetmouse com um indicador para evitar que a fila de eventos seja limpa está obsoleto. Esta funcionalidade será permanentemente removida no Scilab 5.1.

source: Warning: Nax does not work with logarithmic scaling
pt_br: Aviso: Nax não trabalha com escala logarítmica

source: Warning : Nax does not work with logarithmic scaling
pt_br: Aviso: Nax não trabalha com escala logarítmica

source: Warning : Nax does not work with logarithmic scaling.
pt_br: Aviso: Nax não trabalha com escala logarítmica.

source: Wrong value for %s property: Must be in the interval [%s, %s].
pt_br: Valor errado para propriedade %s: Deve estar no intervalo [%s, %s].

source: Error accessing alignment property.
pt_br: Erro ao se acessar a propriedade de alinhamento.

source: %s property does not exist for this handle.
pt_br: %s A propriedade não existe para este manipulador.

source: %s undefined for this object.
pt_br: %s Indefinido para este objeto.

source: %s property undefined for this object.
pt_br: %s Propriedade indefinida para este objeto.

source: %s does not exist for this handle.
pt_br: %s não existe para este manipulador.

source: %s is not correctly defined.
pt_br: %s não está corretamente definido.

source: %s property undefined for this handle.
pt_br: A propriedade %s é indefinida para este manipulador.

source: %s property does not exist for this label.
pt_br: A propriedade %s não existe para este rótulo.

source: %s: Wrong type for input argument #%d: '%s','%s' or '%s' expected.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se '%s','%s' ou '%s'.

source: Incompatible type for property %s: Single character string expected.
pt_br: Tipo incompatível para a propriedade %s: Esperava-se um único string.

source: Wrong value for property %s: value must be '%s' or '%s'.
pt_br: Valor errado para a propriedade %s: O valor deve ser '%s' ou '%s'.

source: %s: Wrong input argument: '%s' or '%s' expected.
pt_br: %s: Argumento de entrada errado: Esperava-se '%s' ou '%s'.

source: Wrong value: '%s' or '%s' expected.
pt_br: Valor errado: Esperava-se '%s' ou '%s'.

source: %s: Wrong input argument #%d: '%s' or '%s' expected.
pt_br: %s: Argumento de entrada errado #%d: Esperava-se "%s" ou "%s".

source: Wrong value for input argument #%d: Between %d to %d expected.
pt_br: Valor errado para o argumento de entrada #%d: Esperava-se entre %d e %d.

source: Wrong size for argument #%d: %d elements expected.
pt_br: Tamanho errado para o argumento de entrada #%d: Esperava-se %d elementos.

source: %s: Wrong input argument #%d: '%s' or '%s' expected.
pt_br: %s: Argumento de entrada errado #%d: Esperava-se '%s' ou '%s'.

source: Wrong value for property '%s': smaller values expected.
pt_br: Valor errado para a propriedade '%s': Esperava-se valores menores.

source: %s must be set to '%s' or '%s'.
pt_br: %s Deve ser ajustado para '%s' ou '%s'.

source: %s: Wrong type for input argument #%d: '%s', '%s', '%s' or '%s' expected.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se '%s', '%s', '%s' ou '%s'.

source: Incompatible value for property %s: Must be %d, %d, %d or %d.
pt_br: Valor incompatível para a propriedade%s: Deve ser %d, %d, %d ou %d.

source: Wrong value for argument: '%s' or '%s' expected.
pt_br: Valor errado para o argumento: Esperava-se '%s' ou '%s'.

source: Argument must be a vector of size %d.
pt_br: O argumento deve ser um vetor de tamanho %d.

source: %s: Wrong type for input argument #%d: %d or %d expected.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se %d ou %d.

source: %s: Wrong type for input argument #%d: %d, %d, %d, %d or %d expected.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se %d, %d, %d, %d ou %d.

source: Warning: %s property is only used in 3D mode.
pt_br: Aviso: A propriedade %s só é utilizada no modo 3D.

source: Wrong size for input argument #%d: A real or a 'Figure' handle expected.
pt_br: Tamanho errado para o argumento de entrada #%d: Esperava-se um real ou um manipulador 'Figure'.

source: Wrong type for input argument #%d: A real or a '%s' handle expected.
pt_br: Tipo errado para o argumento de entrada #%d: Esperava-se um real ou um manipulador '%s'.

source: Wrong size for argument #%d: %s, %s, %s, %s, %s or %s matrix expected.
pt_br: Tamanho errado para o argumento de entrada #%d: Esperava-se uma matriz %s, %s, %s, %s, %s ou %s.

source: Value must be %d to set default values.
pt_br: O valor deve ser %d para se ajustar os valores padrões.

source: Wrong size for %s property: Vector of size %d expected.
pt_br: Tamanho errado para a propriedade %s: Esperava-se um vetor de tamanho %d.

source: %s: Wrong type for input argument #%d: '%s' or '%s' expected.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se '%s' ou '%s'.

source: Wrong value for property %s: An Integer between %d and %d expected.
pt_br: Valor errado para a propriedade %s: Esperava-se um inteiro entre %d e %d.

source: Wrong size for argument: %s or %s expected.
pt_br: Tamanho errado para o argumento : Esperava-se %s ou %s.

source: Wrong value for argument: %d (no grid) or number of color expected.
pt_br: Valor errado para o argumento: Esperava-se %d (sem grid) ou um número de cor.

source: Color outside of color map boundaries.
pt_br: Cor fora dos limites do mapa de cores.

source: %s can only be set on %s objects.
pt_br: %s só pode ser ajustado em objetos %s.

source: %s: Wrong type for input argument #%d: '%s', '%s' or '%s' expected.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se '%s', '%s' ou '%s'.

source: %s Invalid dimension of the assigned handle, expected dimension is %d.
pt_br: %s Dimensão inválida do vetor designado, a dimensão esperada é %d.

source: %s: Wrong size for argument: %d or %d expected.
pt_br: %s: Tamanho errado para o argumento: Esperava-se %d ou %d.

source: %s: Wrong type for '%s' property: A '%s' or a '%s' handle expected.
pt_br: %s: Tipo errado para a propriedade '%s': Esperava-se um manipulador '%s' ou '%s'.

source: Wrong value for %s property: Must be between %d and %d.
pt_br: Valor errado para a propriedade %s: Deve estar entre %d e %d.

source: Value must have %d elements (%d if in 3D).
pt_br: Value deve ter %d elementos (%d no modo 3D).

source: Wrong value for input argument: '%s' or '%s' expected.
pt_br: Valor errado para o argumento de entrada: Esperava-se '%s' ou '%s'.

source: %s: Wrong value for input argument: '%s', '%s' or '%s' expected.
pt_br: %s: Valor errado para o argumento de entrada: Esperava-se '%s', '%s' ou '%s'.

source: %s must be a 2D vector.
pt_br: %s deve ser um vetor 2D.

source: %s: Wrong type for input argument #%d: Row vector expected.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um vetor-linha.

source: Value must have at least %d elements.
pt_br: Value deve ter pelo menos %d elementos.

source: Wrong value for argument: %s or %s expected.
pt_br: Valor errado para o argumento: Esperava-se %s ou %s.

source: Wrong value for %s: '%s' or '%s' or '%s' expected.
pt_br: Valor errado para %s: Esperava-se '%s' ou '%s' ou '%s'.

source: %s: Wrong value for input argument #%d: '%s' or '%s' expected.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se '%s' ou '%s'.

source: Argument #%d must have %d columns.
pt_br: O argumento #%d deve ter %d colunas.

source: This handle has no %s property.
pt_br: Este manipulador não possui propriedade %s.

source: Bad input, %s should be a row or column vector.
pt_br: Entrada ruim, %s deveria ser um vetor-linha ou coluna.

source: Wrong size for input vector.
pt_br: Tamanho errado para o vetor de entrada.

source: %s: Wrong type for input argument #%d: Vector expected.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um vetor.

source: Wrong size for property %s: A vector of size %d expected.
pt_br: Tamanho errado para a propriedade %s: Esperava-se um vetor de tamanho %d.

source: Argument must be a vector of size %d (or %d in 2d).
pt_br: O argumento deve ser um vetor de tamanho %d (ou %d no modo 2d).
