Repository: ScilabOrg/scilab
Catalog: scilab/modules/graphics/locales/*/graphics.po
Languages: fr_fr, pl_pl, pt_br

source: Argument #%d must have %d elements.
fr_fr: L'argument n°%d doit avoir %d éléments.
pl_pl: Argument #%d musi mieć %d elementów.
pt_br: O argumento #%d deve ter elementos %d.

source: Autumn
fr_fr: Automne
pl_pl: Jesień
pt_br: Outono

source: Bad size in %s: you must first increase the size of the %s.
fr_fr: Mauvaise dimension dans %s : vous devez d'abord augmenter la taille de %s.
pl_pl: Zły rozmiar %s: najpierw musisz zwiększyć rozmiar %s.
pt_br: Tamanho ruim em %s: Você deve primeiro aumentar o tamanho de %s.

source: Bone
fr_fr: Os
pl_pl: Zaokrąglone
pt_br: Osso

source: Can not change the %s of graphic object: its type is %s.
fr_fr: Ne peut pas changer le %s de l'objet graphique : son type est %s.
pl_pl: Niemożna zmienić %s obiektu graficznego: jego typ to %s.
pt_br: Não se pode modificar o objeto gráfico %s: o seu tipo é %s.

source: Can not set directly a label object.
fr_fr: Ne peut pas activer directement le label d'un objet.
pl_pl: Nie można ustawić bezpośrednio obiektu etykiety.
pt_br: Não se pode ajustar diretamente um objeto Label.

source: Cancel
fr_fr: Annuler
pl_pl: Anuluj
pt_br: Cancelar

source: Children property can not be modified directly.
fr_fr: La propriété enfant ne peut pas être modifiée directement.
pl_pl: Własności elementu potomnego nie mogą być zmienione bezpośrednio.
pt_br: A propriedade do filho não pode ser modificada diretamente.

source: Color matrix is NULL: Can not build color scaled linearly into the current colormap
fr_fr: La matrice de couleur est NULL : Ne peut pas construire des couleurs échelonnées linéairement dans la carte de couleurs courante
pl_pl: Kolor macierzy jest zerem: Nie można zbudować koloru skanowaniem liniowym w bieżącej kolor-mapie.
pt_br: A matriz de cores é NULL: Não se pode construir cor em escala linear no mapa de cores correntes

source: Color number
fr_fr: Numéro de la couleur
pl_pl: Numer koloru
pt_br: Número de cor

source: Colormap
fr_fr: Palette de couleurs
pl_pl: Paleta kolorów
pt_br: Mapa de cores

source: Common X axis
fr_fr: Axe X commun

source: Coordinates modifications are only applicable on axes objects.
fr_fr: Les modifications de coordonnées ne sont applicables que sur les objets axes.
pl_pl: Modyfikacje współrzędnych mogą być stosowane wyłącznie na osi obiektów.
pt_br: As modificações de coordenadas só são aplicáveis a objetos ''Axes'' agora.

source: Copper
fr_fr: Cuivre
pl_pl: Miedź
pt_br: Cobre

source: Customize your complex function
fr_fr: Customisez votre fonction complexe
pl_pl: Dostosowywanie funkcji zespolonej

source: Data tips cannot be attached to this curve, the user_data field is already used
fr_fr: Les étiquettes de données ne peuvent être liées à cette courbe. le champ user_data est déjà utilisé

source: Default axes cannot be create.
fr_fr: Les axes par défaut ne peuvent pas être créés.
pl_pl: Nie można stworzyć osi domyślnych.
pt_br: Os eixos padrões não podeim ser criados.

source: Default figure cannot be create.
fr_fr: La figure par défaut ne peut pas être créée.
pl_pl: Nie można utworzyć figury domyślnej.
pt_br: A figura padrão não pode ser criada.

source: Delete all datatips
fr_fr: Effacer toutes les étiquettes de données

source: Delete all datatips for the selected curve
fr_fr: Effacer toutes les étiquettes de données pour la courbe sélectionnée

source: Delete last datatip
fr_fr: Effacer la dernière étiquette de donnée

source: Delete nearest datatip
fr_fr: Effacer l'étiquette de donnée la plus proche

source: Disable interpolation
fr_fr: Désactiver l'interpolation

source: Edit the curve tip display function
fr_fr: Editer la fonction d'affichage du datatip de la courbe

source: Enable interpolation
fr_fr: Activer l'interpolation

source: Entity with type %d cannot be destroyed.
fr_fr: L'entité de type %d ne peut pas être supprimée.
pl_pl: Nie można zniszczyć jednostki typu %d.
pt_br: Entidade com tipo %d não pode ser destruída.

source: Error %d at line %d of the function: ''%s''
fr_fr: Erreur %d à la ligne %d de la fonction : ''%s''
pl_pl: Błąd %d w linii %d funkcji: "%s"
pt_br: Erro %d na linha %d da função tal: ''%s''

source: Error relocating handle %d.
fr_fr: Erreur pendant le déplacement du handle %d.
pl_pl: błąd przenoszenia handle %d.
pt_br: Erro ao se alocar o manipulador %d.

source: Error: Bad size in %s ; you must first increase the size of the %s.
fr_fr: Erreur : Mauvaise dimension dans %s ; vous devez d'abord augmenter la taille de %s.
pl_pl: Błąd: niewłaściwy rozmiar w %s: musisz najpierw zwiększyć rozmiar %s.
pt_br: Erro: Tamanho ruim em %s ; primeiro, você deve aumentar o tamanho de %s.

source: Error: ComputeFormat must be used with SCI_AXES objects
fr_fr: Erreur : ComputeFormat doit être utilisé avec les objets SCI_AXES
pl_pl: Błąd: Format komputera musi być używany z obiektami SCI_AXES
pt_br: Erro: ComputeFormat deve ser utilizado com objetos SCI_AXES

source: Error: data_bounds on %s axis must be strictly positive to switch to logarithmic mode.
fr_fr: Erreur : data_bounds suivant l'axe %s doit être strictement positif pour passer au mode logarithmique.
pl_pl: Błąd: data_bonus włączono %s osie muszą być wyłącznie dodatnie, aby przejść do trybu logarytmicznego.
pt_br: Erro: data_bounds no eixo %s deve ser estritamente positivo para se alternar para o modo logarítmico.

source: Figure name may not contains any %% character, except a single %%d.
fr_fr: Le nom de la figure ne doit pas contenir de caractères %%, à part un seul %%d.
pl_pl: Nazwa rysunku nie może zawierać znaków %%, z wyjątkiem jednego %%d.
pt_br: O nome da figura não pode conter qualquer caractere %%, exceto um único %%d.

source: Graphic window number %d
fr_fr: Figure n°%d
pl_pl: Okno graficzne numer %d
pt_br: Janela gráfica número %d

source: Graphics
fr_fr: Graphiques
pl_pl: Grafika
pt_br: Gráficos

source: Graphics with 2 different Y-scales
fr_fr: Graphiques avec 2 échelles Y différentes

source: Gray
fr_fr: Gris
pl_pl: Szary
pt_br: Cinzento

source: HSV
fr_fr: TSV

source: Handle #%d is not compatible with its new parent.
fr_fr: Handle n°%d n'est pas compatible avec son nouveau parent.
pl_pl: Handle #%d nie jest kompatybilne z nowym systemem.
pt_br: O manipulador #%d não é compatível com o seu novo pai.

source: Handle #%d is not or no more valid.
fr_fr: Handle n°%d n'est pas ou n'est plus valide.
pl_pl: Handle #%d nie jest ważne lub nie więcej.
pt_br: O manipulador #%d não é válido ou não é mais válido.

source: Handle is not a SubWindow.
fr_fr: Le handle n'est pas un SubWindow.
pl_pl: Handle nie jest oknem ekranu.
pt_br: O manipulador não está em uma subjanela.

source: Handle number %d is not compatible with the parent handle.
fr_fr: Handle numéro %d n'est pas compatible avec le handle parent.
pl_pl: Numer handle %d nie jest kompatybilny z rodziną handle. .
pt_br: O manipulador de número %d não é compatível com o manipulador pai.

source: Handle number %d is not or no more valid.
fr_fr: Handle numéro %d n'est pas ou n'est plus valide.
pl_pl: Numer handle %d jest nie ważny lub mniej ważny.
pt_br: O manipulador de número %d não é válido ou não é mais válido.

source: Hot
fr_fr: Chaud
pl_pl: Gorący
pt_br: Quente

source: Impossible case when building axis
fr_fr: Cas impossible lors de la construction des axes
pl_pl: Niemożliwy przypadek kiedy budowana jet oś
pt_br: Caso impossível ao se construir o eixo

source: Impossible: %s must be freed before re-allocating
fr_fr: Impossible : %s doit être libérée avec d'être ré alloué
pl_pl: Nie wykonalne: %s musi zostać uwolnione przed realokacją
pt_br: Impossível: %s deve ser liberado antes da realocação

source: Incompatible type for property %s.
fr_fr: Type incompatible pour la propriété %s.
pl_pl: Niezgodny typ właściwości %s.
pt_br: Tipo incompatível para a propriedade %s.

source: Internal Error: Loop in graduate1
fr_fr: Erreur interne : Boucle dans graduate1
pl_pl: Błąd wewnętrzny: Pętla w graduate1
pt_br: Erro interno: Loop em graduate1

source: Left click on a curve to create a datatip, right opens
fr_fr: Clique gauche sur une courbe pour créer un datatip, clique droit ouvre

source: Left click on a curve to create a datatip, right opens contextual menu
fr_fr: Cliquer sur une courbe pour crée une étiquette de donnée, cliquer avec le bouton droit ouvre un menu contextuel

source: Left click on a graphic entity to open its property editor
fr_fr: Clique gauche sur une entité graphique pour ouvrir son éditeur de propriétés

source: Line width must be greater than %d.
fr_fr: L'épaisseur de la ligne doit être plus grande que %d.
pl_pl: Szerokość linii musi być większa niż %d.
pt_br: O comprimento de linha deve ser maior do que %d.

source: Misc
fr_fr: Divers
pl_pl: Pozostałe
pt_br: Miscelânea

source: Multiple datatips mode
fr_fr: Mode d'étiquettes de données multiples

source: Name
fr_fr: Nom
pl_pl: Nazwa
pt_br: Nome

source: No Callback is associated with this Entity.
fr_fr: Aucun callback n'est associé avec cette entité.
pl_pl: Funkcja Callback nie jest związana z tym Podmiotem.
pt_br: Nenhum Callback está associado a esta entidade.

source: No more place to allocates text string, try a shorter string.
fr_fr: Plus de place pour allouer une chaîne de caractères, essayez avec une chaîne plus courte.
pl_pl: Nie ma więcej miejsca przydzielonego łańcuchowi znakowemu, spróbuj z krótszym łańcuchem.
pt_br: Não há mais espaçp para se alocar o string de texto, tente um string menor.

source: Number of columns must be %d (%d if %s coordinate).
fr_fr: Le nombre de colonnes doit être %d (%d si en coordonnée %s).
pl_pl: Liczba kolumn musi wynosić %d (%d jeśli %s koordynowana).
pt_br: O número de colunas deve ser %d (%d de a coordenada for %s).

source: Number of columns must be %d.
fr_fr: %d colonnes sont attendues.
pl_pl: Liczba kolumn musi wynosić %d.
pt_br: O número de colunas deve ser %d.

source: Number of elements must be %d (%d if %s coordinate).
fr_fr: Le nombre d'éléments doit être %d (%d si en coordonnée %s).
pl_pl: Liczba kolumn musi wynosić %d (%d jeśli %s koordynowana).
pt_br: O número de elementos deve ser %d (%d de a coordenada for %s).

source: Number of elements must be %d (%d if z coordinate )
fr_fr: Le nombre d'éléments doit être %d (%d si coordonnée z)
pl_pl: Liczba elementów musi wynosić %d (%d jeśli z skoordynowane).
pt_br: O número de elementos deve ser %d (%d se a coordenada for z)

source: Object #%d is not correctly placed in the hierarchy.
fr_fr: Objet n°%d n'est pas placé correctement dans la hiérarchie.
pl_pl: Obiekt #%d nie jest prawidłowo umieszczony w hierarchii.
pt_br: O objeto #%d não está corretamente localizado na hierarquia.

source: Ocean
fr_fr: Océan
pt_br: Oceano

source: Old graphic mode is no longer available. Please refer to the set help page.
fr_fr: L'ancien mode graphique n'est plus disponible. Référez vous aux pages d'aide.
pl_pl: Stary tryb graficzny nie jest już dostępny. Proszę odnieść się do określonych stron pomocy.
pt_br: O modo gráfico antigo não está mais disponível. Por favor, encaminhe-se à página de ajuda de ''set''.

source: Only axes handles have a viewing area.
fr_fr: Seuls les handles de type axe ont une zone de visualisation.
pl_pl: Tylko osie handle widoczne na ekranie.
pt_br: Apenas manipuladores Axes possuem uma área de visualização.

source: Parent property can not be modified directly.
fr_fr: La propriété parent ne peut pas être modifiée directement.
pl_pl: Dominującej własności nie można zmieniać bezpośrednio.
pt_br: A propriedade do pai não pode ser modificada diretamente.

source: Pink
fr_fr: Rose
pl_pl: Różowy
pt_br: Rosa

source: Please send a Bug report to dev@lists.scilab.org
fr_fr: Merci d'envoyer un rapport de bug à dev@lists.scilab.org
pl_pl: Proszę, wyślij raport o błędach do dev@lists.scilab.org
pt_br: Por favor, envie um relatório de Bug a dev@lists.scilab.org

source: Plot with 3 different Y scales at shared X
fr_fr: Graphique avec 3 échelles Y différentes et une échelle X partagée

source: Problem with sciInitFontContext
fr_fr: Problème avec sciInitFontContext
pl_pl: Problem z sciInitFontContext
pt_br: Problema com sciInitFontContext

source: Rainbow
fr_fr: Arc-en-ciel
pl_pl: Tęcza
pt_br: Arco-íris

source: Redraw all datatips
fr_fr: Redessiner toutes les étiquettes de données

source: Scale n1
fr_fr: Echelle n° 1

source: Scilab Graphics module not installed.
fr_fr: Le module Scilab Graphics n'est pas installé.
pl_pl: Moduł graficzny Scilab jest nie zainstalowany.
pt_br: O módulo Gráfico do Scilab não foi instalado

source: Scilab graphic module disabled -nogui or -nwni mode.
fr_fr: Le module graphique de Scilab est désactivé en mode -nogui ou -nwni.
pl_pl: Moduł graficzny Scilab niesprawny tryb -nogui lub -nwni.
pt_br: O modo gráfico do Scilab desabilitou o modo -nogui ou -nwni.

source: Select tip orientation
fr_fr: Sélectionner l'orientation de l'étiquette

source: Spring
fr_fr: Printemps
pl_pl: Wiosna
pt_br: Primavera

source: Summer
fr_fr: Été
pl_pl: Lato
pt_br: Verão

source: Tcl/Tk interface not installed.
fr_fr: Interface Tcl/Tk pas installée.

source: The font size must be greater than %d.
fr_fr: La taille de la police doit être plus grande que %d.
pl_pl: Rozmiar czcionki musi być większy niż %d.
pt_br: O tamanho de fonte deve ser maior do que %d.

source: The line style must be greater than %d.
fr_fr: Le style de la ligne doit être plus grand que %d.
pl_pl: Styl linii musi być większa niż %d.
pt_br: O estilo de linha deve ser maior do que %d.

source: The mark size must be greater or equal than %d.
fr_fr: La taille de la marque doit être plus grande ou égale à %d.
pl_pl: Rozmiar znaku musi być większy lub równy %d.
pt_br: O tamanho de marca deve ser maior do que ou igual a %d.

source: The mark size unit must be greater than %d.
fr_fr: La taille de la marque unitaire doit être plus grande que %d.
pl_pl: Rozmiar znaku musi być większy niż %d.
pt_br: A unidade de tamanho da marca deve ser maior do que %d.

source: The parent handle is not or no more valid.
fr_fr: Le handle parent n'est pas ou n'est plus valide.
pt_br: O manipulador pai não é válido ou não mais válido.

source: The parent has to be a FIGURE
fr_fr: Le parent doit être une FIGURE
pl_pl: Parent musi być FIGURĄ
pt_br: O pai deve ser um FIGURE

source: The parent has to be a SUBWIN
fr_fr: Le parent doit être une SUBWIN
pl_pl: Parent musi być opcją SUBWIN
pt_br: O pai deve ser um SUBWIN

source: The selected file cannot be executed
fr_fr: Le fichier sélectionné ne peut pas être exécuté

source: The selected file defines more than one function
fr_fr: Le fichier sélectionné définit plus d'une fonction

source: The selected function must have 1 output parameter (str)
fr_fr: La fonction sélectionnée doit avoir 1 paramètre de sortie (str)

source: The selected function must have 3 input parameters (curve,pt,index)
fr_fr: La fonction sélectionnée doit avoir 3 paramètres d'entrée (curve,pt,index)

source: This object can not be moved.
fr_fr: Cet objet ne peut pas être déplacé.
pl_pl: Ten obiekt nie może być przeniesiony.
pt_br: Este objeto não pode ser movido.

source: This object cannot be cloned.
fr_fr: Cet objet ne peux pas être cloné.
pl_pl: Ten obiekt nie może być sklonowany.
pt_br: Este objeto não pode ser clonado

source: This object cannot be deleted.
fr_fr: Cet objet ne peut pas être supprimé.
pl_pl: Ten obiekt nie może być usunięty.
pt_br: Este objeto não pode ser deletado.

source: This object has no %s property.
fr_fr: Cet objet n'a pas de propriété %s.
pl_pl: Ten obiekt niema własności %s.
pt_br: Este objeto não possui propriedade %s.

source: This object has not any graphic mode
fr_fr: Cet objet n'a pas de mode graphique
pl_pl: Ten obiekt nie ma żadnego trybu graficznego.
pt_br: Este objeto não possui modo gráfico

source: Ticks location and label vectors must have the same size.
fr_fr: La position des graduations et le vecteur des labels doivent être de même taille.
pl_pl: Położenie zwrotu i etykieta wektora musi mieć ten sam rozmiar.
pt_br: A localização dos traços e os vetores de rótulos devem ter o mesmo tamanho.

source: Unable to compute data bounds for this kind of object.
fr_fr: Impossible de calculer les bornes des données pour ce type d'objet.
pl_pl: Nie można obliczyć granic danych dla tego typu obiektu.
pt_br: Não se consegue computar limites de dados para este tipo de objeto.

source: Unable to compute x_location for this kind of object.
fr_fr: Inpossible de calculer x_location pour ce type d'objet.
pl_pl: Nie można obliczyć x_location dla tego typu obiektu.
pt_br: Não se consegue computar x_location para este tipo de objeto.

source: Unable to compute y_location for this kind of object.
fr_fr: Incapable de calculer y_location pour ce type d'objet.
pl_pl: Nie można obliczyć y_location dla tego typu obiektu.
pt_br: Não se consegue computar y_location para este tipo de objeto.

source: Unable to create requested figure: No more memory.
fr_fr: Impossible de créer la figure demandée : Plus de mémoire.
pl_pl: Nie można utworzyć wnioskowanej figury: brak pamięci.
pt_br: Não se consegue criar a figura solicitada: Memória esgotada.

source: Unable to load default values.
fr_fr: Impossible de charger les valeurs par défaut.
pl_pl: Nie można załadować wartości domyślnych.
pt_br: Não se consegue carregar os valores padrões.

source: Under interpolated color mode the column dimension of the color vector must match the number of points defining the line (which must be %d or %d).
fr_fr: Sous le mode couleurs interpolées, la dimension de la colonne du vecteur de couleurs doit correspondre au nombre de points définissant la ligne (qui doivent être %d ou %d).
pl_pl: Pod interpolowanym trybem koloru wymiary kolumny wektora koloru muszą pasować do określonej liczby punktów w linii (które muszą być %d lub %d).
pt_br: Sob o modo de cores interpoladas, a dimensão da coluna do vetor de cores deve coincidir com o número de pontos definindo a linha (que deve ser %d ou %d).

source: Unhandled data field
fr_fr: Champ de données non supporté
pl_pl: Nieobsługiwane pole danych.
pt_br: Campo de dados não manipulado

source: Unique datatip mode
fr_fr: Mode d'étiquette de donnée unique

source: Unknown property: %s.
fr_fr: Propriété inconnue : %s.
pl_pl: Nieznana właściwość: %s.
pt_br: Propriedade desconhecida: %s.

source: WARNING !!! In '%s' property: '%s' is deprecated use '%s' instead.
fr_fr: ATTENTION !!! Dans la propriété '%s': '%s' est obsolète, utilisez '%s' à la place.
pl_pl: OSTRZEŻENIE !!! W '%s' własność: '%s' jest wykorzystana '%s' zamiast.

source: WARNING : The size of the figure may not be as wide as you want.
fr_fr: ATTENTION : La taille de la figure ne sera pas aussi grande que désiré.
pl_pl: UWAGA: rozmiar rysunku nie może być tak szeroki, jak chcesz.

source: WARNING: '%s' property can not be modified if the %s is docked with other elements.
fr_fr: Attention : La propriété '%s' ne peut pas être modifiée si le %s est collé avec d'autres éléments.
pl_pl: OSTRZEŻENIE: '%s' własność nie może być modyfikowana jeśli %s jest zadokowana z innymi elementami.

source: WARNING: Wrong value for '%s' property: indices outside the colormap will be clamped.
fr_fr: Attention: Mauvaise valeur pour la propriete '%s': les indices en dehors de la 'colormap' seront maintenus.
pl_pl: OSTRZEŻENIE: Nieprawidłowa wartość dla '%s' własności: Wskaźniki poza kolor-mapą będą blokowane.

source: Warning: %s has been set by user ; you must first increase the size of the %s string vector before switching to the new %s mode.
fr_fr: Attention : %s a été activé par l'utilisateur ; vous devez d'abord augmenter la taille du vecteur de chaîne de caractères %s avant de passer au nouveau mode %s.
pl_pl: OSTRZEŻENIE: %s został ustawiony przez użytkownika ; należy najpierw zwiększyć rozmiar %s ciągu znaków wektora przed włączeniem nowego trybu %s.
pt_br: Aviso: %s foi ajustado pelo usuário ; primeiro, você deve aumentar o tamanho do vetor de strings %s antes de alternar para o novo modo %s.

source: Warning: %s must be changed, %s is '%s' and %s dimension is not %d.
fr_fr: Attention : %s doit être changé, %s est un '%s' et la dimension de %s n'est pas %d.
pl_pl: OSTRZEŻENIE: %s musi być zmieniony, %s jest '%s' i %s nie jest wymiarowy %d.
pt_br: Aviso: %s deve ser modificado, %s é '%s' e a dimensão %s não é %d.

source: Warning: %s use is deprecated and no more taken into account, use %s property to edit Axes color.
fr_fr: Attention : L'utilisation de %s est obsolète et n'est plus prise en compte, utilisez la propriété %s pour éditer la couleur des axes.
pl_pl: OSTRZEŻENIE: %s użycie jest przestarzałe i nie brane więcej pod uwagę, należy użyć %s własności do edytowania kolorów osi.
pt_br: Aviso: o uso de %s é desaprovado e não será levado em conta, utilize a propriedade %s para editar as cores do objeto ''Axes''.

source: Warning: Can't use Log on X-axis xmin is negative.
fr_fr: Attention : ne peut pas utiliser Log sur l'axe X, xmin est négatif.
pl_pl: Ostrzeżenie: Nie można użyć Log na osi X , xmin jest ujemne.
pt_br: Aviso: Não se pode utilizar Log no eixo X, xmin é negativo.

source: Warning: Can't use Log on Y-axis ymin is negative.
fr_fr: Attention : ne peut pas utiliser Log sur l'axe Y, ymin est négatif.
pl_pl: Ostrzeżenie: nie można użyć Log na osi Y , ymin jest ujemne.
pt_br: Aviso: Não se pode utilizar Log no eixo Y, ymin é negativo.

source: Warning: Can't use Log on Z-axis zmin is negative.
fr_fr: Attention : ne peut pas utiliser Log sur l'axe Z, zmin est négatif.
pl_pl: Ostrzeżenie: nie można użyć Log na osi Z , zmin jest ujemne.
pt_br: Aviso: Não se pode utilizar Log no eixo Z, zmin é negativo.

source: Warning: Nax does not work with logarithmic scaling.
fr_fr: Attention : Nax ne fonctionne pas avec la mise à l'échelle logarithmique.
pl_pl: Ostrzeżenie: Nax nie działa ze skalą logarytmiczną.
pt_br: Aviso: Nax não trabalha com escala logarítmica.

source: White
fr_fr: Blanc
pl_pl: Biały
pt_br: Branco

source: Width and height must be positive.
fr_fr: La largeur et la hauteur doivent être positive.
pl_pl: Szerokość i wysokość musi być dodatnia.
pt_br: O comprimento e a altura devem ser positivos.

source: Winter
fr_fr: Hiver
pl_pl: Zima
pt_br: Inverno

source: Wrong size for %s element: A %d-by-%d matrix or a vector of size %d expected.
fr_fr: Mauvaise dimension pour l'élément %s : Une matrice %d-par-%d ou un vecteur de taille %d attendu.
pl_pl: Nieprawidłowy rozmiar elementu %s: oczekiwany jest %d-przez-%d lub wektor o rozmiarze %d.
pt_br: Tamanho errado para o elemento %s: Esperava-se uma matriz %d-por-%d ou um vetor de tamanho %d.

source: Wrong size for '%s' property: %d elements expected.
fr_fr: Mauvaise dimension pour la propriété '%s': %d éléménts attendus.
pl_pl: Nieprawidłowy rozmiar własności '%s': oczekiwane są elementy %d.

source: Wrong size for '%s' property: %d or %d elements expected.
fr_fr: Mauvaise dimension pour la propriété '%s': %d ou %d éléments attendus.
pl_pl: Nieprawidłowy rozmiar własności '%s': oczekiwane są elementy %d lub %d.

source: Wrong size for '%s' property: A scalar expected.
fr_fr: Mauvaise dimension pour la propriété '%s': Un scalaire attendu.
pl_pl: Nieprawidłowy rozmiar własności '%s': oczekiwany jest skalar.

source: Wrong size for '%s' property: At least %d elements expected.
fr_fr: Mauvaise dimension pour la propriété '%s': A moins %d éléments attendus.
pl_pl: Nieprawidłowy rozmiar własności '%s': oczekiwane jest przynajmniej %d elementów.

source: Wrong size for '%s' property: At most %d elements expected.
fr_fr: Mauvaise dimension pour la propriété '%s': Au plus %d éléments attendus.
pl_pl: Nieprawidłowy rozmiar własności '%s': oczekiwane jest najwyżej %d elementów.

source: Wrong size for '%s' property: Must be %s or %s.
fr_fr: Mauvaise dimension pour la propriété '%s': Doit être %s ou %s.
pl_pl: Nieprawidłowy rozmiar własności '%s': musi być %s lub %s.
