Repository: ScilabOrg/scilab
Catalog: scilab/modules/graphics/locales/*/graphics.po
Languages: fr_fr, pl_pl, pt_br

source: %s: Wrong size for input argument #%d: Single handle expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Un seul handle attendu.
pl_pl: %s: Nieprawidłowy rozmiar dla parametru wejściowego #%d: Oczekiwano pojedynczegą obsługe.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um único manipulador.

source: %s: Wrong size for input argument #%d: String of %d characters expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Une chaîne de %d caractères attendue.
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego #%d: oczekiwano łańcucha znaków %d.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um string de %d caracteres.

source: %s: Wrong size for input argument #%d: Vector of size %d expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Vecteur de taille %d attendu.
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego #%d: oczekiwano wektor o rozmiarze %d.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um vetor de tamanho %d.

source: %s: Wrong size for input argument #%d: Vector of size %d or %d expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un vecteur de taille %d ou %d attendu.
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego #%d: oczekiwano wektor o rozmiarze %d lub %d.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um vetor de tamanho %d ou %d.

source: %s: Wrong size for input argument %d: An ''Axes'' handle expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Un handle de type ''Axes'' attendu.
pl_pl: %s: Nieprawidłowy rozmiar dla parametru wejściowego #%d: Oczekiwano obsługi "Osi".
pt_br: %s: Tamanho errado para o argumento de entrada %d: Esperava-se um manipulador ''Axes'' .

source: %s: Wrong size for input argument ''%s'': A matrix of size greater than %d-by-%d expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée ''%s'': Une matrice de taille supérieure à %d-par-%d attendue.
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego ''%s'': oczekiwana macierz o rozmiarze większym niż %d-do-%d.

source: %s: Wrong size for input argument ''%s'': A non empty matrix expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée ''%s'': Une matrice non vide attendue.
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego ''%s'': oczekiwana macierz nie może być pusta.

source: %s: Wrong size for input argument ''%s'': A vector expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée ''%s'': Un vecteur attendu.
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego "%s": oczekiwano wektora.

source: %s: Wrong size for input arguments #%d and #%d.
fr_fr: %s : Mauvaise dimension pour les arguments d'entrée n°%d et n°%d.
pl_pl: %s: Nieprawidłowy rozmiar argumentów wejściowych #%d i #%d.
pt_br: %s: Tamanho errado para os argumentos de entrada #%d e #%d.

source: %s: Wrong size for input arguments #%d and #%d: %s expected.
fr_fr: %s : Mauvaise dimension pour les arguments d'entrée n°%d et n° %d : %s attendu.
pl_pl: %s: Nieprawidłowy rozmiar argumentów wejściowych #%d i #%d: oczekiwano %s.
pt_br: %s: Tamanhoerrado para o argumento de entrada #%d e #%d: Esperava-se %s.

source: %s: Wrong size for input arguments #%d and #%d: Incompatible length.
fr_fr: %s : Mauvaise dimension pour les arguments d'entrée n°%d et n° %d : Longueur incompatible.
pl_pl: %s: Nieprawidłowy rozmiar argumentów wejściowych #%d i #%d: niezgodna długość.
pt_br: %s: Tamanho errado para os argumentos de entrada #%d e #%d: Comprimentos incompatíveis.

source: %s: Wrong size for input arguments ''%s'' and ''%s'': Incompatible dimensions.
fr_fr: %s: Mauvaise dimension pour les arguments d'entrée ''%s'' et ''%s'': Dimensions incompatibles.
pl_pl: %s: Nieprawidłowy rozmiar argumentów "%s" i "%s": niezgodne wymiary.

source: %s: Wrong size for input arguments ''%s'' and ''%s'': Matrices of same size expected.
fr_fr: %s: Mauvaise dimension pour les arguments d'entrée ''%s'' et ''%s'': Des matrices de même taille attendues.
pl_pl: %s: Nieprawidłowy rozmiar argumentów wejściowych "%s" i "%s": oczekiwano macierzy o takim samym rozmiarze.

source: %s: Wrong size for input arguments ''%s'' and ''%s'': Same size expected.
fr_fr: %s: Mauvaise dimension pour les arguments d'entrée ''%s'' et ''%s'': Même dimension attendue.
pl_pl: %s: Nieprawidłowy rozmiar argumentów wejściowych "%s" i "%s": oczekiwany taki sam rozmiar.

source: %s: Wrong size for input arguments ''%s'': A vector of size %d expected.
fr_fr: %s: Mauvaise dimension pour les arguments d'entrée ''%s'': Un vecteur de taille %d attendu.
pl_pl: %s: Nieprawidłowy rozmiar argumentów wejściowych "%s": oczekiwany jest wektor o rozmiarze %d.

source: %s: Wrong type argument %s.
fr_fr: %s : Mauvais type d'argument %s.
pl_pl: %s: Niewłaściwy typ argumentu %s.
pt_br: %s: Argumento de tipo errado %s.

source: %s: Wrong type for argument #%d: Columns vectors expected.
fr_fr: %s : Mauvais type pour l'argument n°%d : Des vecteurs colonnes attendus.
pl_pl: %s: Nieprawidłowy typ argumentu #%d: oczekiwany jest wektor kolumnowy.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se vetores-colunas.

source: %s: Wrong type for input argument #%d.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d.
pl_pl: %s: Nieprawidłowy typ dla argumentu wejściowego #%d.

source: %s: Wrong type for input argument #%d: %s data structure expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : structure de données de type %s attendue.
pl_pl: %s: Nieprawidłowy typ parametru wejściowego #%d: %s Oczekiwana struktura danych.

source: %s: Wrong type for input argument #%d: 2D array of strings expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Une table 2D de chaîne de caractères attendue.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwana jest tablica 2D łańcuchów.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um array 2D de strings.

source: %s: Wrong type for input argument #%d: A '%s' handle or a real scalar expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un handle de type '%s' ou un scalaire réel attendu.
pl_pl: %s: Nieprawidłowy typ dla argumentu wejściowego #%d: oczekiwano A '%s' łączy lub wartość skalarną typu real.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um manipulador '%s' ou um escalar real.

source: %s: Wrong type for input argument #%d: A 'Text' handle expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un handle de type 'Text' attendu.
pl_pl: %s: Nieprawidłowy typ dla argumentu wejściowego #%d: oczekiwano A 'Text' łączy.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um manipulador ''Text''.

source: %s: Wrong type for input argument #%d: A Real expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un réel attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwana jest wartość real.
pt_br: %s: Tipo de argumento de entrada errado #%d: Esperava-se um real

source: %s: Wrong type for input argument #%d: A boolean expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : un booléen attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwana jest wartości typu boolean.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um booleano.

source: %s: Wrong type for input argument #%d: A real expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un réel est attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwana jest wartość typu real.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um número real.

source: %s: Wrong type for input argument #%d: A string expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Une chaîne de caractères est attendue.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwana jest wartości typu string.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um string.

source: %s: Wrong type for input argument #%d: A vector expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un vecteur est attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwany jest wektor.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um vetor.

source: %s: Wrong type for input argument #%d: A vector of ''Figure'' handle expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un vecteur de handle de type ''Figure'' attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwany wektor Figury funkcji handle.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um vetor de manipuladores ''Figure''.

source: %s: Wrong type for input argument #%d: An ''Axes'' handle expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Un handle de type ''Axes'' attendu.
pl_pl: %s: Nieprawidłowy typ parametru wejściowego #%d: Oczekiwano obsługi "Osi".

source: %s: Wrong type for input argument #%d: Boolean vector expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un vecteur de booléens attendu.
pl_pl: %s: Nieprawidłowy typ parametru wejściowego #%d: oczekiwano wektora typu boolean.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um vetor de booleanos.

source: %s: Wrong type for input argument #%d: Figure or Axes handle expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un handle de type "Figure" ou "Axes" attendu.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um manipulador ''Figure'' ou ''Axes''.

source: %s: Wrong type for input argument #%d: Graphic handle expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Un handle vers un graphique attendu.
pl_pl: %s: Nieprawidłowy typ parametru wejściowego #%d: Oczekiwano obsługę grafiki.

source: %s: Wrong type for input argument #%d: Handle or vector of double expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un handle ou un vecteur de double attendu.
pl_pl: %s: Nieprawidłowy typ dla argumentu wejściowego #%d: oczekiwano Handle lub wektora podwójnego.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um manipulador ou um vetor de doubles.

source: %s: Wrong type for input argument #%d: Matrix expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée #%d : une matrice est attendue.
pl_pl: %s: Niewłaściwy typ argumentu wejściowego #%d: oczekiwano macierzy.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se uma matriz.

source: %s: Wrong type for input argument #%d: Matrix of handle expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Une matrice de handle attendue.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwana macierz z systemu handle.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se uma matriz de manipuladores.

source: %s: Wrong type for input argument #%d: Non-negative int expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un entier non négatif attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwana jest nieujemna wartość int.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um inteiro não-negativo.

source: %s: Wrong type for input argument #%d: Real array or graphic handle array expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Un tableau de réels ou un handle vers un graphique attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: Oczekiwano tablicę typu real lub graficzną tablicę handle.

source: %s: Wrong type for input argument #%d: Real or Complex matrix expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n° #%d : Matrice réelle ou complexe attendue.

source: %s: Wrong type for input argument #%d: Real row vector expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un vecteur ligne de réel attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwany jest wektor wierszowy wartości real.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um vetor-linha de reais.

source: %s: Wrong type for input argument #%d: Real row vector or a boolean expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un vecteur ligne réel ou un booléen attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwany jest wektor wierszowy wartości real.lub boolean.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um vetor-linha de reais o um booleano.

source: %s: Wrong type for input argument #%d: Real scalar expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Scalaire réel attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwany jest skalar wartości real.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um escalar real.

source: %s: Wrong type for input argument #%d: Scalar expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un scalaire attendu.
pt_br: %s: Tipo errado de argumento de entrada #%d: Esperava-se um escalar.

source: %s: Wrong type for input argument #%d: Scalar or string expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un scalaire ou une chaîne de caractères attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwany jest skalar lub łańcuch.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um escalar ou string.

source: %s: Wrong type for input argument #%d: Single Figure or Axes handle expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un handle de type Figure ou Axes attendu.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um único manipulador ''Figure'' ou ''Axes''.

source: %s: Wrong type for input argument #%d: Single string expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Une chaîne de caractères attendue.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwany jest pojedynczy łańcuch znaków.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um único string.

source: %s: Wrong type for input argument #%d: String array expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Table de chaîne de caractères attendue.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwana jest tablica ciągów znaków.

source: %s: Wrong type for input argument #%d: String or handle expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Une chaîne de caractères ou un handle attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwano ciągu znaków lub handle.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um string ou um manipulador.

source: %s: Wrong type for input argument #%d: Vector %s or %s expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Vecteur de %s ou de %s attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwany jest wektor %s lub %s. .
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um vetor %s ou%s.

source: %s: Wrong type for input argument #%d: function expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Une fonction attendue.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwana jest funkcja.

source: %s: Wrong type for input argument %d: An ''Axes'' handle expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un handle de type ''Axes'' attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwana oś handle.
pt_br: %s: Tipo errado para o argumento de entrada %d: Esperava-se um manipulador ''Axes''.

source: %s: Wrong type for input argument ''%s'': A Real matrix expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée ''%s'': Une matrice réelle attendue.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego ''%s'': oczekiwana macierz typu real.

source: %s: Wrong type for input argument.
fr_fr: %s : Mauvais type pour l'argument d'entrée.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego.

source: %s: Wrong type for input argument: '%s' handle expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée: handle '%s' attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego: '%s' oczekiwano handle.
pt_br: %s: Tipo errado para o argumento de entrada: Esperava-se um manipulador '%s'.

source: %s: Wrong type for input argument: Scalar expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée : Scalaire attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego: oczekiwany skalar.
pt_br: %s: Tipo errado para argumento de entrada: Esperava-se um escalar.

source: %s: Wrong type for input argument: Vector of Axes and Figure handles expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée : Un vecteur de handles de type Axes et Figure attendu.
pl_pl: %s: Nieprawidłowy typ dla argumentu wejściowego: oczekiwany wektor z osi i figura z systemu handle.
pt_br: %s: Tipo errado para argumento de entrada: Esperava-se um vetor de manipuladores ''Axes'' e ''Figure''.

source: %s: Wrong type for input arguments: Handle or vector of double expected.
fr_fr: %s : Mauvais type pour les arguments d'entrée : Un handle ou un vecteur de doubles attendu.
pl_pl: %s: Nieprawidłowy typ dla argumentu wejściowego: oczekiwano handle lub wektor podwójny.
pt_br: %s: Tipo errado para argumentos de entradas: Esperava-se um manipulador ou um vetor de doubles.

source: %s: Wrong value for argument: '%s' or '%s' expected.
fr_fr: %s : Mauvaise valeur pour l'argument : '%s' ou '%s' attendu.
pl_pl: %s: Nieprawidłowa wartość argumentu: oczekiwano '%s' lub '%s'.
pt_br: %s: Tamanho errado para o argumento: Esperava-se '%s' ou '%s'.

source: %s: Wrong value for input argument #%d: '%s' expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : '%s' attendu.
pl_pl: %s: Nieprawidłowa wartość dla argumentu wejściowego #%d: oczekiwano '%s'
pt_br: %s: Valor errado para argumento de entrada #%d: Esperava-se '%s'.

source: %s: Wrong value for input argument #%d: '%s' or '%s' expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : '%s' ou '%s' attendu.
pl_pl: %s: Nieprawidłowa wartość parametru wejściowego #%d: oczekiwano '%s' lub '%s'.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se '%s' ou '%s'.

source: %s: Wrong value for input argument #%d: ''clear'' or ''reset'' expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : ''clear'' ou ''reset'' attendu.
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: oczekiwane jest "wyczyść" lub "reset"
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se ''clear'' ou ''reset''.

source: %s: Wrong value for input argument #%d: A %d digits integer with digits greater than %d expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° %d: Un entier de taille %d décimales (avec plus de %d décimales) attendu.
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: oczekiwano %d cyfr liczby całkowitej większych niż cyfry %d.

source: %s: Wrong value for input argument #%d: A valid fontname expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Un nom de police de caractères valide attendu.
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: oczekiwana ważna nazwa fontu.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se um nome de fonte válido.

source: %s: Wrong value for input argument #%d: An integer greater or equal than %d expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Un entier égal ou plus grand que %d attendu.
pl_pl: %s: Nieprawidłowa wartość dla argumentu wejściowego #%d: oczekiwano liczbę całkowitą większą lub równą %d.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se um inteiro superior ou igual a %d

source: %s: Wrong value for input argument #%d: Incorrect value.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Valeur incorrecte.
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: niepoprawna wartość.
pt_br: %s: Valor errado para o argumento de entrada #%d: Valor incorreto.

source: %s: Wrong value for input argument #%d: Must be in the interval [%s, %s].
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n° %d : Doit être dans l'intervalle [%s, %s].
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: musi być w przedziale [%s, %s].

source: %s: Wrong value for input argument #%d: Must be in the set {%s}.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Doit être dans l'ensemble {%s}.
pl_pl: %s: Nieprawidłowa wartość parametru wejściowego #%d: Musi być w ustawieniu {%s}.

source: %s: Wrong value for input argument #%d: Non-negative int expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Un entier non négatif attendu.
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: oczekiwana jest nieujemna wartość int.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se um inteiro não-negativo.

source: %s: Wrong value for input argument #%d: Specified bounds are not correct.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Les bornes spécifiées ne sont pas correctes.
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: określone granice są nieprawidłowe.
pt_br: %s: Valor errado para o argumento de entrada #%d: Os limites especificados não estão corretos.

source: %s: Wrong value for input arguments #%d and #%d: Incompatible length.
fr_fr: %s : Mauvaise valeur pour les arguments d'entrée n°%d et n° %d : Longueur incompatible.
pl_pl: %s: Nieprawidłowa wartość argumentów wejściowych #%d i #%d: niezgodna długość.
pt_br: %s: Valor errado para o argumento de entrada #%d e #%d: Comprimentos incompatíveis.

source: %s: Wrong value for input arguments #%d, #%d and #%d: Incompatible length.
fr_fr: %s : Mauvaise valeur pour les arguments d'entrée n°%d, n°%d et n°%d : Longueur incompatible.
pl_pl: %s: Nieprawidłowa wartość argumentów wejściowych #%d, #%d i #%d: Niezgodna długość.
pt_br: %s: Tipo errado para o argumento de entrada #%d, #%d e #%d: Comprimentos incompatíveis.

source: %s: Wrong value: Vector is not monotonous.
fr_fr: %s : Mauvaise valeur : Le vecteur n'est pas monotone.
pl_pl: %s: Nieprawidłowa wartość: Wektor nie jest monotoniczny.
pt_br: %s: Valor errado: O vetor não é monótono.

source: %s: Wrong values for input argument #%d: ''%s'' expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° %d: ''%s'' attendue.
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: oczekiwano "%s".

source: %s: handle no more valid ignored.
fr_fr: %s : handle plus valide ignoré.
pl_pl: %s: handle mniej ważne ignoruj.
pt_br: %s: O manipulador não é mais válido. Ignorado.

source: %s: please use %s instead.
fr_fr: %s : utilisez %s à la place SVP.
pl_pl: %s: proszę użyj zamiast %s.
pt_br: %s: Por favor, utilize %s ao invés.

source: %s: too many input arguments
fr_fr: %s : trop d'arguments d'entrée

source: %s: x vector is not monotonous.
fr_fr: %s : le vecteur x n'est pas monotone.
pl_pl: %s: wektor x nie jest monotoniczny.
pt_br: %s: o vetor x não é monótono

source: &Edit
fr_fr: &Edition
pl_pl: &Edycja
pt_br: &Editar

source: &File
fr_fr: &Fichier
pl_pl: &Plik
pt_br: &Arquivo

source: &Tools
fr_fr: &Outils
pl_pl: &Narzędzia
pt_br: &Ferramentas

source: '%s' handle does not or no longer exists.
fr_fr: Le handle '%s' n'existe pas ou n'existe plus.
pl_pl: '%s' handle nie ma lub już nie istnieje.
pt_br: O manipulador '%s' não existe ou não existe mais.

source: '%s' property does not exist for this handle.
fr_fr: La propriété '%s' n'existe pas pour ce handle.
pl_pl: '%s' własności nie istnieją dla tego handle.

source: A Label object cannot be deleted.
fr_fr: Un objet Label ne peut être supprimé.
