Repository: ScilabOrg/scilab
Catalog: scilab/modules/graphics/locales/*/graphics.po
Languages: fr_fr, pl_pl, pt_br

source: %: Wrong value for %s '%c': '%s', '%s' and '%s' expected.
fr_fr: % : Mauvaise valeur pour %s '%c' : '%s', '%s' et '%s' attendus.
pl_pl: %: Nieprawidłowa wartość %s '%c': '%s', oczekiwana jest '%s' i '%s' .
pt_br: %: Valor errado para %s '%c': Esperava-se '%s', '%s' e '%s'.

source: %s : '%s' must be set
fr_fr: %s : '%s' doit être déclaré
pl_pl: %s: '%s' musi być ustawiony
pt_br: %s : '%s' deve ser ajustado

source: %s : Invalid entity %s
fr_fr: %s : Entité %s invalide
pl_pl: %s: Nieprawidłowa jednostka %s
pt_br: %s: Entidade inválida %s

source: %s cannot be set in this case.
fr_fr: %s ne peut pas être activé dans ce cas.
pl_pl: %s nie może być ustawiona w tym przypadku.
pt_br: %s não pode ser ajustado nesse caso.

source: %s is only made to compute level curves and not display them.
fr_fr: %s a pour seul objectif de calculer les courbes de niveau, pas de les représenter.
pl_pl: %s zostało stworzone tylko do wyliczenia poziomu krzywych a nie ich wyświetlenia. .
pt_br: %s é feito apenas para se computar curvas de nível, não para exibi-las.

source: %s must be changed FIRST, %s is '%s' and %s dimension < %d.
fr_fr: %s doit être changé en PREMIER, %s est '%s' et la dimension de %s est < %d.
pl_pl: %s musi być zmieniony jako PIERWSZY, %s jest '%s' oraz wymiar %s < %d.
pt_br: %s deve ser modificado PRIMEIRO, %s é '%s' e a dimensão %s é < %d.

source: %s property only exists for %s surfaces.
fr_fr: La propriété %s existe seulement pour les surfaces %s.
pl_pl: %s istnieje tylko w przypadku powierzchni %s.
pt_br: A propriedade %s exite apenas para superfícies %s.

source: %s should be a string vector.
fr_fr: %s doit être un vecteur de chaîne de caractères.
pl_pl: %s powinno być wektorem ciągu znaków.
pt_br: %s deve ser um vetor de strings.

source: %s should be a vector of double.
fr_fr: %s doit être un vecteur de doubles.
pl_pl: %s powinno być wektorem podwójnym.
pt_br: %s deveria ser um vetor de doubles.

source: %s: '%s' handle does not or no longer exists.
fr_fr: %s : Le handle de type '%s' n'existe pas ou n'existe plus.
pl_pl: %s: Obsługa '%s' nie istnieje lub juz nie istnieje.
pt_br: %s: O manipulador '%s' não existe ou não existe mais.

source: %s: At least one x data must be strictly positive to compute the bounds and use logarithmic mode.
fr_fr: %s : Au moins une donnée x doit être strictement positive pour le calcul des bornes et l'utilisation du mode logarithmique.
pl_pl: %s: Przynajmniej jedna wartość x musi być wyłącznie dodatnia by obliczyć w granicach i użyć trybu logarytmicznego.
pt_br: %s: Pelo menos um dado x deve ser positivo para se computar os limites e utilizar a escala logarítmica.

source: %s: At least one y data must be strictly positive to compute the bounds and use logarithmic mode
fr_fr: %s : Au moins une donnée y doit être strictement positive pour le calcul des bornes et l'utilisation du mode logarithmique.
pl_pl: %s: Przynajmniej jedna wartość y musi być wyłącznie dodatnia by obliczyć w granicach i użyć trybu logarytmicznego.
pt_br: %s: Pelo menos um dado y deve ser positivo para se computar os limites e utilizar a escala logarítmica.

source: %s: Bounds on x axis must be strictly positive to use logarithmic mode.
fr_fr: %s : Les bornes de l'axe axis doivent être strictement positives pour utiliser le mode logarithmique.
pl_pl: %s: Granice ośi x muszą być tylko dodatnie by użyć trybu logarytmicznego.
pt_br: %s: Limites no eixo x devem ser estritamente positivos para o uso do modo logarítmico.

source: %s: Bounds on y axis must be strictly positive to use logarithmic mode.
fr_fr: %s : Les bornes de l'axe y doivent être strictement positives pour utiliser le mode logarithmique.
pl_pl: %s: Granice ośi y muszą być tylko dodatnie by użyć trybu logarytmicznego.
pt_br: %s: Limites no eixo y devem ser estritamente positivos para o uso do modo logarítmico.

source: %s: Can't enable a void event handler.
fr_fr: %s: Ne peut pas activer un gestionnaire d'évènements vide.
pl_pl: %s: Nie można włączyć obsługi zdarzeń nieważnych.
pt_br: %s: Não se consegue habilitar um manipulador de eventos vazio.

source: %s: Could not read property '%s' for root object.
fr_fr: %s : Ne peut pas lire la propriété '%s' pour l'objet racine.
pl_pl: %s: Nie można odczytać właściwości '%s' obiektu root.
pt_br: %s: Não foi possível ler a propriedade '%s' para o objeto raiz.

source: %s: Each handle should not appear twice.
fr_fr: %s : Chaque handle ne doit pas apparaître deux fois.
pl_pl: %s: Każda obsługa nie powinna występować dwa razy.
pt_br: %s: Nenhum manipulador deveria aparecer duas vezes.

source: %s: Error : unable to evaluate input function ''%s''.
fr_fr: %s : Erreur : impossible d'évaluer la fonction d'entrée ''%s''.
pl_pl: %s: Błąd : nie można ocenić funkcji wejściowej ''%s''.
pt_br: %s: Erro : não se consegue avaliar a função de entrada ''%s''.

source: %s: Error : unable to evaluate input function.
fr_fr: %s : Erreur : impossible d'évaluer la fonction d'entrée.
pl_pl: %s: Błąd : nie można ocenić funkcji wejściowej.
pt_br: %s: Erro : não se consegue avaliar a função de entrada.

source: %s: Error on input argument #%d: Specified bounds are not correct.
fr_fr: %s : Erreur sur l'argument d'entrée n°%d : Les bornes spécifiées ne sont pas correctes.
pl_pl: %s: Błąd parametru wejściowego #%d: Określone granice są błędne.
pt_br: %s: Erro no argumento de entrada #%d: Os limites especificados não estão corretos.

source: %s: Handle %d cannot be glued (invalid parent).
fr_fr: %s : Le handle %d ne peut pas être fusionné (parent invalide).
pl_pl: %s: Obsługa %d nie może być przyklejona (niewłaściwa macierzystość).
pt_br: %s: O manipulador %d não pode ser colado (pai inválido).

source: %s: Handle %d cannot be glued (invalid type).
fr_fr: %s : Le handle %d ne peut pas être fusionné (type invalide).
pl_pl: %s: Obsługa %d nie może być przyklejona (niewłaściwy typ).
pt_br: %s: O manipulador %d não pode ser colado (tipo inválido).

source: %s: Handle does not or no longer exists.
fr_fr: %s : Le handle n'existe pas ou n'existe plus.
pl_pl: %s: Obsługa nie istnieje lub już nie istnieje.
pt_br: %s: O manipulador não existe ou não existe mais.

source: %s: Handles must be relocated under a single parent.
fr_fr: %s : Les handles doivent être déplacés sous un seul parent.
pl_pl: %s: Obsługi muszą być przeniesione pod pojedynczą macierzystość.
pt_br: %s: Os manipuladores deve ser realocados sob um único pai.

source: %s: Impossible status min > max in x or y rect data.
fr_fr: %s : Statut impossible min > max dans les données rect x ou y.
pl_pl: %s: Niemożliwy status min > max przy danych x lub y.
pt_br: %s: Status impossível min > max no dado x ou y rect.

source: %s: Incompatible input arguments #%d and #%d: Same element number expected.
fr_fr: %s: Arguments d'entrée n° %d et n° %d incompatibles: Le même nombre d'éléments attendu.
pl_pl: %s:Niekompatybilne parametry wejściowe #%d i #%d: Oczekiwano jednakowej ilości elementów.

source: %s: Incompatible length for input arguments #%d and #%d.
fr_fr: %s : Longueur incompatible pour les arguments d'entrée n°%d et n° %d.
pl_pl: %s: Niekompatybilne długości parametrów wejściowego #%d i #%d.
pt_br: %s: Comprimento incompatível para os argumentos de entrada #%d e #%d.

source: %s: Input argument #%d must be a '%s' handle.
fr_fr: %s : L'argument d'entrée #%d doit être un identificateur de '%s.

source: %s: Input argument #%d must be a handle on a axes.
fr_fr: %s: L'argument d''entrée n° %d doit être un handle vers un axe.
pl_pl: %s: Parametr wejściowy #%d musi być obsługą osi a.

source: %s: Input argument #%d must be real.
fr_fr: %s : L'argument d'entrée n°%d doit être réel.
pl_pl: %s: Parametr wejściowy #%d musi być wartością rzeczywistą.

source: %s: Input argument and the legend must have the same parent axes.
fr_fr: %s : L'argument d'entrée et la légende doivent avoir le même axe parent.

source: %s: Interpolated shading only works for polygons of size %d or %d
fr_fr: %s: Le calcul d'ombrage par interpolation ne fonctionne que sur les polygones de taille %d ou %d
pl_pl: %s: Interpolowanie cieniowanie działa tylko przy wielobokach o wielkości %d lub %d
pt_br: %s: A gradação interpolada só funciona em polígonos de tamanho %d ou %d

source: %s: Legend does not fit with the current context. Skipped
fr_fr: %s: La légende ne correspond pas au contexte courant. On passe
pl_pl: %s: Legenda nie mieści się przy obecnym układzie. Pominięto
pt_br: %s: A legenda não se encaixa no contexto corrente. Pulada

source: %s: Misplaced optional argument: #%d must be at position %d.
fr_fr: %s : Argument optionnel mal placé : n°%d doit être à la position %d.
pl_pl: %s: Zgubiony opcjonalny parametr: #%d musi być w pozycji %d.
pt_br: %s: Argumento opcional deslocado: #%d deve estar na posição %d.

source: %s: No ''%s'' handle found.
fr_fr: %s: Aucun identificateur de ''%s'' trouvé.

source: %s: No more memory
fr_fr: %s : Plus de mémoire
pl_pl: %s: Brak pamięci
pt_br: %s: Memória esgotada

source: %s: No more memory.
fr_fr: %s : Plus de mémoire.
pl_pl: %s: Brak pamięci.
pt_br: %s: Memória esgotada

source: %s: No more memory.
fr_fr: %s : Plus de mémoire disponible.
pl_pl: %s: Brak pamięci.
pt_br: %s: Memória esgotada.

source: %s: Number of columns must be %d.
fr_fr: %s : Le nombre de colonnes doit être de %d.
pl_pl: %s: Liczba kolumn musi wynosić %d.
pt_br: %s: O número de colunas deve ser %d.

source: %s: Object must be a %s.
fr_fr: %s : L'objet doit être un %s.
pl_pl: %s: Obiekt musi być %s.
pt_br: %s: O objeto deve ser um %s.

source: %s: Object must be a Compound.
fr_fr: %s : L'objet doit être un Compound.
pl_pl: %s: Obiekt musi być Złożony.
pt_br: %s: O objeto deve ser um Compound.

source: %s: Objects must have the same axes.
fr_fr: %s : Les objets doivent avoir le même axe.
pl_pl: %s: Obiekty muszą mieć te same osie.
pt_br: %s: Os objetos devem ter os mesmos eixos.

source: %s: Objects must have the same parent.
fr_fr: %s : Les objets doivent avoir le même parent.
pl_pl: %s: Obiekty muszą mieć takie same macierzystości.
pt_br: %s: Os objetos devem ter o mesmo pai.

source: %s: Old graphic mode is no longer available. Please refer to the set help page.
fr_fr: %s : L'ancien mode graphique n'est plus disponible. Référez-vous aux pages d'aide.
pl_pl: %s: Stary tryb graficzny nie jest już dostępny. Proszę odwołać się do strony pomocy.
pt_br: %s: O modo gráfico antigo não está mais disponível. Por favor encaminhe-se à página de ajuda de ''set''.

source: %s: Routine can only swap two single handles.
fr_fr: %s : La fonction ne peut échanger que deux handles uniques.
pl_pl: %s: Rutyna może tylko wymienić dwie pojedyncze obsługi.
pt_br: %s: A rotina só consegue permutar dois manipuladores simples.

source: %s: The %d th handle is not a polyline handle.
fr_fr: %s : Le handle n°%d n'est pas un handle polyline.
pl_pl: %s: %d obsługa nie jest obsługą polilinii.
pt_br: %s: O %d-ésimo manipulador não é um manipulador "Polyline".

source: %s: The handle is no more valid.
fr_fr: %s : Le handle n'est plus valide.
pl_pl: %s: Obsługa nie jest już aktualna.
pt_br: %s: O manipulador não é mais válido.

source: %s: The handle is not or no more valid.
fr_fr: %s : Le handle n'est plus valide.
pl_pl: %s: Obsługa nie jest lub już nie jest właściwa.
pt_br: %s: O manipulador não é válido ou não é mais válido.

source: %s: The handle is not valid.
fr_fr: %s : La handle n'est pas valide.
pl_pl: %s: Obsługa jest niewłaściwa.
pt_br: %s: O manipulador não é válido.

source: %s: Unable to create requested figure: No more memory.
fr_fr: %s : Impossible de créer la figure demandée : Plus de mémoire.
pl_pl: %s: Nie można utworzyć zadanej figury: Brak pamięci.
pt_br: %s: Não se consegue criar a figura solicitada: Memória esgotada.

source: %s: Unrecognized input argument '%s'.
fr_fr: %s : Argument d'entrée non reconnu '%s'.
pl_pl: %s: Nierozpoznany parametr wejściowy '%s'.
pt_br: %s: Argumento de entrada desconhecido '%s'.

source: %s: Unrecognized input argument: '%s'.
fr_fr: %s : Argument d'entrée non reconnu : '%s'.
pl_pl: %s: Nierozpoznany parametr wejściowy '%s'.
pt_br: %s: Valor desconhecido para o argumento de entrada: '%s'.

source: %s: Wrong number of columns for input argument #%d: %d expected.
fr_fr: %s : Mauvais nombre de colonnes pour l'argument d'entrée n°%d : %d attendu.
pl_pl: %s: Zła liczba kolumn parametru wejściowego #%d: Oczekiwano %d.
pt_br: %s: Número errado de colunas para o argumento de entrada #%d: Esperava-se %d.

source: %s: Wrong number of input argument(s): %d expected.
fr_fr: %s : Mauvais nombre d'argument(s) en entrée : %d attendu.
pl_pl: %s: Zła liczba parametrów wejściowych: oczekiwano %d.

source: %s: Wrong number of input argument(s): %d or %d expected.
fr_fr: %s: Mauvais nombre d'argument(s) d'entrée: %d ou %d attendu.
pl_pl: %s: Zła liczba parametrów(-u) wejściowych(-ego): Oczekiwano %d lub %d.

source: %s: Wrong number of input argument(s): %d or %d expected.
fr_fr: %s : Mauvais nombre d'argument(s) d'entrée : %d ou %d attendu.
pl_pl: %s: Zła liczba parametrów(-u) wejściowych(-ego): Oczekiwano %d lub %d.
pt_br: %s: Número incorreto de argumentos de entrada: Esperava-se %d ou %d.

source: %s: Wrong number of input argument(s): %d to %d expected.
fr_fr: %s : Mauvais nombre d'argument(s) d'entrée : %d à %d attendus.
pl_pl: %s: Zła liczba parametrów(-u) wejściowych(-ego): Oczekiwano od %d do %d.
pt_br: %s: Número errado de argumentos de entrada: Esperava-se de %d a %d.

source: %s: Wrong number of input argument(s): %d to %d expected.
fr_fr: %s : Mauvais nombre d'argument(s) d'entrée : %d à %d attendu.

source: %s: Wrong number of input argument(s): At least %d expected.
fr_fr: %s : Mauvais nombre d'argument(s) en entrée : Au moins %d attendus.
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano przynajmniej %d.
pt_br: %s: Quantidade errada de argumentos de entrada: Esperava-se pelo menos %d.

source: %s: Wrong number of input argument: %d expected.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : %d attendus.
pl_pl: %s: Niewłaściwa liczba argumentów wejściowych: oczekiwano %d.
pt_br: %s: Número de argumentos de entrada incorreto: Esperava-se %d.

source: %s: Wrong number of input arguments: %d expected.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : %d attendu.
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano %d.
pt_br: %s: Quantidade errada de argumentos de entrada. Esperava-se %d.

source: %s: Wrong number of input arguments: %d or %d expected.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : %d ou %d attendus.
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano %d lub %d.
pt_br: %s: Quantidade errada de argumentos de entrada: Esperava-se %d ou %d.

source: %s: Wrong number of input arguments: %d or %d to %d expected.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : %d ou %d à %d attendus.
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano %d lub od %d do %d.
pt_br: %s: Número errado de argumentos de entrada: Esperava-se de %d ou de %d a %d.

source: %s: Wrong number of input arguments: %d to %d expected.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : %d à %d attendus.
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano od %d do %d.
pt_br: %s: Quantidade errada de argumentos de entrada: Esperava-se de %d a %d.

source: %s: Wrong number of input arguments: At least %d expected.
fr_fr: %s : Nombre d'arguments d'entrée incorrect : %d au moins sont attendus.
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano przynajmniej %d.
pt_br: %s: Número errado de argumentos de entrada: Esperava-se pelo menos %d.

source: %s: Wrong number of mandatory input arguments. At least %d expected.
fr_fr: %s : Mauvais nombre d'argument d'entrée obligatoires. Un minimum de %d est attendu.

source: %s: Wrong size for arguments #%d and #%d.
fr_fr: %s : Mauvaise dimension pour les arguments d'entrée n°%d et n° %d.
pl_pl: %s: Nieprawidłowy rozmiar argumentów #%d i #%d.
pt_br: %s: Tamanho errado para o argumento de entrada #%d e #%d.

source: %s: Wrong size for arguments #%d and #%d: Incompatible length.
fr_fr: %s : Mauvaise dimension pour les arguments n°%d et n°%d : Longueur incompatible.
pl_pl: %s: Nieprawidłowy rozmiar argumentów #%d i #%d: niezgodna długość.
pt_br: %s: Tamanho errado para os argumentos de entrada #%d e #%d: Comprimentos incompatíveis.

source: %s: Wrong size for arguments #%d and #%d: Should be >= %d.
fr_fr: %s : Mauvaise dimension pour les arguments n°%d et n°%d : Devrait être >= %d.
pl_pl: %s: Nieprawidłowy rozmiar argumentów #%d i #%d: powinno być >=%d.
pt_br: %s: Tamanho errado para o argumento de entrada #%d e #%d: Deveria ser >= %d.

source: %s: Wrong size for arguments #%d, #%d and #%d: Incompatible length.
fr_fr: %s : Mauvaise dimension pour les arguments n°%d, n°%d et n°%d : Longueur incompatible.
pl_pl: %s: Nieprawidłowy rozmiar argumentów #%d, #%d i #%d: niezgodna długość.
pt_br: %s: Tamanho errado para os argumentos de entrada #%d, #%d e #%d: Comprimentos incompatíveis.

source: %s: Wrong size for arguments #%d: Incompatible length.
fr_fr: %s : Mauvaise dimension pour les arguments n°%d : Longueur incompatible.
pl_pl: %s: Nieprawidłowy rozmiar argumentu #%d: niezgodna długość.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Tamanho incompatível

source: %s: Wrong size for input argument #%d: %d < %d expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : %d < %d attendu.
pl_pl: %s: Nieprawidłowy rozmiar argumentu #%d: oczekiwano %d < %d.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se %d < %d.

source: %s: Wrong size for input argument #%d: %d expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : %d attendu.
pl_pl: %s: Nieprawidłowy rozmiar parametru wejściowego #%d: oczekiwano %d.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se %d.

source: %s: Wrong size for input argument #%d: %d or %d elements expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: %d ou %d éléments attendus.
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego #%d: oczekiwano elementów %d lub %d.

source: %s: Wrong size for input argument #%d: %d or %d expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : %d ou %d attendu.
pl_pl: %s: Nieprawidłowy rozmiar argumentów #%d: oczekiwano %d lub %d:.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se %d ou %d.

source: %s: Wrong size for input argument #%d: %d, %d or %d expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: %d, %d ou %d attendu.
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego #%d: Oczekiwano %d, %d lub %d.

source: %s: Wrong size for input argument #%d: %s expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : %s attendu.
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego #%d: oczekiwano %s.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se %s.

source: %s: Wrong size for input argument #%d: A %d-by-%d or %d-by-%d matrix expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Une matrice de taille %d-par-%d ou %d-par-%d attendue.
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego #%d: Oczekiwano macierzy %d-przez-%d lub %d-przez-%d.

source: %s: Wrong size for input argument #%d: A '%s' handle or a real scalar expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Un handle '%s' ou un scalaire réel attendu.
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego #%d: '%s' oczekiwano handle lub wartości skalarnej.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um manipulador '%s' ou um escalar real.

source: %s: Wrong size for input argument #%d: A ''%s'' handle expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Un handle ''%s'' attendu.

source: %s: Wrong size for input argument #%d: A 'Text' handle expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Un handle de type 'Text' attendu.
pl_pl: %s: Nieprawidłowy rozmiar dla parametru wejściowego #%d: Oczekiwano obsługi 'Text'.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um manipulador ''Text''.

source: %s: Wrong size for input argument #%d: A Real expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Un réel attendu.
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: oczekiwano wartości typu real.
pt_br: %s: Tipo de argumento de entrada errado #%d: Esperava-se um real

source: %s: Wrong size for input argument #%d: A boolean expected .
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Un booléen est attendu
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: oczekiwano wartości typu boolean.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um booleano .

source: %s: Wrong size for input argument #%d: A matrix of size greater than %d-by-%d expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Une matrice de taille supérieure à %d-par-%d attendue.
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego #%d: oczekiwana macierz o rozmiarze większym niż %d-do-%d.

source: %s: Wrong size for input argument #%d: A real expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n° %d : Un réel attendu.
pl_pl: %s: Nieprawidłowy rozmiar dla argumentu wejściowego #%d: oczekiwano wartości typu real.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um número real.

source: %s: Wrong size for input argument #%d: A scalar expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Un scalaire attendu.
pl_pl: %s: Nieprawidłowy rozmiar dla argumentu wejściowego #%d: Oczekiwany skalar.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um escalar.

source: %s: Wrong size for input argument #%d: A single string expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n° #%d : Une simple chaîne de caractères est attendue.

source: %s: Wrong size for input argument #%d: A string expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Une chaîne de caractères attendue.
pl_pl: %s: Nieprawidłowy rozmiar dla argumentu wejściowego #%d: Oczekiwano wartości typu string.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um string.

source: %s: Wrong size for input argument #%d: A vector expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Un vecteur attendu.
pl_pl: %s: Niewłaściwy rozmiar argumentu wejściowego #%d: Oczekiwany wektor.

source: %s: Wrong size for input argument #%d: An integer expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Un entier attendu.
pl_pl: %s: Nieprawidłowy rozmiar dla argumentu wejściowego #%d: Oczekiwana liczba integer.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um número inteiro.

source: %s: Wrong size for input argument #%d: List of size %d expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Une liste de taille %d attendue.
pl_pl: %s: Nieprawidłowy rozmiar dla argumentu wejściowego #%d: Oczekiwano listy z rozmiaru %d.
pt_br: %s: Tamanhoerrado para o argumento de entrada #%d: Esperava-se uma lista de tamanho %d.

source: %s: Wrong size for input argument #%d: Real scalar expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Un scalaire réel attendu.
pl_pl: %s: Nieprawidłowy rozmiar dla argumentu wejściowego #%d: Oczekiwano wartość skalarną rzeczywistą.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um escalar real.
