Repository: ScilabOrg/scilab
Catalog: scilab/modules/metanet/locales/*/metanet.po
Languages: de_de

source: &File
de_de: &Datei

source: &Tools
de_de: &Zusatzprogramme

source: &Edit
de_de: &Editieren

source: %s: First argument must be a vector of size greater or equal to 2.
de_de: %s: erstes Argument muß ein Vektor mindestens der Größe 2 sein.

source: %s: Second argument must be a vector with same dimension as the first one.
de_de: %s: zweites Argument muß ein Vektor mit der gleichen Dimension wie der Erste sein.

source: %s: Third argument must be a vector of size greater or equal to 1.
de_de: %s: drittes Argument muß ein Vektor mindestens der Größe 1 sein.

source: %s: First argument must be a vector with positive integer values.
de_de: %s: erstes Argument muß ein Vektor mit positiven Integerwerten sein.

source: %s: Second argument must be a vector with positive integer values.
de_de: %s: zweites Argument muß ein Vektor mit positiven Integerwerten sein.

source: %s: Third argument must be a vector with positive integer values.
de_de: %s: drittes Argument muß ein Vektor mit positiven Integerwerten sein.

source: Running out of memory
de_de: Speicher wird voll

source: "%s" is a directory
de_de: '%s' ist ein Verzeichnis

source: Directory "%s" does not exist
de_de: Verzeichnis '%s' existiert nicht

source: Graph file "%s/%s.graph" does not exist
de_de: Graphendatei '%s/%s.graph' existiert nicht

source: Unable to open file "%s/%s.graph"
de_de: kann Datei '%s/%s.graph' nicht öffnen

source: Bad graph file. Node "%s" is duplicated
de_de: Fehlerhafte Graphendatei. Knoten '%s' ist dupliziert.

source: Bad graph file. Node "%s" referenced by arc "%s" not found
de_de: Fehlerhafte Graphendatei. Knoten '%s' referenziert durch arc '%s' nicht gefunden.

source: Scilab module metanet not installed.
de_de: Scilab Modul Metanet nicht installiert.

source: Bad internal node number %d
de_de: Fehlerhafte interne Knotennummer %d

source: Bad internal arc number %d
de_de: Fehlerhafte arc Nummer %d

source: Unable to write file in directory %s, check access
de_de: Kann in das Verzeichnis %s nicht schreiben, überprüfe die Adresse
