Repository: ScilabOrg/scilab
Catalog: scilab/modules/modules_manager/locales_macros/*.po
Languages: fr_fr

source: %s: Can''t go to directory ''%s''.
fr_fr: %s : Répertoire ''%s'' non trouvé.

source: %s: The directory ''%s'' doesn''t exist or is not read accessible.
fr_fr: %s : Le répertoire ''%s'' n''existe pas ou n''est pas accessible en lecture.

source: %s: The file %s cannot been created, please check if you have write access on this file.
fr_fr: %s : Le fichier %s n''a pu être créé, veuillez vérifier vos droits en écriture sur celui-ci.

source: %s: The file ''%s'' doesn''t exist or is not read accessible.
fr_fr: %s : Le fichier ''%s'' n''existe pas ou n''est pas accessible en lecture.

source: %s: This module required a C compiler and it has not been found.
fr_fr: %s : Ce module requiert un compilateur C mais celui-ci n''a pu être trouvé.

source: %s: This module requires a C or Fortran compiler and it has not been found.
fr_fr: %s : Ce module requiert un compilateur C ou Fortran mais celui-ci n''a pu être trouvé.

source: %s: Wrong number of input arguments: %d expected.
fr_fr: %s : Nombre incorrect d''arguments en entrée : %d attendus.

source: %s: Wrong number of input arguments: %d to %d expected.
fr_fr: %s : Nombre incorrect d''arguments d''entrée : entre %d et %d attendus.

source: %s: Wrong size for input argument #%d: A boolean expected.
fr_fr: %s : Taille incorrecte de l''argument d''entrée #%d : booléen attendu.

source: %s: Wrong size for input argument #%d: A string expected.
fr_fr: %s: Taille incorrecte de l''argument d''entrée #%d : Chaîne de caractères attendue.

source: %s: Wrong size for input argument #%d: At most %d rows expected.
fr_fr: %s : Taille incorrecte de l''argument d''entrée #%d : Au plus %d lignes attendues.

source: %s: Wrong type for input argument #%d: A boolean expected.
fr_fr: %s : Type incorrect de l''argument d''entrée #%d : Booléen attendu.

source: %s: Wrong type for input argument #%d: A matrix of strings expected.
fr_fr: %s : Type incorrect de l''argument d''entrée #%d : Matrice de chaînes de caractères attendue.

source: %s: Wrong type for input argument #%d: A string array expected.
fr_fr: %s : Type incorrect de l''arguement d''entrée #%d : Tableau de chaîne de caractères attendu.

source: %s: Wrong type for input argument #%d: A string expected.
fr_fr: %s : Type incorrect de l''argument d''entrée #%d : Une chaîne de caractères est attendue.

source: %s: Wrong value for input argument #%d: Can''t go to ''%s''.
fr_fr: %s : Valeur incorrecte de l''argument d''entrée #%d : Impossible d''aller à ''%s''.

source: %s: Wrong value for input argument #%d: The directory ''%s'' doesn''t exist or is not read accessible.
fr_fr: %s: Valeur incorrecte de l''argument d''entrée #%d : Le répertoire ''%s'' n''existe pas ou n''est pas accessible en lecture.

source: %s: documentation cannot be built in this scilab mode: %s.
fr_fr: %s : la documentation ne peut être créée dans ce mode de Scilab : %s.

source: Building gateway...
fr_fr: Création de la passerelle...

source: Building help...
fr_fr: Création des fichiers d''aide...

source: Building macros...
fr_fr: Création des macros...

source: Building sources...
fr_fr: Création des sources...

source: Generating cleaner.sce...
fr_fr: Génération de cleaner.sce...

source: Generating cleaner_gateway.sce...
fr_fr: Génération de cleaner_gateway.sce...

source: Generating loader.sce...
fr_fr: Génération de loader.sce...

source: Generating loader_gateway.sce...
fr_fr: Génération de loader_gateway.sce...
