Repository: ScilabOrg/scilab
Catalog: scilab/modules/arnoldi/locales/*.po
Languages: fr_fr

source: %s: Wrong type for argument #%d: A real expected.
fr_fr: %s : Type erroné de l'argument n°%d : Un réel attendu.

source: %s: the computation is already terminated
fr_fr: %s : Le calcul est déjà terminé

source: %s: Wrong size for input argument %s: An array of size %d expected.
fr_fr: %s :Dimension erronée de l'argument d'entrée %s : Un tableau de taille %d attendu.

source: %s: Wrong size for input argument %s: A matrix of size %dx%d expected.
fr_fr: %s : Dimension erronée de l'argument d'entrée %s : Une matrice de taille %dx%d attendue.

source: %s: Wrong type for argument #%d: A string expected.
fr_fr: %s : Type erroné de l'argument n°%d : Une chaîne de caractères attendue.

source: %s: Can not read input argument #%d.
fr_fr: %s : Impossible de lire l'argument d'entrée n°%d.

source: %s: Wrong type for input argument #%d: A square matrix expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Une matrice carrée attendue.

source: %s: Wrong type for input argument #%d: An empty matrix or full or sparse square matrix expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Une matrice vide ou une matrice carrée, dense ou creuse attendue.

source: %s: Wrong dimension for input argument #%d: B must have the same size as A.
fr_fr: %s : Dimension erronée de l'argument d'entrée n°%d : B doit avoir la même taille que A.

source: %s: Wrong type for input argument #%d: A scalar expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Un scalaire attendu.

source: %s: Wrong type for input argument #%d: k must be a positive integer.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : k doit être un entier positif.

source: %s: Wrong value for input argument #%d: k must be in the range 1 to N.
fr_fr: %s : Valeur erronée de l'argument d'entrée n%d : k doit être compris entre 1 et N.

source: %s: Wrong value for input argument #%d: Unrecognized sigma value. Sigma must be one of '%s', '%s', '%s', '%s' or '%s'.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Valeur sigma non reconnue. Sigma doit être '%s', '%s', '%s', '%s' ou '%s'.

source: %s: Wrong value for input argument #%d: Unrecognized sigma value. Sigma must be one of '%s', '%s', '%s', '%s', '%s' or '%s'.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Valeur sigma non reconnue. Sigma doit être '%s', '%s', '%s', '%s', '%s' ou '%s'.

source: %s: Invalid sigma value for complex or non symmetric problem.
fr_fr: %s : Valeur de sigma invalide pour des problèmes complexes ou non symétriques.

source: %s: Invalid sigma value for real symmetric problem.
fr_fr: %s : Valeur de sigma invalide pour des problèmes réels symétriques.

source: %s: Wrong type for input argument #%d: sigma must be a real.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : sigma doit être un réel.

source: %s: Wrong type for input argument #%d: %s must be a scalar.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : %s doit être un scalaire.

source: %s: Wrong type for input argument #%d: %s must be an integer positive value.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : %s doit être une valeur entière positive.

source: %s: Wrong type for input argument #%d: %s must be a real scalar.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : %s doit être un scalaire réel.

source: %s: Wrong type for input argument #%d: %s must be an integer scalar.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : %s doit être un scalaire entier.

source: %s: Wrong type for input argument #%d: %s must be an integer scalar or a boolean.
fr_fr: %s : Type erroné de l'argument d'entrée n%d : %s doit être un scalaire entier ou un booléen.

source: %s: Wrong value for input argument #%d: %s must be %s or %s.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : %s doit être %s ou %s.

source: %s: B is not positive definite. Try with sigma='SM' or sigma=scalar.
fr_fr: %s : N n'est pas définie positive. Essayez avec sigma='SM' ou sigma scalaire.

source: %s: If opts.cholB is true, B should be upper triangular.
fr_fr: %s : Si opts.cholB est vrai, B devrait être triangulaire supérieure.

source: %s: Wrong type for input argument #%d: A real or complex matrix expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Une matrice réelle ou complexe attendue.

source: %s: Wrong dimension for input argument #%d: Start vector %s must be N by 1.
fr_fr: %s : Dimension erronée de l'argument d'entrée n°%d : Le vecteur de début %s doit être N par 1.

source: %s: Wrong type for input argument #%d: Start vector %s must be real for real problems.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Le vecteur de début %s doit être réel pour des problèmes réels.

source: %s: Wrong type for input argument #%d: An integer expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Un entier attendu.

source: %s: Wrong value for input argument #%d: For real symmetric problems, NCV must be k < NCV <= N.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Pour des problèmes réels symétriques, NCV doit être k < NCV <= N.

source: %s: Wrong value for input argument #%d: For real non symmetric problems, NCV must be k + 2 < NCV <= N.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Pour des problèmes réels non symétriques, NCV doit être k + 2 < NCV <= N.

source: %s: Wrong value for input argument #%d: For complex problems, NCV must be k + 1 < NCV <= N.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Pour des problèmes complexes, NCV doit être k + 1 < NCV <= N.

source: %s: Wrong value for input argument #%d: For real symmetric problems, k must be an integer in the range 1 to N - 1.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Pour des problèmes réels symétriques, K doit être un entier compris entre 1 et N -1.

source: %s: Wrong value for input argument #%d: For real non symmetric or complex problems, k must be an integer in the range 1 to N - 2.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Pour des problèmes réels non symétriques ou complexes, k doit être un entier compris entre 1 et N - 2.

source: %s: Error with input argument #%d: B is not positive definite. Try with sigma='SM' or sigma=scalar.
fr_fr: %s : Erreur avec l'argument d'entrée n°%d : B n'est pas définie positive. Essayez avec sigma='SM' ou sigma scalaire.

source: %s: Error with %s: info = %d
fr_fr: %s : Erreur avec %s : info = %d

source: %s: Error with %s: unknown mode returned.
fr_fr: %s : Erreur avec %s : mode inconnu retourné.

source: %s: Memory allocation error.
fr_fr: %s : Erreur d'allocation mémoire.

source: %s : Wrong number of input arguments : %d to %d expected.
fr_fr: %s : Nombre erroné d'arguments d'entrée : %d à %d attendus.

source: %s: Wrong type for input argument #%d: A full or sparse square matrix or a function expected
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Une matrice carrée, dense ou creuse ou une fonction attendue.

source: %s: Wrong type for input argument #%d: A positive integer expected if the first input argument is a function.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Un entier positif attendu si le premier argument d'entrée est une fonction.

source: %s: Wrong type for input argument #%d: A structure expected
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Une structure attendue.

source: %s: Wrong type for input argument: If A is a matrix, use opts with tol, maxiter, ncv, resid, cholB
fr_fr: %s : Type erroné de l'argument d'entrée : Si A est une matrice, utilisez opts avec tol, maxiter, ncv, resid, cholB.

source: %s: Wrong type for input argument #%d: A string expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Une chaîne de caractères attendue.

source: %s: Wrong value for input argument #%d: Unrecognized sigma value. Sigma must be one of '%s', '%s', '%s', '%s', '%s' or '%s'.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Valeur sigma non reconnue. Sigma doit être '%s', '%s', '%s', '%s', '%s' ou '%s'.

source: %s: Wrong type for input argument #%d: a real scalar or a string expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Un scalaire réel ou une chaîne de caractères attendu.

source: %s: Wrong dimension for input argument #%d: %s must be 1 by 1 size.
fr_fr: %s : Dimension erronée de l'argument d'entrée n°%d : %s doit être de taille 1 par 1.

source: %s: Wrong value for input argument #%d: For real non symmetric problems, NCV must be k + 2 < NCV < N.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Pour des problèmes réels non symétriques, NCV doit être k + 2 < NCV < N.

source: %s: Wrong type for input argument #%d: Start vector %s must be complex for complex problems.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Le vecteur de début %s doit être complexe pour des problèmes complexes.

source: %s: Wrong type for input argument #%d: if opts.cholB is true, B must be upper triangular.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : si opts.cholB est vrai, B doit être triangulaire supérieur.

source: %s: Impossible to use the Cholesky factorization with complex sparse matrices.
fr_fr: %s : Impossible d'utiliser la factorisation de Cholesky avec des matrices creuses complexes.

source: %s: Error with %s: info = %d.
fr_fr: %s : Erreur avec %s: info = %d.

source: %s: Wrong type for input argument #%d: n must be a positive integer.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : n doit être un entier positif.

source: %s: Wrong value for input argument #%d: For real symmetric problems, k must be in the range 1 to N - 1.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Pour des problèmes réels symétriques, k doit être compris entre 1 et N - 1.

source: %s: Wrong value for input argument #%d: For real non symmetric or complex problems, k must be in the range 1 to N - 2.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Pour des problèmes réels non symétriques ou complexes, k doit être compris entre 1 et N - 2.

source: %s: Wrong type for input argument #%d: a scalar expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Un scalaire attendu.

source: %s: Wrong type for input argument #%d: a string expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Une chaîne de caractères attendue.

source: %s: Wrong value for input argument #%d: Unrecognized sigma value. Sigma must be one of %s, %s, %s, %s or %s.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Valeur sigma non reconnue. Sigma doit être %s, %s, %s, %s ou %s.

source: %s: Wrong value for input argument #%d: Unrecognized sigma value. Sigma must be one of %s, %s, %s, %s, %s or %s.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Valeur sigma non reconnue. Sigma doit être %s, %s, %s, %s, %s ou %s.

source: %s: Wrong dimension for input argument #%d: %s must be an integer scalar.
fr_fr: %s : Dimension erronée de l'argument d'entrée n°%d : %s doit être un scalaire entier.

source: %s: Wrong dimension for input argument #%d: Start vector opts.resid must be N by 1.
fr_fr: %s : Dimension erronée de l'argument d'entrée n°%d : Le vecteur de début opts.resid doit être N par 1.

source: %s: Wrong type for input argument #%d: Start vector opts.resid must be real for real problems.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Le vecteur de début opts.resid doit être réel pour des problèmes réels.

source: %s: Wrong type for input argument #%d: Start vector opts.resid must be complex for complex problems.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Le vecteur de début opts.resid doit être complexe pour des problèmes complexes.

source: %s: Wrong value for input argument #%d: n does not match rows number of matrix A.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : n ne correspond pas au nombre de lignes de la matrice A.

source: %s: Wrong type or value for input arguments.
fr_fr: %s : Type ou valeur erroné des arguments d'entrée.
