Repository: ScilabOrg/scilab
Catalog: scilab/modules/atoms/locales/*/atoms.po
Languages: fr_fr

source: - ''%s - %s'' is already loaded
fr_fr: - ''%s - %s'' est déjà chargée

source: - ''%s - %s'' is needed by ''%s - %s''
fr_fr: - ''%s - %s'' est requis par ''%s - %s''

source: - ''%s - %s'' is needed by ''%s''
fr_fr: - ''%s - %s'' est requis par ''%s''

source: - Local location : ''%s''
fr_fr: - Emplacement locale : ''%s''

source: - MD5SUM expected : ''%s''
fr_fr: - MD5SUM attendue : ''%s''

source: - MD5SUM watched : ''%s''
fr_fr: - MD5SUM consultée : ''%s''

source: - You''ve asked ''%s - %s''
fr_fr: - Vous avez demandé ''%s - %s''

source: - file : ''%s''
fr_fr: - fichier : ''%s''

source: %s: %s (%s) isn''t installed.
fr_fr: %s: %s (%s) n''est pas installé.

source: %s: ''%s - %s'' (''%s'' section) is not installed.
fr_fr: %s: ''%s - %s'' (section ''%s'') n''est pas installé.

source: %s: ''%s - %s'' is not installed.
fr_fr: %s: ''%s - %s'' n''est pas installé.

source: %s: ''%s'' (''%s'' section) is not installed.
fr_fr: %s: ''%s'' (section ''%s'') n'est pas installé.

source: %s: ''%s'' isn''t installed.
fr_fr: %s: ''%s'' n''est pas installé.

source: %s: An error occurred while loading ''%s-%s'':
fr_fr: %s : Une erreur est survenue au cours du chargement de "%s-%s":

source: %s: Another version of the package %s is already loaded : %s
fr_fr: %s: Une autre version du package %s est déjà chargée : %s

source: %s: DESCRIPTION file cannot be found in the package ''%s''
fr_fr: %s: Le fichier DESCRIPTION ne peux pas être trouvé dans le package ''%s''

source: %s: Error while copying the file ''%s'' to the directory ''%s''.
fr_fr: %s: Erreur pendant la copie du fichier ''%s'' vers le répertoire ''%s''.

source: %s: Error while creating the directory ''%s''.
fr_fr: %s: Erreur pendant la création du répertoire ''%s''.

source: %s: Extraction of the DESCRIPTION file (''%s'') has failed.
fr_fr: %s: L''extraction du fichier DESCRIPTION (''%s'') a échoué.

source: %s: Incompatible input arguments #%d and #%d: Same sizes expected.
fr_fr: %s : Arguments d'entrée n°%d et n°%d incompatibles : Même dimension attendue.

source: %s: Module ''%s - %s'' is not installed.
fr_fr: %s: Le module ''%s - %s'' n''est pas installé.

source: %s: Module ''%s'' is not installed (''%s'' section).
fr_fr: %s: Le module ''%s'' n'est pas installé (section ''%s'').

source: %s: Module ''%s'' is not installed.
fr_fr: %s: Le module ''%s'' n''est pas installé.

source: %s: Neither Wget or Curl found: Please install one of them
fr_fr: %s: Ni Wget ni Curl n'ont été trouvé: Veuillez installer un de ces outils

source: %s: Several versions of a package (%s) cannot be loaded at the same scilab session :
fr_fr: %s: Plusieurs version d'un package (%s) ne peuvent pas être chargées dans la même session Scilab :

source: %s: The config file (''%s'') is not well formated at line %d
fr_fr: %s: Le fichier de configuration (''%s'') n'est pas correctement formaté à la ligne %d

source: %s: The dependency tree cannot be resolved.
fr_fr: %s: L''arbre des dépendances ne peux pas être résolu.

source: %s: The description is not well formated at line %d
fr_fr: %s: La description n''est pas bien formatée à la ligne %d

source: %s: The directory %s cannot been created, please check if you have write access on this directory.
fr_fr: %s: Le répertoire %s ne peux pas être créé, vérifiez si vous avez les droits en écriture sur ce répertoire.

source: %s: The directory %s doesn''t exist.
fr_fr: %s: Le répertoire %s n''existe pas.

source: %s: The directory ''%s'' cannot been created, please check if you have write access on this directory.
fr_fr: %s: Le répertoire ''%s'' n'a pu être créé, veuillez vérifier que vous disposez des droits en écriture sur ce répertoire.

source: %s: The directory of this package (%s-%s) cannot been deleted, please check if you have write access on this directory : %s.
fr_fr: %s: Le répertoire de ce package (%s-%s) ne peut pas être supprimé, vérifiez que vous avez les droits d''écriture dans ce répertoire: %s.

source: %s: The directory of this package (%s-%s) is located neither in SCI nor in SCIHOME. For security reason, ATOMS refuses to delete this directory.
fr_fr: %s: Le répertoire de ce package (%s-%s) n''est situé ni dans SCI ni dans SCIHOME. Pour des question de sécurité, ATOMS refuse de supprimer ce répertoire.

source: %s: The downloaded file doesn''t check the MD5SUM:
fr_fr: %s: Le fichier téléchargé ne vérifie pas la signature MD5SUM:

source: %s: The extraction of the archive ''%s'' has failed.
fr_fr: %s: L''extraction de l''archive ''%s'' a échoué.

source: %s: The file %s doesn''t exist or is not read accessible.
fr_fr: %s: Le fichier %s n''existe pas ou n''est pas accessible en lecture.

source: %s: The file %s is not well formated at line %d
fr_fr: %s: Le fichier %s n''est pas bien formaté à la ligne %d

source: %s: The file ''%s'' cannot be written.
fr_fr: %s: Le fichier ''%s'' ne peux pas être écrit.

source: %s: The file ''%s'' doesn''t exist or is not read accessible
fr_fr: %s: Le fichier ''%s'' n''existe pas ou n''est pas accessible en lecture

source: %s: The file ''%s'' doesn''t exist or is not read accessible.
fr_fr: %s: Le fichier ''%s'' n''existe pas ou n''est pas accessible en lecture.

source: %s: The following file hasn''t been copied:
fr_fr: %s: Le fichier suivant n''a pas été copié:

source: %s: The following file hasn''t been downloaded:
fr_fr: %s: Le fichier suivant n''a pas été téléchargé:

source: %s: The following module is installed in the user section, you cannot add it to the autoload list for all users:
fr_fr: %s: Le module suivant est installé dans la section utilisateur, vous ne pouvez pas l''ajouter dans la liste autoload pour tous les utilisateurs:

source: %s: The following module is not installed:
fr_fr: %s: Le module suivant n''est pas installé:

source: %s: The following modules are not installed:
fr_fr: %s: Le modules suivants ne sont pas installés:

source: %s: The package %s is not available.
fr_fr: %s: Le package %s n''est pas disponible.

source: %s: The package ''%s'' is not present in the struct.
fr_fr: %s: Le package ''%s'' n''est pas présent dans la structure.

source: %s: The root directory of this package (%s-%s) cannot been deleted, please check if you have write access on this directory : %s.
fr_fr: %s: Le répertoire racine de ce package (%s-%s) ne peut pas être supprimé, vérifiez que vous avec les droits d''écriture dans ce répertoire: %s.

source: %s: The version ''%s'' of the package ''%s'' is not present in the struct.
fr_fr: %s: La version ''%s'' du package ''%s'' n''est pas présent dans la structure.

source: %s: Wrong length for input argument #%d: String which has 32-characters length expected.
fr_fr: %s: Mauvaise taille pour l'argument d'entrée n° %d: Une chaine de 32 caracteres est attendue.

source: %s: Wrong number of input argument: %d expected.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : %d attendus.

source: %s: Wrong number of input argument: %d to %d expected.
fr_fr: %s : Mauvais nombre d'argument en entrée: %d à %d attendu.

source: %s: Wrong number of input argument: at most %d expected.
fr_fr: %s: Mauvais nombre d''argument d''entrée: au plus %d attendu.

source: %s: Wrong number of input arguments: %d expected.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : %d attendu.

source: %s: Wrong number of input arguments: %d to %d expected.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : %d à %d attendus.

source: %s: Wrong number of input arguments: at most %d expected.
fr_fr: %s: Mauvais nombre d'arguments d'entrée: au plus %d attendus.

source: %s: Wrong size for input argument #%d: 1x1 or 1x2 string matrix expected.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée n° %d: une matrice de chaînes de caractères de taille 1x1 ou 1x2 attendue.

source: %s: Wrong size for input argument #%d: 1x2 string matrix expected.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée n° %d: Une matrice de chaînes de caractères de taille 1x2 attendue.

source: %s: Wrong size for input argument #%d: Single string expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n° %d : Une simple chaîne de caractères attendue.

source: %s: Wrong size for input argument #%d: mx1 or mx2 string matrix expected.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée n° %d: une matrice de chaînes de caractères de taille mx1 ou mx2 attendue.

source: %s: Wrong size for input argument #%d: mx1, mx2 or mx3 string matrix expected.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée n° %d: une matrice de chaînes de caractères de taille mx1, mx2 ou mx3 attendue.

source: %s: Wrong size for input argument #%d: mx1,mx2 or mx3 string matrix expected.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée n° %d: une matrice de chaînes de caractères de taille mx1,mx2 ou mx3 attendue.

source: %s: Wrong size for input argument #%d: mx2 or mx3 string matrix expected.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée n° %d: une matrice de chaînes de caractères de taille attendue.

source: %s: Wrong size for input argument #%d: mx2 string matrix expected.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée n° %d: Une matrice de chaînes de caractères de taille mx2 attendue.

source: %s: Wrong size for input argument #%d: mx3 string matrix expected.
fr_fr: %s: Mauvaise dimension pour l''argument d''entrée n° %d: une matrice de chaînes de caractères de taille mx3 attendue.

source: %s: Wrong type for input argument #%d: Boolean expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Booléen attendu.

source: %s: Wrong type for input argument #%d: Boolean or single string expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Booléen ou simple chaîne de caractères attendus.

source: %s: Wrong type for input argument #%d: Single string expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Une chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: String array expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Table de chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: String expected.
fr_fr: %s : Mauvais type pour l'argument n° %d : Chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: Struct expected.
fr_fr: %s: Mauvais type pour l''argument d''entrée n° %d: Struct attendu.

source: %s: Wrong type for input argument #%d: matrix oriented typed list expected.
fr_fr: %s: Mauvais type pour l''argument d''entrée n° %d: mlist attendu.

source: %s: Wrong type for input argument #%d: mlist expected.
fr_fr: %s: Mauvais type pour l''argument d''entrée n° %d: mlist attendue.

source: %s: Wrong value for input argument #%d: ''%s'' is not a valid URL.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: ''%s'' n''est pas une URL valide.

source: %s: Wrong value for input argument #%d: ''all'',''allusers'',''user'' or ''session'' expected.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: ''all'',''allusers'',''user'' ou ''session'' attendu.

source: %s: Wrong value for input argument #%d: ''all'',''user'',''allusers'' or ''official'' expected.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: ''all'',''user'',''allusers'' ou ''official'' attendue.

source: %s: Wrong value for input argument #%d: ''system'' or ''install'' expected.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: ''system'' ou ''install'' attendu.

source: %s: Wrong value for input argument #%d: ''user'' or ''allusers'' expected.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: ''user'' ou ''allusers'' attendu.

source: %s: Wrong value for input argument #%d: ''user'' or ''allusers'' or ''all'' expected.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: ''user'' ou ''allusers'' ou ''all'' attendu.

source: %s: Wrong value for input argument #%d: ''user'', ''allusers'' or ''all'' expected.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: ''user'', ''allusers'' ou ''all'' attendue.

source: %s: Wrong value for input argument #%d: ''user'',''allusers'' or ''all'' expected.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: ''user'',''allusers'' ou ''all'' attendu.

source: %s: Wrong value for input argument #%d: ASC or DESC expected.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: ASC ou DESC attendu.

source: %s: Wrong value for input argument #%d: All modules version should be set.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n°%d : Toutes les versions des modules devrait etre present.

source: %s: Wrong value for input argument #%d: Letters ''A'' or ''I'' expected.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: Les lettres ''A'' ou ''I'' attendues.

source: %s: Wrong value for input argument #%d: Must be a atoms package name.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: Doit être un nom de package Atoms.

source: %s: Wrong value for input argument #%d: Single string that ends with .tar.gz, .tgz or .zip expected.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: Une simple chaîne de caractères terminant par .tar.gz, .tgz ou .zip attendue.

source: %s: Wrong value for input argument #%d: String that contains ''TOOLBOXES'' or ''DESCRIPTION'' expected.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: Une chaîne de caractères contenant ''TOOLBOXES'' ou ''DESCRIPTION'' attendue.

source: %s: Wrong value for input argument #%d: String that ends with DESCRIPTION expected.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: Une chaîne de caractères terminant par DESCRIPTION attendue.

source: %s: Wrong value for input argument #%d: String that start with ''http://'',''ftp://'' or ''file://'' expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° %d: Chaîne commençant par "http://", "ftp://" ou "file://" attendue.

source: %s: Wrong value for input argument #%d: The matrix oriented typed list is not well formatted.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: La mlist n''est pas bien formatée.

source: %s: Wrong value for input argument #%d: This (
fr_fr: %s: Mauvaise valeur pour l''argument d''entré n° %d: Ceci (

source: %s: Wrong value for input argument #%d: This is not a valid version.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: Ce n''est pas une version valide.

source: %s: Wrong value for input argument #%d: This is not a valid version/dependency.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d: Ce n''est pas une version/dépendance valide.

source: %s: Wrong value for input argument #%d:''error'' or ''warning'' expected.
fr_fr: %s: Mauvaise valeur pour l''argument d''entrée n° %d:''error'' ou ''warning'' attendue.

source: %s: You have not enough rights to remove any version of the package %s.
fr_fr: %s: Vous ne disposez pas des droits pour supprimer aucune version du paquet %s.

source: %s: You have not enough rights to remove the package %s (%s).
fr_fr: %s: Vous n'avez pas assez de droits pour supprimer le paquet %s (%s).

source: %s: You haven''t write access on this directory : %s.
fr_fr: %s: Vous n''avez pas les droits d''écriture dans ce répertoire : %s.

source: %s: the package ''%s'' doesn''t contain the field ''%s''.
fr_fr: %s: le package ''%s'' ne contient pas le champ ''%s''.

source: %s: the package ''%s'' doesn''t exist.
fr_fr: %s: le package ''%s'' n''existe pas.

source: &Edit
fr_fr: &Edition

source: &File
fr_fr: &Fichier

source: &Tools
fr_fr: &Outils

source: Atoms Help...
fr_fr: Aide Atoms...

source: Atoms error
fr_fr: Erreur Atoms

source: Author(s)
fr_fr: Auteur(s)

source: Automatically Installed
fr_fr: Installé automatiquement

source: Bytes
fr_fr: Octets

source: Category(ies)
fr_fr: Catégorie(s)

source: Close
fr_fr: Fermer

source: Depend
fr_fr: Dépend

source: Download size
fr_fr: Taille du téléchargement

source: Entity
fr_fr: Entité

source: File
fr_fr: Fichier

source: Install
fr_fr: Installer

source: Install Directory
fr_fr: Répertoire d'installation

source: Installation done! Please restart Scilab to take changes into account.
fr_fr: Installation complete! Veuillez redemarrer Scilab pour que les modifications soient prises en compte.

source: Installation failed!
fr_fr: Installation échouée!

source: KB
fr_fr: Ko

source: License
fr_fr: Licence

source: MB
fr_fr: Mo

source: Maintainer(s)
fr_fr: Mainteneur(s)

source: No Atoms module is available. Please, check your Internet connection.
fr_fr: Aucun module externe disponible. Veuillez verifier votre connexion internet.

source: No Atoms module is available: your repository list is empty.
fr_fr: Aucun module externe disponible. Votre liste de depot est vide.

source: Remove
fr_fr: Supprimer

source: Remove done! Please restart Scilab to take changes into account.
fr_fr: Désinstallation éffectuée! Veuillez redemarrer Scilab pour que les modifications soient prises en compte.

source: Remove failed!
fr_fr: Désintallation echouée!

source: Scilab Version
fr_fr: Version Scilab

source: Status
fr_fr: Statut

source: Summary
fr_fr: Résumé

source: Title
fr_fr: Titre

source: Update
fr_fr: Mettre à jour

source: Update done! Please restart Scilab to take changes into account.
fr_fr: Mise a jour effectuée! Veuillez redemarrer Scilab pour que les modifications soient prises en compte.

source: Update failed!
fr_fr: La mise à jour a échouée !

source: WebSite
fr_fr: Site web
