Repository: ScilabOrg/scilab
Catalog: scilab/modules/output_stream/locales/*.po
Languages: fr_fr, ja_jp

source: %s: Wrong number of input arguments: at most %d expected.
fr_fr: %s : Nombre erroné d'arguments d'entrée : au plus %d attendus.
ja_jp: %s: 入力引数の数が不正です: 最大で %d を想定します。

source: %s: Wrong number of input arguments: data do not fit with format.
fr_fr: %s : Nombre erroné d'arguments d'entrée : Les données ne correspondent pas au format.

source: %s: Can not read input argument #%d.
fr_fr: %s : Impossible de lire l'argument d'entrée n°%d.

source: %s: Wrong size for input argument #%d: A string expected.
fr_fr: %s : Dimension erronée de l'argument d'entrée n°%d : Une chaîne de caractères attendue.
ja_jp: %s: 入力引数 #%d の大きさが正しくありません: 文字列を指定してください.

source: %s: Memory allocation error.
fr_fr: %s : Erreur d'allocation mémoire.
ja_jp: %s: メモリ確保エラー.

source: %s: Wrong number of input arguments: data doesn't fit with format.
fr_fr: %s : Nombre erroné d'arguments d'entrée : Les données ne correspondent pas au format.
ja_jp: %s: 入力引数の数が不正です: データはフォーマットに適合しません。

source: %s: Wrong value of input argument #%d: data doesn't fit with format.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Les données ne correspondent pas au format.

source: %s: No more memory.
fr_fr: %s : Plus de mémoire disponible.
ja_jp: %s: メモリ不足です.

source: %s: Wrong value for input argument #%d: 0 expected.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : 0 attendu.
ja_jp: %s: 入力引数 #%d で不正な値: 0 を想定します。

source: %s: error can not create diary: %s.
fr_fr: %s : Erreur, impossible de créer le journal : %s.
ja_jp: %s: カレンダーを生成することができません: %s

source: %s: error can not create diary.
fr_fr: %s : Erreur, impossible de créer le journal.
ja_jp: %s: カレンダーを生成できません。

source: %s: error can not close diary.
fr_fr: %s : Erreur, impossible de fermer le journal.
ja_jp: %s: カレンダーを閉じることができません。

source: %s: Wrong size for input argument #%d.
fr_fr: %s : Dimension erronée de l'argument d'entrée n°%d.
ja_jp: %s: 入力引数 #%d で不正なサイズです。

source: %s: Wrong type for input argument #%d.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d.
ja_jp: %s: 入力引数 #%d の型が間違っています.

source: %s: Wrong value for input argument #%d.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d.
ja_jp: %s: 入力引数 #%d で不正な値です。

source: %s: Wrong size for input argument #%d: A vector expected.
fr_fr: %s : Dimension erronée de l'argument d'entrée n°%d : Un vecteur attendu.
ja_jp: %s: 入力引数 #%d で不正なサイズ: ベクトルを想定します。

source: %s: Wrong type for input argument #%d: A scalar expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Un scalaire attendu.
ja_jp: %s: 入力引数 #%d の型が間違っています: スカラーを指定してください.

source: %s: Wrong type for input argument #%d: A string expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Une chaîne de caractères attendue.
ja_jp: %s: 入力引数 #%d の型が間違っています: 文字列を指定してください.

source: %s: Wrong value for input argument #%d: diary ID %d not exists.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : L'identifiant %d du journal n'existe pas.
ja_jp: %s: 入力引数 #%d で不正な値: カレンダーID %d は存在しません。

source: %s: Wrong value for input argument #%d: diary filename not exists.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Le nom de fichier du journal n'existe pas.
ja_jp: %s: 入力引数 #%d で不正な値: カレンダーファイル名は存在しません。

source: %s: Wrong value for input argument #%d: error can not close diary.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Erreur, Impossible de fermer le journal.
ja_jp: %s: 入力引数 #%d で不正な値: カレンダーを閉じることができません。

source: %s: Wrong value for input argument #%d: error can not close diary %d.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Erreur, impossible de fermer le journal %d.
ja_jp: %s: 入力引数 #%d で不正な値: カレンダー %d を閉じることができません。

source: %s: Wrong value for input argument #%d: error can not pause diary.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Erreur, impossible d'interrompre le journal.
ja_jp: %s: 入力引数 #%d で不正な値: カレンダーを休止できません。

source: %s: Wrong value for input argument #%d: error can not pause diary %d.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Erreur, impossible d'interrompre le journal %d.
ja_jp: %s: 入力引数 #%d で不正な値: カレンダー %d を休止できません。

source: %s: Wrong value for input argument #%d: error can not resume diary.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Erreur, impossible de reprendre le journal.
ja_jp: %s: 入力引数 #%d で不正な値: カレンダーを再開できません。

source: %s: Wrong value for input argument #%d: error can not resume diary %d.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Erreur, impossible de reprendre le journal %d.
ja_jp: %s: 入力引数 #%d で不正な型: カレンダー %d を再開することができません。

source: %s: Not enough arguments.
fr_fr: %s : Pas assez d'arguments.
ja_jp: %s: 引数が不足しています。

source: %s: An error occurred: %s
fr_fr: %s : Une erreur s'est produite : %s
ja_jp: %s: エラーが発生しました: %s

source: Buffer too small.
fr_fr: Mémoire tampon trop petite.
ja_jp: バッファが小さすぎます。

source: %s: Bad conversion 'l' or 'h' flag mixed with 's' directive.
fr_fr: %s : Mauvaise conversion drapeau 'l' ou 'h' mélangé avec la directive 's'.
ja_jp: %s: 悪い変換です, 'l' または 'h' フラグが 's' 命令と混在しています.

source: %s: Bad conversion 'l' or 'h' flag mixed with 'c' directive.
fr_fr: %s : Mauvaise conversion drapeau 'l' ou 'h' mélangé avec la directive 'c'.
ja_jp: %s: 悪い変換です, 'l' または 'h' フラグが 'c' 命令と混在しています.

source: Bad conversion.
fr_fr: Conversion erronée
ja_jp: 悪い変換です。

source: Incorrect assignment.
fr_fr: Affectation erronée.
ja_jp: 不正確な割り当てです。

source: Invalid factor.
fr_fr: Facteur invalide.
ja_jp: 無効な要素です。

source: Waiting for right parenthesis.
fr_fr: En attente d'une parenthèse droite.
ja_jp: 正しい括弧を待っています。

source: Undefined variable: %s
fr_fr: Variable non définie : %s
ja_jp: 変数は定義されていません: %s

source: Undefined variable.
fr_fr: Variable non définie.
ja_jp: 未定義の変数.

source: Inconsistent column/row dimensions.
fr_fr: Dimensions colonne/rangée incohérentes.
ja_jp: 一貫性がない 列/行 次元 です。

source: Inconsistent row/column dimensions.
fr_fr: Dimensions rangée/colonne incohérentes.
ja_jp: 一貫性がない 行/列 次元 です。

source: Dot cannot be used as modifier for this operator.
fr_fr: Le point ne peut pas être utilisé comme modificateur de cet opérateur.
ja_jp: ドット(.) をこの演算子で修正子として使用できません.

source: Inconsistent addition.
fr_fr: Addition incohérente.
ja_jp: 一貫性がない追加です。

source: Inconsistent subtraction.
fr_fr: Soustraction incohérente.
ja_jp: 一貫性がない引き算です。

source: Inconsistent multiplication.
fr_fr: Multiplication incohérente.
ja_jp: 一貫性がない掛け算です。

source: Inconsistent right division.
fr_fr: Division droite incohérente.
ja_jp: 右除算に一貫性がありません.

source: Inconsistent left division.
fr_fr: Division gauche incohérente.
ja_jp: 左除算に一貫性がありません.

source: Redefining permanent variable.
fr_fr: Redéfinition d'une variable permanente.
ja_jp: 再定義されている永久的な変数です。

source: Eye variable undefined in this context.
fr_fr: La variable Eye n'est pas définie dans ce contexte.
ja_jp: このコンテキストで eye 変数が未定義です.

source: Submatrix incorrectly defined.
fr_fr: La sous-matrice n'est pas correctement définie.
ja_jp: 部分行列は正しくない定義です。

source: Incorrect command!
fr_fr: Commande erronée !
ja_jp: 正しくないコマンドです。

source: stack size exceeded!
fr_fr: Taille de la pile dépassée
ja_jp: スタックサイズは制限を越えました。

source: Use stacksize function to increase it.
fr_fr: Utilisez la fonction stacksize pour l'augmenter.
ja_jp: スタックサイズ関数を使ってそれを増やして下さい。

source: Memory used for variables: %d
fr_fr: Mémoire utilisée pour les variables : %d
ja_jp: 変数にメモリが使われました: %d

source: Intermediate memory needed: %d
fr_fr: Mémoire intermédiaire requise : %d
ja_jp: 中間的なメモリが必要です: %d

source: Total memory available: %d
fr_fr: Mémoire totale disponible : %d
ja_jp: 全部のメモリは可能です: %d

source: Too many variables!
fr_fr: Trop de variables !
ja_jp: 変数が多すぎます!

source: Problem is singular.
fr_fr: Le problème est singulier.
ja_jp: 重大な問題です。

source: Wrong type for first argument: Square matrix expected.
fr_fr: Type erroné du premier argument : Une matrice carrée attendue.
ja_jp: 最初の引数で不正な型: 正方行列を想定します。

source: Wrong type for argument #%d: Square matrix expected.
fr_fr: Type erroné de l'argument %d : Une matrice carrée attendue.

source: Invalid index.
fr_fr: Index invalide.
ja_jp: 不正なインデックスです。

source: Recursion problems. Sorry...
fr_fr: Problèmes de récursivité.
ja_jp: 回帰問題、、すみません....

source: Matrix norms available are 1, 2, inf, and fro.
fr_fr: Les normes matricielles disponibles sont 1, 2, inf et fro.
ja_jp: 行列標準は、1, 2, inf, と fro です。

source: Convergence problem...
fr_fr: Problème de convergence...
ja_jp: 収束問題...

source: Bad call to primitive: %s
fr_fr: Appel erroné de la primitive : %s
ja_jp: プリミティブへの不正なコール: %s

source: Too complex recursion! (recursion tables are full)
fr_fr: Récursivité trop complexe ! (Les tables de récurrence sont pleines)
ja_jp: とても複雑な回帰!(回帰テーブルの限界)

source: Division by zero...
fr_fr: Division par zéro...
ja_jp: ゼロ割り...

source: Empty function...
fr_fr: Fonction vide...
ja_jp: 空の関数...

source: Matrix is not positive definite.
fr_fr: La matrice n'est pas définie positive.
ja_jp: 行列は、明確な定義ではありません。

source: Invalid exponent.
fr_fr: Exposant invalide.
ja_jp: 不正なベキ指数です。

source: Incorrect string.
fr_fr: Chaîne de caractères erronée.
ja_jp: 不正確な文字列です。

source: Singularity of log or tan function.
fr_fr: Singularité de la fonction log ou tan.
ja_jp: logの特異点、または、tan関数です。

source: Too many ':'
fr_fr: Trop de ':'
ja_jp: ':' が多すぎます

source: Incorrect control instruction syntax.
fr_fr: Syntaxe de l'instruction de contrôle erronée.
ja_jp: コントロール命令の構文が正しくありません。

source: Syntax error in a '%s' instruction.
fr_fr: Erreur de syntaxe dans une instruction '%s'.
ja_jp: '%s' 命令の構文が間違っています。

source: Wrong first argument.
fr_fr: Premier argument erroné.
ja_jp: 最初の引数が不正です。

source: Wrong input argument #%d.
fr_fr: Argument d'entrée n°%d erroné.

source: Incorrect function at line %d.
fr_fr: Fonction erronée à la ligne %d.
ja_jp: 行 %d で正しくない関数です。

source: Incorrect function.
fr_fr: Fonction erronée.
ja_jp: 正しくない関数です。

source: Wrong file name.
fr_fr: Nom de fichier erroné.
ja_jp: 誤っているファイル名です。

source: Incorrect number of input arguments.
fr_fr: Nombre erroné d'arguments d'entrée.
ja_jp: 入力引数で正しくない数です。

source: Waiting for end of command.
fr_fr: En attente de la fin de la commande.
ja_jp: コマンドの終了を待っています。

source: Incompatible output argument.
fr_fr: Argument de sortie incompatible.
ja_jp: 互換性のない出力引数です。

source: Incompatible input argument.
fr_fr: Argument d'entrée incompatible.
ja_jp: 互換性のない入力引数です。

source: Not implemented in scilab...
fr_fr: Non implémenté dans Scilab...
ja_jp: Scilab で実施されませんでした...

source: Wrong argument #%d.
fr_fr: Argument n°%d erroné.

source: null matrix (argument # %d).
fr_fr: Matrice null (argument n°%d).
ja_jp: NULL行列(引数 #%d)

source: Incorrect syntax.
fr_fr: Syntaxe erronée.
ja_jp: 不正確な構文です。

source: end or else is missing...
fr_fr: end ou else est manquant...
ja_jp: end または else が抜けています...

source: input line longer than buffer size: %d
fr_fr: la ligne d'entrée est plus longue que la taille de la mémoire tampon : %d
ja_jp: バッファ長よりも長い入力行: %d

source: Incorrect file or format.
fr_fr: Fichier ou format erroné.
ja_jp: 正しくないファイル、またはフォーマットです。

source: %s: subroutine not found.
fr_fr: %s : Impossible de trouver la sous-routine.

source: Wrong type for argument #%d: Real matrix expected.
fr_fr: Type erroné de l'argument %d : Une matrice réelle attendue.

source: Wrong type for input argument #%d: Real or complex matrix expected.
fr_fr: Type erroné de l'argument d'entrée n°%d : Une matrice réelle ou complexe attendue.

source: Wrong type for input argument #%d: Polynomial expected.
fr_fr: Type erroné de l'argument d'entrée n°%d : Un polynôme attendu.

source: Wrong type for argument #%d: String expected.
fr_fr: Type erroné de l'argument %d : Une chaîne de caractères attendue.

source: Wrong type for argument #%d: List expected.
fr_fr: Type erroné de l'argument %d : Une liste attendue.

source: Problem with comparison symbol...
fr_fr: Problème avec le symbole de comparaison...
ja_jp: 比較シンボルの問題...

source: Wrong number of input arguments: This function has no input argument.
fr_fr: Nombre erroné d'arguments d'entrée : Cette fonction n'a pas d'argument d'entrée.
ja_jp: 入力引数で不正な値です: この関数は入力引数を持ちません。.

source: Wrong number of input arguments.
fr_fr: Nombre erroné d'arguments d'entrée.

source: Wrong number of output arguments: This function has no output argument.
fr_fr: Nombre erroné d'arguments de sortie : Cette fonction n'a pas d'argument de sortie.
ja_jp: 出力引数で不正な値です: この関数は出力引数を持ちません。.

source: Wrong number of output arguments.
fr_fr: Nombre erroné d'arguments de sortie.

source: Wrong size for argument: Incompatible dimensions.
fr_fr: Dimension erronée de l'argument : Dimensions incompatibles.
ja_jp: 引数でサイズが不正: 互換性がない次元です。

source: Direct access : give format.
fr_fr: Accès direct : donnez le format.
ja_jp: 直接アクセス : フォーマットを与えて下さい。

source: End of file at line %d.
fr_fr: Fin de fichier à la ligne %d.
ja_jp: %d 行目でファイル終端(EOF)に達しました.

source: %d graphic terminal?
fr_fr: %d terminaux graphiques ?
ja_jp: %d グラフィック ターミナル?

source: Integration fails.
fr_fr: Échec de l'intégration.
ja_jp: 統合失敗

source: %d: logical unit already used.
fr_fr: %d : Unité logique déjà utilisée.
ja_jp: %d: ロジカルユニットはすでに使われています。

source: Too many files opened!
fr_fr: Trop de fichiers ouverts !
ja_jp: 変数が多すぎます!

source: Unknown file format.
fr_fr: Format de fichier inconnu.
ja_jp: 未知のファイルフォーマットです。

source: Fatal error!!! Your variables have been saved in the file : %s
fr_fr: Erreur ! Vos variables ont été enregistrées dans le fichier : %s

source: Bad call to a scilab function ?
fr_fr: Appel erroné d'une fonction Scilab ?

source: Otherwise, send a bug report to :
fr_fr: Sinon, veuillez envoyer un rapport de bug à :

source: Floating point exception.
fr_fr: Exception de virgule flottante.
ja_jp: 浮動小数点例外

source: Too many arguments in fort (max 30).
fr_fr: Trop d'arguments dans fort (max 30).
ja_jp: 現在の引数が多すぎます(最大 30)

source: This variable is not valid in fort.
fr_fr: Cette variable n'est pas valide dans fort.
ja_jp: この変数は、現在妥当ではありません。

source: %s is not valid in this context.
fr_fr: %s n'est pas valide dans ce contexte.
ja_jp: %s は、この文脈で妥当ではありません。

source: Error while linking.
fr_fr: Erreur pendant l'édition des liens.
ja_jp: リンク中にエラー

source: Leading coefficient is zero.
fr_fr: Le premier cœfficient est zéro.
ja_jp: 主要な係数はゼロです。

source: Too high degree (max 100).
fr_fr: Degré trop grand (max 100).
ja_jp: とても高い度(最大 100)です。

source: for x=val with type(val)=%d is not implemented in Scilab.
fr_fr: pour x=val avec type(val)=%d n'est pas implémenté dans Scilab.
ja_jp: for x=val with type(val)=%d は、Scilabで装備されていません。

source: %s: Wrong number of input arguments.
fr_fr: %s : Nombre erroné d'arguments d'entrée.
ja_jp: %s: 入力引数の数が不正です。

source: %s: Wrong number of output arguments.
fr_fr: %s : Nombre erroné d'arguments de sortie.
ja_jp: %s: 出力引数の数が不正です。

source: Indexing not allowed for output arguments of resume.
fr_fr: L'indexation n'est pas autorisé pour les arguments de sortie de resume.
ja_jp: 再開の出力引数でインデックスは許されませんでした。

source: Incorrect function (argument n: %d).
fr_fr: Fonction erronée (argument n : %d).
ja_jp: 不正確な関数(引数 n: %d)

source: %s: Wrong type for argument #%d: Real or complex matrix expected.
fr_fr: %s : Type erroné de l'argument %d : Une matrice réelle ou complexe attendue.

source: %s: Wrong type for argument #%d: Real matrix expected.
fr_fr: %s : Type erroné de l'argument %d : Une matrice réelle attendue.

source: %s: Wrong type for argument #%d: Real vector expected.
fr_fr: %s : Type erroné de l'argument %d : Un vecteur réel attendu.

source: %s: Wrong type for argument #%d: Scalar expected.
fr_fr: %s : Type erroné de l'argument n°%d : Un scalaire attendu.

source: Host does not answer...
fr_fr: L'hôte ne répond pas...
ja_jp: ホストは応答しません...

source: Uncontrollable system.
fr_fr: Système non contrôlable.
ja_jp: システムのコントロールが不能です。

source: Unobservable system.
fr_fr: Système non observable.
ja_jp: システムの識別が出来ません。

source: %s: singular or asymmetric problem.
fr_fr: %s : Problème singulier ou asymétrique.
ja_jp: %s: 特異または非対称問題。

source: Wrong size for argument #%d.
fr_fr: Dimension erronée de l'argument %d.

source: Wrong type for argument #%d: Transfer matrix expected.
fr_fr: Type erroné de l'argument %d : Une matrice de transfert attendue.

source: Wrong type for argument #%d: In state space form expected.
fr_fr: Type erroné de l'argument %d : Attendu sous la forme d'espace d'état.

source: Wrong type for argument #%d: Rational matrix expected.
fr_fr: Type erroné de l'argument %d : Une matrice rationnelle attendue.

source: Wrong type for argument #%d: In continuous time expected.
fr_fr: Type erroné de l'argument %d : Attendu en temps continu.

source: Wrong type for argument #%d: In discrete time expected.
fr_fr: Type erroné de l'argument %d : Attendu en temps discret.

source: Wrong type for argument #%d: SISO expected.
fr_fr: Type erroné de l'argument %d : SISO attendu.

source: time domain of argument #%d is not defined.
fr_fr: Le domaine temporel de l'argument n°%d n'est pas défini.

source: Wrong type for argument #%d: A system in state space or transfer matrix form expected.
fr_fr: Type erroné de l'argument %d : Un système sous la forme d'espace d'état ou de matrice de transfert attendu.

source: Variable returned by scilab argument function is incorrect.
fr_fr: La variable retournée par la fonction Scilab passée en argument n'est pas valide.
ja_jp: scilab引数関数によって返された変数は、不正確です。

source: Elements of %dth argument must be in increasing order.
fr_fr: Les éléments du %dième argument doivent être rangés en ordre croissant.
ja_jp: %d 番目の引数の要素は昇順とする必要があります.

source: Elements of first argument are not (strictly) increasing.
fr_fr: Les éléments du premier argument ne sont pas (strictement) croissant.
ja_jp: 最初の引数の要素が(厳密に)昇順になっていません.

source: Elements of %dth argument are not in (strictly) decreasing order.
fr_fr: Les éléments du %dième argument ne sont pas rangés en ordre (strictement) décroissant.
ja_jp: %d 番目の引数の要素が(厳密に)降順になっていません.

source: Elements of first argument are not in (strictly) decreasing order.
fr_fr: Les éléments du premier argument ne sont pas rangés en ordre (strictement) décroissant.
ja_jp: 最初の引数の要素が(厳密に)降順になっていません.

source: Last element of %dth argument <> first.
fr_fr: Le dernier élément du %dième argument <> en premier.
ja_jp: %d 番目の引数の最後の要素 <> 最初の要素.

source: Last element of first argument does not match the first one.
fr_fr: Le dernier élément du premier argument ne correspond pas au premier élément.
ja_jp: 最後の引数の最初の要素が初期のものと一致しません。

source: Variable or function %s are not in file.
fr_fr: La variable ou la fonction %s n'est pas dans le fichier.
ja_jp: 変数または機能 %s は、ファイルにありません。

source: Variable %s is not a valid rational function.
fr_fr: La variable %s n'est pas une fonction rationnelle valide.
ja_jp: 変数 %s は、妥当な有理関数ではありません。

source: Variable %s is not a valid state space representation.
fr_fr: La variable %s n'est pas dans une représentation espace d'état valide.
ja_jp: 変数 %s は、妥当な公式の空間表現ではありません。

source: Undefined function.
fr_fr: Fonction non définie.

source: Function name already used.
fr_fr: Nom de fonction déjà utilisé.
ja_jp: 関数名は既に使われています。

source: Too many functions are defined (maximum #:%d).
fr_fr: Trop de fonctions sont définies (maximum : %d).
ja_jp: 関数定義が多すぎます(最大 #:%d)

source: Too complex for scilab, may be a too long control instruction.
fr_fr: Erreur : L'instruction de contrôle est peut-être trop longue.
ja_jp: あまりにもscilabにとって複雑です、とても長いコントロール指示かもしれません。

source: Too large, can't be displayed.
fr_fr: Trop large, affichage impossible.
ja_jp: とても大きいため表示できませんでした。

source: %s was a function when compiled but is now a primitive!
fr_fr: %s était une fonction à la compilation mais est maintenant une primitive !
ja_jp: %s はコンパイル時は関数でしたが, 現時点ではプリミティブです!

source: Trying to re-define function %s.
fr_fr: Essaye de redéfinir la fonction %s.
ja_jp: 機能 %s を再定義するよう試みてください。

source: No more memory.
fr_fr: Plus de mémoire disponible.
ja_jp: これ以上メモリがありません。

source: Too large string.
fr_fr: Chaîne de caractères trop longue.
ja_jp: 文字列が大きすぎます。

source: Too many linked routines.
fr_fr: Trop de routines liées.
ja_jp: ルーチンのリンクが多すぎます。

source: Stack problem detected within a loop. A primitive function has been called with a wrong number of output arguments. No output argument test has been made for this function. Please report this bug :
fr_fr: Problème de pile détecté pendant une boucle. Une fonction primitive a été appelée avec un nombre erroné d'arguments de sortie. Aucun test sur les arguments de sortie n'a pu être effectué dans cette fonction. Veuillez rapporter ce bug :
ja_jp: ループ内にスタック問題がみつかりました。 原始関数は、出力引数で誤っている数で呼ばれました。 いかなる出力引数テストも、この関数のために作られませんでした。 どうぞこのバグを報告して下さい :

source: Wrong value for argument #%d.
fr_fr: Valeur erronée de l'argument %d.

source: List element number %d is Undefined.
fr_fr: L'élément %d de la liste n'est pas défini.
ja_jp: リスト要素番号 %d は、定義されていません。

source: Wrong type for argument #%d: Named variable not an expression expected.
fr_fr: Type erroné de l'argument %d : Une variable nommée n'est pas l'expression attendue.

source: Indices for non-zero elements must be given by a 2 column matrix.
fr_fr: Les indices des éléments non-nuls doivent être donnés dans une matrice 2 colonnes.
ja_jp: 零でない要素のインデックスは、２つの行列の列によって与えられなくてはいけません。

source: Incompatible indices for non-zero elements.
fr_fr: Indices incompatibles pour les éléments non-nuls.
ja_jp: 零でない要素の互換性がないインデックスです。

source: Logical unit number should be larger than %d.
fr_fr: Le numéro d'unité logique doit être plus grand que %d.
ja_jp: ロジカルユニット番号は、 %d よりも大きくなければなりません。

source: Function not bounded from below.
fr_fr: La fonction n'est pas bornée inférieurement.
ja_jp: 下からの関数は抑制されませんでした。

source: Problem may be unbounded: too high distance between two consecutive iterations.
fr_fr: Le problème peut être non borné : La distance est trop grande entre deux itérations consécutives.
ja_jp: 問題は果てしないかもしれません: ２回の連続する繰り返しのとても高い距離です。

source: Inconsistent constraints.
fr_fr: Contraintes incompatibles.
ja_jp: 一貫性がない制約です。

source: No feasible solution.
fr_fr: Pas de solution réalisable.
ja_jp: 実行できる解決策がありません。

source: Degenerate starting point.
fr_fr: Point de départ dégénéré.
ja_jp: 悪化した開始点

source: No feasible point has been found.
fr_fr: Aucun point réalisable n'a été trouvé.
ja_jp: いかなる実行できる点も、見つけられませんでした。

source: Optimization fails: back to initial point.
fr_fr: Échec de l'optimisation : Retour au point initial.
ja_jp: 最適化失敗: 最初の点に戻ります。

source: %s: Stop requested by simulator (ind=0)
fr_fr: %s : Arrêt demandé par le simulateur (ind=0)
ja_jp: %s: シミュレーターから停止要求(ind=0)

source: %s: Wrong input parameters.
fr_fr: %s : Paramètres d'entrée faux.
ja_jp: %s: 入力引数が不正です。

source: Too small memory.
fr_fr: Mémoire trop limitée.
ja_jp: メモリが小さすぎます。

source: %s: Problem with initial constants in simul.
fr_fr: %s : Problèmes avec les constantes initiales dans simul.
ja_jp: %s: シミュレーション初期定数を有する問題

source: %s: Bounds and initial guess are incompatible.
fr_fr: %s : Les bornes et le point initial sont incompatibles.
ja_jp: %s: 境界と初期推定に互換性がありません.

source: %s: This method is NOT implemented.
fr_fr: %s : Cette méthode n'est pas implémentée.
ja_jp: %s: この手法は未実証です.

source: NO hot restart available in this method.
fr_fr: PAS de redémarrage à chaud disponible pour cette méthode.
ja_jp: この方法でいかなる最新のリスタートは可能ではありません。

source: %s: Incorrect stopping parameters.
fr_fr: %s : Paramètres d'arrêts erronés.
ja_jp: %s: 不正確な停止パラメータです。

source: %s: Incorrect bounds.
fr_fr: %s : Bornes erronées.
ja_jp: %s: 不正確な境界

source: Variable : %s must be a list
fr_fr: Variable : %s doit être une liste
ja_jp: 変数 : %s リストでなくてはなりません

source: Hot restart: dimension of working table (argument n:%d).
fr_fr: Redémarrage à chaud : Dimension de l'espace de travail (argument n : %d).
ja_jp: 最新のリスタート: 動作テーブルの次元(引数 n:%d)

source: %s: df0 must be positive !
fr_fr: %s : df0 doit être positif !
ja_jp: %s: df0 は正である必要があります!
