Repository: ScilabOrg/scilab
Catalog: scilab/modules/output_stream/locales/*.po
Languages: fr_fr, ja_jp

source: Unknown key <%s> ignored.
fr_fr: La clef inconnue <%s> est ignorée.
ja_jp: 未知のキー <%s> を無視しました。

source: %s: window dimensions have been set less than 2^16.
fr_fr: %s : Les dimensions de la fenêtre ont été réduites à moins de 2^16.
ja_jp: %s: ウインドウ次元が 2^16 よりも少なく設定されています。

source: Some data have not been computed they are replaced by NaN.
fr_fr: Des données n'ont pas été calculées, elles sont remplacées par NaN.
ja_jp: いくらかのデータが計算されませんでした、それらは NaN によって変更されました。

source: %s: both actual and predicted relative reductions in the criterion at most %s.
fr_fr: %s : Les réductions relatives actuelle et prédite du critère sont au plus %s.
ja_jp: %s: 評価値の相対的な減少の実際の値および予測値は共に最大 %s.

source: %s: relative error between two consecutive iterates is at most %s.
fr_fr: %s : L'erreur relative entre deux itérations consécutives est au plus %s.
ja_jp: %s: 連続する2回の反復の間の相対誤差は最大 %s です.

source: %s: the cosine of the angle between %s and any column of the jacobian is at most %s in absolute value.
fr_fr: %s : Le cosinus de l'angle entre %s et n'importe quelle colonne du Jacobien est au plus %s en valeur absolue.
ja_jp: %s: %s およびヤコビアンの任意の列の間の角度の余弦の絶対値は最大 %s です.

source: %s: %s: Number of calls to %s has reached or exceeded %s.
fr_fr: %s : %s : Le nombre d'appels à %s a été atteint ou a dépassé %s.

source: Warning
fr_fr: Attention

source: %s: %s: %s is too small. No further reduction in the criterion is possible.
fr_fr: %s : %s : %s est trop petit. Aucune autre réduction du critère n'est possible.

source: %s: %s: %s is too small. %s is orthogonal to the columns of the Jacobian to machine precision.
fr_fr: %s : %s : %s est trop petit. %s est orthogonal aux colonnes du Jacobien à la précision machine près.

source: poly: variable name must be lesser than 5 characters long.
fr_fr: poly: le nom de variable doit faire moins de 5 caractères de long.
ja_jp: 代数曲面: 変数名は、５文字よりも少しは長くなくてはいけません。

source: Warning: Syntax "vector ^ scalar" is obsolete. It will be removed in Scilab 6.0. Use "vector .^ scalar" instead.
fr_fr: Attention : La syntaxe "vector ^ scalar" est obsolète. Elle sera supprimée dans Scilab 6.0. Veuillez utiliser "vector .^ scalar" à la place.

source: (cont'd) %s
fr_fr: (continue) %s
ja_jp: (続き) %s

source: (end) %s
fr_fr: (fin) %s
ja_jp: (終了) %s

source: %s: Wrong number of input argument(s): %d to %d expected.
fr_fr: %s : Nombre erroné d'argument(s) d'entrée : %d à %d attendu(s).

source: %s: Wrong type for input argument #%d: String expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Une chaîne de caractères attendue.

source: %s: Wrong value for input argument #%d: '%s', '%s', '%s', '%s', '%s' or '%s' expected.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : '%s', '%s', '%s', '%s', '%s' ou '%s' attendu.

source: %s: Wrong type for argument #%d: Boolean expected.
fr_fr: %s : Type erroné de l'argument n°%d : Un booléen attendu.

source: %s: Wrong number of input arguments: %d to %d expected
fr_fr: %s : Nombre erroné d'arguments d'entrée : %d à %d attendus.

source: %s: Wrong export format: %s
fr_fr: %s : Format d'export erroné : %s

source: %s: Type %s is not handled : Define the function %s2%s.
fr_fr: %s : Le type %s n'est pas géré : Veuillez définir la fonction %s2%s.

source: %s: Wrong number of input argument(s).
fr_fr: %s : Nombre erroné d'argument(s) d'entrée.

source: %s: Wrong size for input argument #%d: A character string expected.
fr_fr: %s : Dimension erronée de l'argument d'entrée n°%d : Une chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: A character string expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Une chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: A state-space model expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Un modèle d'espace d'état attendu.

source: %s: system cannot be displayed in this page.
fr_fr: %s : Le système ne peut pas s'afficher dans cette page.

source: "unknown data"
ja_jp: "未知のデータ"

source: %s: %s is too small. %s is orthogonal to the columns of the jacobian to machine precision.
ja_jp: %s: %s は小さすぎます. %s は機械精度のヤコビアンの列に直交しています.

source: %s: %s is too small. No further reduction in the criterion is possible.
ja_jp: %s: %s は小さすぎます. 閾値をこれ以上小さくすることはできません.

source: %s: Number of calls to %s has reached or exceeded %s.
ja_jp: %s: %sへの呼出しの数は、%sに達したか、または超えました。

source: %s: Wrong number of input arguments: at least %d expected.
ja_jp: %s: 入力引数の数が間違っています: %d 個以上の引数を指定してください.

source: %s: Wrong size for argument %d: %d expected.
ja_jp: %s: 入力引数 %d で不正なサイズ: %d を想定します。

source: %s: Wrong size for argument %d: (%d,%d) expected.
ja_jp: %s: 引数 %d の大きさが間違っています: 大きさを (%d,%d) としてください.

source: %s: Wrong type for argument %d: Boolean matrix expected.
ja_jp: %s: 引数 %d の型が間違っています: 論理値行列を指定してください.

source: %s: Wrong type for argument %d: Function or string (external function) expected.
ja_jp: %s: 引数 %d の型が間違っています: 関数または文字列(外部関数)を指定してください.

source: %s: Wrong type for argument %d: List expected.
ja_jp: %s: 引数 %d の型が間違っています: リスト(list)を指定してください.

source: %s: Wrong type for argument %d: Matrix expected.
ja_jp: %s: 引数 %d の型が間違っています: 行列を指定してください.

source: %s: Wrong type for argument %d: Matrix of strings expected.
ja_jp: %s: 引数 %d の型が間違っています: 文字列の行列を指定してください.

source: %s: Wrong type for argument %d: Polynomial expected.
ja_jp: %s: 入力引数 %d で不正な型: 多項式行列を想定します。

source: %s: Wrong type for argument %d: Real matrix expected.
ja_jp: %s: 引数 %d の型が間違っています: 実数行列を指定してください.

source: %s: Wrong type for argument %d: Real or complex matrix expected.
ja_jp: %s: 引数 %d の型が間違っています: 実数または複素数の行列を指定してください.

source: %s: Wrong type for argument %d: Real vector expected.
ja_jp: %s: 引数 %d の型が間違っています: 実数ベクトルを指定してください.

source: %s: Wrong type for argument %d: Scalar expected.
ja_jp: %s: 引数 %d で不正なサイズ: スカラーを想定します。

source: %s: Wrong type for argument %d: Vector expected.
ja_jp: %s: 引数 %d の型が間違っています: ベクトルを指定してください.

source: %s: Wrong type for argument %d: Working int matrix expected.
ja_jp: %s: 引数 %d の型が間違っています: 整数行列を指定してください.

source: %s: Wrong value of input argument %d: data doesn't fit with format.
ja_jp: %s: 入力引数 %d で不正な値: データはフォーマットに適合しません。

source: Arguments are :
ja_jp: 引数です:

source: Fatal error!!! Your variables have been saved in the file : %s Bad call to a scilab function ? Otherwise, send a bug report to :
ja_jp: 致命的なエラー!!! 変数がファイルに保存されました: %s

source: Undefined fonction.
ja_jp: 関数は定義されていません。

source: Wrong argument %d.
ja_jp: 不正な引数 %d です。

source: Wrong input argument %d.
ja_jp: 入力引数 %d が不正です。

source: Wrong number of input arguments:
ja_jp: 入力引数で不正な値です:

source: Wrong number of output arguments
ja_jp: 出力引数で不正な番号です。

source: Wrong size for argument %d.
ja_jp: 引数 %d で不正なサイズです。

source: Wrong type argument %d: Sparse or full scalar matrix expected.
ja_jp: 引数 %d で不正な型: 疎、または 完全スカラ行列を想定します。

source: Wrong type for argument %d: A system in state space or transfer matrix form expected.
ja_jp: 引数 %d で不正な型: システム空間の状態、または、伝達行列を想定しました。

source: Wrong type for argument %d: Boolean or scalar expected.
ja_jp: 引数 %d で不正な型: ブーリアン、またはスカラーを想定します。

source: Wrong type for argument %d: Handle to sparse lu factors expected.
ja_jp: 引数 %d で不正な型: 疎LU要素を想定します。

source: Wrong type for argument %d: In continuous time expected.
ja_jp: 引数 %d で不正なサイズ: 連続時間を想定します。

source: Wrong type for argument %d: In discrete time expected.
ja_jp: 引数 %d で不正なサイズ: 離散時間を想定します。

source: Wrong type for argument %d: In state space form expected.
ja_jp: 引数 %d で不正なサイズ: 空き状態を想定します。

source: Wrong type for argument %d: List expected.
ja_jp: 入力引数 %d で不正な型: リストを想定します。

source: Wrong type for argument %d: Named variable not an expression expected.
ja_jp: 引数 %d で不正な型: 予想しなかった表現の変数名が付けられています。

source: Wrong type for argument %d: Rational matrix expected.
ja_jp: 引数 %d で不正なサイズ: 有理数行列を想定します。

source: Wrong type for argument %d: Real matrix expected.
ja_jp: 入力引数 %d で不正な型: 実行列を想定します。

source: Wrong type for argument %d: SISO expected.
ja_jp: 引数 %d で不正なサイズ: SISOを想定します。

source: Wrong type for argument %d: Sparse matrix of scalars expected.
ja_jp: 引数 %d で不正な型: 疎行列、またはスカラーを想定します。

source: Wrong type for argument %d: Square matrix expected.
ja_jp: 引数 %d で不正な型: 正方行列を想定します。

source: Wrong type for argument %d: String expected.
ja_jp: 入力引数 %d で、不正な型: 文字列を想定します。

source: Wrong type for argument %d: Transfer matrix expected.
ja_jp: 引数 %d で不正なサイズ: 行列変換を想定します。

source: Wrong type for input argument %d: Polynomial expected.
ja_jp: 入力引数 %d で不正な型: 多項式を想定します。

source: Wrong type for input argument %d: Real or complex matrix expected.
ja_jp: 入力引数 %d で不正な型: 実、または、複素行列.を想定します。

source: Wrong value for argument %d.
ja_jp: 引数 %d で不正な値です。

source: Wrong value for argument %d: Empty string expected.
ja_jp: 入力引数 %d で不正な値: 空文字列を想定します。

source: Wrong value for argument %d: Must not contain NaN or Inf.
ja_jp: 引数 %d で不正な値: NaN または Inf を含んではいけません。

source: Wrong value for argument %d: Valid variable name expected.
ja_jp: 引数 %d で不正な値: 正確な変数名を想定します。

source: Wrong value for argument %d: eigenvalues modulus must be less than one.
ja_jp: 引数 %d で不正な値: 固有値モジュールは、ひとつ以下でなくてはなりません。

source: Wrong value for argument %d: eigenvalues must have negative real parts.
ja_jp: 引数 %d で不正な値: 固有値モジュールは、負の実数部を持たなくてはなりません。

source: Wrong value for argument %d: the lu handle is no more valid.
ja_jp: 引数 %d で不正な値: lu ハンドルは適当ではありません。

source: subroutine not found: %s
ja_jp: サブルーチンが見つかりません: %s

source: time domain of argument %d is not defined.
ja_jp: 引数 %d の時間領域は、定義されていません。
