Repository: ScilabOrg/scilab
Catalog: scilab/modules/output_stream/locales/*.po
Languages: fr_fr, ja_jp

source: Undefined operation for the given operands.
fr_fr: Opération non définie pour les opérandes données.
ja_jp: 与えられたオペランドのための不確定の操作です。

source: check or define function %s for overloading.
fr_fr: Vérifier ou définir la fonction %s pour la surcharge.
ja_jp: 負荷をかけすぎる関数 %s 定義、または、チェックです。

source: %s: Wrong type for argument #%d: Matrix of handle expected.
fr_fr: %s : Type erroné de l'argument %d : Une matrice de handle attendue.

source: %s: Wrong type for argument #%d: Real or Complex matrix expected.
fr_fr: %s : Type erroné de l'argument n°%d : Une matrice réelle ou complexe attendue.

source: %s: Wrong size for argument #%d: (%d,%d) expected.
fr_fr: %s : Dimension erronée de l'argument %d : (%d,%d) attendu.

source: %s: Wrong size for argument #%d: %d expected.
fr_fr: %s : Dimension erronée de l'argument %d : %d attendu.

source: %s: Wrong type for argument #%d: Matrix of strings expected.
fr_fr: %s : Type erroné de l'argument %d : Une matrice de chaîne de caractères attendue.

source: %s: Wrong type for argument #%d: Boolean matrix expected.
fr_fr: %s : Type erroné de l'argument %d : Une matrice booléenne attendue.

source: %s: Wrong type for argument #%d: Matrix expected.
fr_fr: %s : Type erroné de l'argument %d : Une matrice attendue.

source: %s: Wrong type for argument #%d: List expected.
fr_fr: %s : Type erroné du paramètre %d : Une liste attendue.

source: %s: Wrong type for argument #%d: Function or string (external function) expected.
fr_fr: %s : Type erroné de l'argument %d : Une fonction ou chaîne de caractères (fonction externe) attendue.

source: %s: Wrong type for argument #%d: Polynomial matrix expected.
fr_fr: %s : Type erroné de l'argument %d : Une matrice polynomiale attendue.

source: %s: Wrong type for argument #%d: Working int matrix expected.
fr_fr: %s : Type erroné de l'argument n°%d : Une matrice de travail d'entiers attendue.

source: %s: Wrong type for argument #%d: Vector expected.
fr_fr: %s : Type erroné de l'argument %d : Un vecteur attendu.

source: %dth argument type must be boolean.
fr_fr: Le type du %dième argument doit être un booléen.
ja_jp: %d 番目の引数型は、ブーリアンでなくてはなりません。

source: Argument type must be boolean.
fr_fr: Le type d'argument doit être un booléen.
ja_jp: 引数型はブーリアンでなければなりません。

source: Wrong type for argument #%d: Boolean or scalar expected.
fr_fr: Type erroné de l'argument %d : Un booléen ou scalaire attendu.

source: Wrong type for argument #%d: Sparse matrix of scalars expected.
fr_fr: Type erroné de l'argument %d : Une matrice creuse de scalaires attendu.

source: Wrong type for argument #%d: Handle to sparse lu factors expected.
fr_fr: Type erroné de l'argument %d : Un handle vers des facteurs lu creux attendu.

source: Wrong type argument #%d: Sparse or full scalar matrix expected.
fr_fr: Type erroné de l'argument n°%d : Une matrice creuse ou une matrice de scalaires pleine attendue.

source: Null variable cannot be used here.
fr_fr: Une variable nulle ne peut pas être utilisée ici.
ja_jp: NULL 変数は、ここで使うことはできません。

source: A sparse matrix entry is defined with two different values.
fr_fr: Une entrée de matrice creuse est définie avec deux valeurs différentes.
ja_jp: 疎行列のエントリが2つの異なる値で定義されています.

source: %s not yet implemented for full input parameter.
fr_fr: %s pas encore implémenté pour les paramètres d'entrée pleins.
ja_jp: %s は全ての入力パラメータには未実装です.

source: It is not possible to redefine the %s primitive this way (see clearfun).
fr_fr: Il n'est pas possible de redéfinir la primitive %s de cette façon (voir clearfun).
ja_jp: %s プリミティブをこの方法で再定義することはできません (clearfun参照)

source: Type data base is full.
fr_fr: La base de données des types est pleine.
ja_jp: 型のデータベースはいっぱいです。

source: This data type is already defined.
fr_fr: Ce type de donnée est déjà défini.
ja_jp: このデータ型は、すでに定義されます。

source: Inequality comparison with empty matrix.
fr_fr: Comparaison de type inégalité avec une matrice vide.
ja_jp: 空行列と不等式比較しています.

source: Missing index.
fr_fr: Indice manquant.
ja_jp: インデックスが間違っています。

source: reference to the cleared global variable %s.
fr_fr: Référence à la variable globale effacée %s.
ja_jp: クリアされたグローバル変数 %s への参照です。

source: Operands of / and \ operations must not contain NaN of Inf.
fr_fr: Les opérandes /et \ ne doivent pas contenir NaN & Inf.

source: semi def fails.
fr_fr: Échec de semi def.
ja_jp: 中途半端な定義です。

source: Wrong type for first input argument: Single string expected.
fr_fr: Type erroné du premier argument d'entrée : Une chaîne de caractères attendue.
ja_jp: 入力引数で不正な型: 単一文字列を想定します。

source: Entry name not found.
fr_fr: Nom d'entrée non trouvé.
ja_jp: エントリ名が見つかりません.

source: Maximum number of dynamic interfaces reached.
fr_fr: Nombre maximum d'interfaces dynamiques atteint.
ja_jp: 動的なインターフェースの最大数です。

source: %s: expecting more than one argument.
fr_fr: %s : Attend plus d'un argument.
ja_jp: %s: ひとつ以上の引数を想定します。

source: %s: problem with one of the entry point.
fr_fr: %s : Problème avec un des points d'entrée.
ja_jp: %s: エントリ点の一つに問題があります.

source: %s: the shared archive was not loaded.
fr_fr: %s : La bibliothèque partagée n'a pas été chargée.
ja_jp: %s: 共有アーカイブは、ロードできませんでした。

source: %s: Only one entry point allowed on this operating system.
fr_fr: %s : Seulement un point d'entrée est autorisé sur ce système d'exploitation.
ja_jp: %s: このオペレーティング・システムでは単一の入力点のみが許されます。

source: %s: First argument cannot be a number.
fr_fr: %s : Le premier argument ne peut pas être un nombre.
ja_jp: %s: 最初の引数を数値にすることはできません.

source: You cannot link more functions, maxentry reached.
fr_fr: Impossible de lier plus de fonctions, maxentry atteint.
ja_jp: 多くの関数を関連づけることができません、最大入力に達しました。

source: File "%s" already exists or directory write access denied.
fr_fr: Le fichier "%s" existe déjà ou le répertoire n'est pas accessible en écriture.
ja_jp: ファイル "%s" はすでに存在します、または、ディレクトリー書き込みアクセスを拒否しました。

source: File "%s" does not exist or read access denied.
fr_fr: Le fichier "%s" n'existe pas ou n'est pas accessible en lecture.
ja_jp: ファイル "%s" が存在しないか、読み込みを拒否されました。

source: Binary direct access files must be opened by 'file'.
fr_fr: L'accès direct à un fichier binaire doit être ouvert par 'file'
ja_jp: バイナリーの直接アクセス・ファイルは、'file' で開かれなくてはいけません。

source: C file logical unit not allowed here.
fr_fr: L'unité logique de type fichier C n'est pas autorisé ici.
ja_jp: C ファイル・ロジカルユニットはここに許されませんでした。

source: Fortran file logical unit not allowed here.
fr_fr: L'unité logique de type Fortran n'est pas autorisée ici.
ja_jp: Fortran ファイル・ロジカルユニットはここに許されませんでした。

source: No input file associated to logical unit %d.
fr_fr: Aucun fichier d'entrée n'est associé à l'unité logique %d.
ja_jp: ロジカルユニット %d に関連した入力ファイルはありません。

source: check arguments or define function %s for overloading.
fr_fr: Vérifier les arguments ou définir la fonction %s pour la surcharge.
ja_jp: 引数を確認もしくはオーバーロード用の関数 %s を定義してください.

source: Function not defined for given argument type(s),
fr_fr: Fonction non définie pour le type d'argument donné,
ja_jp: 関数は与えられた引数型(s)の定義がされていません,

source: Wrong value for argument #%d: the lu handle is no more valid.
fr_fr: Valeur erronée de l'argument %d : Le handle lu n'est plus valide.

source: Wrong value for argument #%d: Valid variable name expected.
fr_fr: Valeur erronée de l'argument %d : Un nom de variable valide attendu.

source: Wrong value for argument #%d: Empty string expected.
fr_fr: Valeur erronée de l'argument %d : Une chaîne de caractères vide attendue.

source: Recursive extraction is not valid in this context.
fr_fr: L'extraction récursive n'est pas valide dans ce contexte.
ja_jp: 帰納的な抽出は、この前後関係で妥当ではありません。

source: %s: ipar dimensioned at least 11.
fr_fr: %s : ipar doit être de dimension au moins 11.
ja_jp: %s: ipar 次元は、最低でも 11 必要です。

source: %s: ltol must be of size ipar(4).
fr_fr: %s : ltol doit être de dimension ipar(4).
ja_jp: %s: ltol は、ipar(11)サイズでなければなりません。

source: %s: fixpnt must be of size ipar(11).
fr_fr: %s : fixpnt doit être de dimension ipar(11).
ja_jp: %s: fixpnt は、ipar(11)サイズでなければなりません。

source: %s: ncomp < 20 requested.
fr_fr: %s : ncomp < 20 demandé.
ja_jp: %s: ncomp < 20 を要求しました。

source: %s: m must be of size ncomp.
fr_fr: %s : m doit être de dimension ncomp.
ja_jp: %s: m は ncompサイズでなければなりません。

source: %s: sum(m) must be less than 40.
fr_fr: %s : sum(m) doit être inférieur à 40.
ja_jp: %s: sum(m) は 40 より小さくなくてはなりません。

source: %s: input data error.
fr_fr: %s : Erreur de données d'entrée.
ja_jp: %s: 入力データエラー

source: %s: no. of subintervals exceeds storage.
fr_fr: %s : no. de sous intervalles dépasse la capacité de stockage.
ja_jp: %s: 補助区間の数がメモリ制限を超えています.

source: %s: The colocation matrix is singular.
fr_fr: %s : La matrice de colocation est singulière.
ja_jp: %s: コロケーション行列は特異です。

source: Interface property table is full.
fr_fr: La table des propriétés d'interface est pleine.
ja_jp: インターフェース・プロパティ テーブルは一杯です。

source: Too many global variables! Max number is %d.
fr_fr: Trop de variables globales ! Le nombre maximum est %d.
ja_jp: 多すぎる全体変数です! 最大数は %d です。

source: Error while writing in file: disk full or deleted file.
fr_fr: Erreur à l'écriture dans le fichier : disque plein ou fichier supprimé.
ja_jp: ファイルの書き込み中にエラー: ディスクが一杯 か ファイルが削除されました。

source: Wrong value for argument #%d: Must not contain NaN or Inf.
fr_fr: Valeur erronée de l'argument %d : Ne doit pas contenir de NaN ou Inf.

source: %s and %s must have equal number of rows.
fr_fr: %s et %s doivent avoir le même nombre de lignes.
ja_jp: %s と %s の行の数は等しくしてください.

source: %s and %s must have equal number of columns.
fr_fr: %s et %s doivent avoir le même nombre de colonnes.
ja_jp: %s と %s の列の数は等しくしてください.

source: %s and %s must have equal dimensions.
fr_fr: %s et %s doivent avoir les mêmes dimensions.
ja_jp: %s と %s は、等しい次元を持っていなくてはいけません。

source: Invalid return value for function passed in arg %d.
fr_fr: Valeur de retour invalide pour la fonction passée en argument %d.
ja_jp: 引数 %d に渡された関数の戻り値が不正です.

source: Wrong value for argument #%d: eigenvalues must have negative real parts.
fr_fr: Valeur erronée de l'argument %d : Les valeurs propres doivent avoir une partie réelle négative.

source: Wrong value for argument #%d: eigenvalues modulus must be less than one.
fr_fr: Valeur erronée de l'argument %d : Le module des valeurs propres doit être inférieur à un.

source: Size varying argument a*eye(), (arg %d) not allowed here.
fr_fr: L'argument de taille variable a*eye(), (arg %d) n'est pas autorisé ici.
ja_jp: 引数の変えているサイズ *eye()、(引数 %d) は、ここで考慮されませんでした。

source: endfunction is missing.
fr_fr: endfunction est manquant.
ja_jp: 終了関数が間違っています。

source: Instruction left hand side: waiting for a dot or a left parenthesis.
fr_fr: Partie gauche de l'instruction : en attente d'un point ou d'une parenthèse ouvrante.
ja_jp: 左辺の命令: ドットまたは左括弧を入力してください.

source: Instruction left hand side: waiting for a name.
fr_fr: Partie de gauche de l'instruction : en attente d'un nom.
ja_jp: 左辺の命令: 名前を入力してください.

source: varargout keyword cannot be used here.
fr_fr: Le mot-clé varargout ne peut pas être utilisé ici.
ja_jp: 可変の入力引数キーワードはここで使うことはできません。

source: Missing operator, comma, or semicolon.
fr_fr: Opérateur, virgule ou point-virgule manquant.
ja_jp: オペレータ、カンマ、または、セミコロンの間違いです。

source: Too many commands defined.
fr_fr: Trop de commandes définies.
ja_jp: 命令の定義が多すぎます。

source: %s: Input arguments should have the same formal variable name.
fr_fr: %s : Les arguments d'entrée devraient avoir le même nom formel de variable.
ja_jp: %s: 入力引数は、同じ正式な変数名を持っているべきです。

source: Input arguments should have the same formal variable name.
fr_fr: Les arguments d'entrée doivent avoir le même nom de variable formelle.
ja_jp: %s: 入力引数は、同じ正式な変数名を持っているべきです。

source: %s: Wrong value for input argument #%d: Wrong value for element %s.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Valeur erronée de l'élément %s.

source: Unknown data.
fr_fr: Données inconnues.

source: Warning :
fr_fr: Attention :
ja_jp: 警告:

source: Non convergence in the QZ algorithm.
fr_fr: Non convergence de l'algorithme QZ.
ja_jp: QZの非集合アルゴリズム。

source: The top %d x %d blocks may not be in generalized Schur form.
fr_fr: Les %d x %d blocs supérieurs ne sont peut être pas de la forme de Schur généralisée.
ja_jp: 一番上の %d x %d ブロックは、Schurフォーム規則にないかもしれません。

source: Non convergence in QR steps.
fr_fr: Non convergence des itérations QR.
ja_jp: QRの非集合ステップ。

source: The top %d x %d block may not be in Schur form.
fr_fr: Les %d x %d blocs supérieurs ne sont peut être pas de la forme de Schur.
ja_jp: 一番上の %d x %d ブロックは、Schurフォームにないかもしれません。

source: The first %d singular values may be incorrect.
fr_fr: Les premières %d valeurs singulières sont peut-être erronées.
ja_jp: 最初の %d 単数値は、不正確かもしれません。

source: Warning: Result may be inaccurate.
fr_fr: Attention : Le résultat est peut être inexact.
ja_jp: 警告: 結果は不正確かもしれません。

source: matrix is close to singular or badly scaled. rcond = %s
fr_fr: La matrice est presque singulière ou mal conditionnée. rcond = %s
ja_jp: 行列は単数に近いです、または、最悪の比率です。 状態 = %s

source: computing least squares solution. (see lsq).
fr_fr: Calcul de la solution des moindres carrés (voir lsq).
ja_jp: 最小二乗法計算の解決方法(lsq参照)

source: eigenvectors are badly conditioned.
fr_fr: Les vecteurs propres sont mal conditionnés.
ja_jp: 固有ベクトルは最悪な状態です。

source: results may be inaccurate. rcond = %s
fr_fr: Les résultats sont peut être inexacts. rcond = %s
ja_jp: 結果は不正確かもしれません。状態 = %s

source: Warning: obsolete use of '=' instead of '=='.
fr_fr: Attention : Utilisation obsolète de '=' à la place de '=='.
ja_jp: 警告: '==' ではなく、 使われなくなった '=' が使われています。

source: Warning: obsolete use of eye, rand, or ones.
fr_fr: Attention : Utilisation obsolète de eye, rand, ou ones.
ja_jp: 警告: eye, rand, また ones は枯れた使い方です。

source: Rank deficient. rank = %d
fr_fr: Rang qui n'est pas plein. rang = %d
ja_jp: 不完全な Rank です。 rank = %d

source: Quapro encounters cycles on degenerate point.
fr_fr: Quapro a rencontré des cycles sur un point dégénéré.
ja_jp: Quaproは縮退点で周期に衝突します。

source: Norm of projected gradient lower than %s.
fr_fr: La norme du gradient projeté est inférieure à %s.
ja_jp: 投影勾配のノルムが %s 以下です。

source: at last iteration f decreases by less than %s.
fr_fr: Pendant la dernière itération, f a diminué de moins de %s.
ja_jp: 繰り返し最後の f %s以下で減少。

source: Optimization stops because too small variations for x.
fr_fr: L'optimisation s'est arrêtée à cause d'une trop petite variation de x.
ja_jp: x のとても小さい変化のため最適化を中断します。

source: Optim stops: maximum number of calls to f is reached.
fr_fr: Optim s'est arrêté : Le nombre maximum d'appels à f a été atteint.
ja_jp: 最適化の中断: f への呼び出しの最大数に達しました。

source: Optim stops: maximum number of iterations is reached.
fr_fr: Optim s'est arrêté : Le nombre maximum d'itérations a été atteint.
ja_jp: 最適化の中断: 繰り返しの最大数に達しました。

source: Optim stops: too small variations in gradient direction.
fr_fr: Optim s'est arrêté : Les variations de direction du gradient sont trop petites.
ja_jp: 最適化の中断: 勾配方向のとても小さい変化です。

source: Stop during calculation of descent direction.
fr_fr: Arrêt pendant le calcul de la direction de descente.
ja_jp: 下り方向の計算中に停止しました。

source: Stop during calculation of estimated hessian.
fr_fr: Arrêt pendant le calcul de l'estimation du hessien.
ja_jp: ヘッセ推定の計算中に停止しました。

source: End of optimization.
fr_fr: Fin de l'optimisation.
ja_jp: 最適化を終了

source: End of optimization (linear search fails).
fr_fr: Fin de l'optimisation (échec de la recherche linéaire).
ja_jp: 最適化を終了 (線形探索に失敗).

source: sfact : uncomplete convergence relative precision reached : 10**(%s).
fr_fr: sfact : convergence incomplète. Précision relative atteinte : 10**(%s).
ja_jp: 事実 : 不完全な収束相対精度に達しました: 10**(%s)

source: Help file inconsistent...
fr_fr: Fichier d'aide incohérent...
ja_jp: 一貫性がないヘルプファイルです...

source: Functions files location : %s.
fr_fr: Emplacement des fichiers de fonctions : %s.
ja_jp: 関数ファイルの場所 : %s

source: Pause mode: enter empty lines to continue.
fr_fr: Mode pause : Entrez des lignes vides pour continuer.
ja_jp: 休止モード: エンターキーで実行を続けます。

source: Breakpoints of function : %s
fr_fr: Point d'arrêt de la fonction : %s
ja_jp: 関数のブレーク・ポイント : %s

source: Warning: recursion problem..., cleared.
fr_fr: Attention : Problème de récurrence...
ja_jp: 警告: 回帰問題..., クリアしました。

source: Warning: stack problem..., cleared.
fr_fr: Attention : Problème avec la pile...
ja_jp: 警告: スタック問題..., クリアしました。

source: Stop after row %s in function %s.
fr_fr: Arrêt après la ligne %s dans la fonction %s.
ja_jp: 関数 %s の列 %s の後で停止

source: The identifier : %s
fr_fr: L'identifiant : %s
ja_jp: 身元: %s

source: has been truncated to: %s.
fr_fr: a été tronqué en : %s.
ja_jp: は %s に丸められました.

source: Real part
fr_fr: Partie réelle
ja_jp: 実の部分

source: Imaginary part
fr_fr: Partie imaginaire
ja_jp: 虚部

source: Maximum size of buffer : %d characters.
fr_fr: Taille maximum de la mémoire tampon : %d caractères.
ja_jp: バッファの最大サイズ : %d 文字

source: Rank deficient : rank = %s - tol = %s .
fr_fr: Défaillance du rang : rang = %s - tol = %s.
ja_jp: 不完全なランク : rank = %s - tol = %s .

source: Your variables are:
fr_fr: Vos variables sont :
ja_jp: 変数です:

source: Using %s elements out of %s.
fr_fr: Utilisation de %s éléments parmi %s.
ja_jp: %2$s を超えた要素 %1$s を使います。

source: and %s variables out of %s.
fr_fr: et %s variables parmi %s.
ja_jp: %s 個の変数 (全体: %s)

source: System functions:
fr_fr: Fonctions système :
ja_jp: システム関数:

source: Commands:
fr_fr: Commandes :
ja_jp: コマンド:

source: Warning : redefining function: %s. Use funcprot(0) to avoid this message
fr_fr: Attention : Redéfinition de la fonction : %s. Utilisez funcprot(0) pour ne pas afficher ce message.
ja_jp: 警告: 関数の再定義です: %s, funcprot(０)を使ってこのメッセージを避けて下さい

source: inside function: %s.
fr_fr: dans la fonction : %s.
ja_jp: 内部関数: %s

source: Not enough memory to perform simplification.
fr_fr: Mémoire insuffisante pour effectuer la simplification.
ja_jp: 単純化を実行するのに十分なメモリがありません。

source: Your global variables are...
fr_fr: Vos variables globales sont...
ja_jp: 全体変数です...

source: %s: Loop on two orders detected.
fr_fr: %s : Boucle détectée sur deux niveaux.
ja_jp: %s: 2つの次数でのループを検出しました.

source: %s: Impossible to reach required order. previous order computed solution returned.
fr_fr: %s : Impossible d'atteindre l'ordre demandé. La solution calculée de l'ordre précédent est retournée.
ja_jp: %s: 必要な次数に達することができません. 前の次数の計算結果を返します.

source: %s: Failure when looking for the intersection with domains boundaries. previous order computed solution returned.
fr_fr: %s : problème pendant la recherche de l'intersection avec les bornes du domaine. La solution calculée de l'ordre précédent est retournée.
ja_jp: %s: 領域の境界の交差する部分を参照した時にエラーが発生しました. 前の次数の計算結果を返します.

source: %s: Too many solutions found. previous order computed solution returned.
fr_fr: %s : Trop de solutions trouvées. La solution calculée de l'ordre précédent est retournée.
ja_jp: %s: みつかった解の数が多すぎます. 前の次数の解を返します.

source: Warning: loaded file has been created with a previous version of Scilab or you are trying to load a file saved on a different architecture.
fr_fr: Attention : Le fichier chargé a été créé avec une version précédente de Scilab ou alors vous essayez de charger un fichier enregistré sur une architecture différente.
ja_jp: 警告: ロードされたファイルは、Scilabの前のバージョンで作られました 異なるアーキテクチャーでファイル保存を試みてください。

source: Warning:
fr_fr: Attention :
ja_jp: 警告:

source: Impossible to load variable %s.
fr_fr: Impossible de charger la variable %s.
ja_jp: 変数 %s をロードすることができません。

source: Warning: Use of standard list to define typed structures is obsolete. Use tlist.
fr_fr: Attention : L'utilisation d'une liste standard pour définir des structures typées est obsolète. Utilisez tlist à la place.
ja_jp: 警告: 構造定義型への標準リスト使用はサポートされません、 tlist を使ってください。

source: Warning : division by zero...
fr_fr: Attention : division par zéro...
ja_jp: 警告: ゼロ割り...

source: Warning : singularity of 'log' or 'tan' function.
fr_fr: Attention : Singularité de la fonction 'log' ou 'tan'.
ja_jp: 警告: 'log' または 'tan' 関数が奇妙です。

source: At time: %s. Too many iteration to achieve required precision.
fr_fr: Au temps : %s. Trop d'itération pour réaliser la précision requise.
ja_jp: 発生時刻: %s. 指定した精度を実現するために規定の反復階数を超えました.

source: stepsize not significant in rkqc.
fr_fr: stepsize n'est pas suffisamment important dans rkqc.
ja_jp: rkq で重要ではないステップ・サイズ。

source: Warning: variable %%ODEOPTIONS not found.
fr_fr: Attention : La variable %%ODEOPTIONS n'a pas été trouvée.
ja_jp: 警告: 変数 %%ODEOPTIONS は見つけられませんでした。

source: Warning: integration up to tcrit.
fr_fr: Attention : Intégration jusqu'à tcrit.
ja_jp: 警告: tcrit まで統合

source: Warning: integration not completed! Check tolerance parameters or step size.
fr_fr: Attention : Intégration inachevée ! Vérifiez les paramètres de tolérance ou la taille du pas.
ja_jp: 警告: 統合は完成しませんでした! 許容パラメーターまたはステップ・サイズを調べて下さい。

source: Warning: Jacobian external is given, but not used! See %ODEOPTIONS(6).
fr_fr: Attention : Un Jacobian externe est donné, mais non utilisé ! Voir %ODEOPTIONS(6).
ja_jp: 警告: ヤコビアン外観を与えます、しかし 使われません! %ODEOPTIONS(6) を見てください。

source: Warning: No Jacobian external given but one is required by %ODEOPTIONS(6) value !
fr_fr: Attention : Pas de Jacobien externe donné mais un est requis par %ODEOPTIONS(6) !
ja_jp: 警告: 外部の与えられたヤコビアンはありません、 しかし、ひとつは、%ODEOPTIONS(６)値によって必要とされます!

source: itask=2,3 or 5: At most one value of t is allowed, the last element of t is used.
fr_fr: itask=2,3 ou 5: Au moins une valeur de t est autorisée, le dernier élément de t est utilisé.
ja_jp: itask=2,3 または 5: 最大ひとつの t 値が許され、 最後の要素 t は使われます。

source: Warning: odedc forces itask=4 and handles tcrit.
fr_fr: Attention : odedc impose itask=4 et gère tcrit.
ja_jp: 警告: 離散効力 itask=4 と ハンドル 信頼区間(tcrit).

source: Warning: function is already compiled.
fr_fr: Attention : La fonction est déjà compilée.
ja_jp: 警告: 関数は既にコンパイルされています。

source: %s: termination for lack of space to divide triangle.
fr_fr: %s : Fin pour cause de manque d'espace pour le découpage du triangle.
ja_jp: %s: 三角形分割時のメモリ不足のために終了しました.

source: %s: termination because of roundoff noise.
fr_fr: %s : Fin pour cause de bruit d'arrondi.
ja_jp: %s: 端数切捨ての影響で終了しました。

source: %s: termination for relative error < (5.0*%eps).
fr_fr: %s : Fin pour cause d'erreur relative < (5.0*%eps).
ja_jp: %s: 相対誤差 < (5.0*%eps) のため終了

source: %s: termination: function evaluations > MEVALS.
fr_fr: %s : Fin pour cause de nombre d'évaluation de la fonction > MEVALS.
ja_jp: %s: 終了: 関数評価 > MEVALS

source: %s: maxpts was too small to obtain the required accuracy.
fr_fr: %s : maxpts était trop petit pour obtenir la précision demandée.
ja_jp: %s: maxptsは、行われるには、あまりにも小さいです、正確にしてください。

source: Too many input/output ports for highlighted block.
fr_fr: Trop de ports d'entrée-sortie pour le bloc accentué
ja_jp: 強調されたブロックの多すぎる入出力ポートです。

source: Too many input/output entries for highlighted block.
fr_fr: Trop d'entrées d'entrée-sortie pour le bloc accentué.
ja_jp: 強調されたブロックの多すぎる入出力参加です。

source: Undefined display for this data type.
fr_fr: Affichage non défini pour ce type de données.
ja_jp: このデータ型は表示することが出来ません。

source: Warning: primitive function %s has moved.
fr_fr: Attention : La fonction primitive %s a été déplacée.
ja_jp: 警告: 最初の関数 %s は動きました。

source: Rebuild your function libraries.
fr_fr: Régénérez vos bibliothèques de fonctions.
ja_jp: 関数ライブラリを再構築してください。

source: Warning: primitive function %s is now a Scilab function.
fr_fr: Attention : La fonction primitive %s est maintenant une fonction Scilab.
ja_jp: 警告: 初期関数 %s は新しい Scilab 関数です。

source: Roundoff errors make leading eigenvalues in the Schur form no longer satisfy criterion.
fr_fr: Les erreurs d'arrondi font que les premières valeurs propres de la forme de Schur ne satisfont plus le critère.
ja_jp: 主要な固有値の作成で端数切捨てエラー Schurフォームで、もはや基準ではありません。

source: Formal variable name has been truncated.
fr_fr: Le nom de la variable formelle a été tronqué.
ja_jp: 形式上の変数名が丸められました.
