Repository: ScilabOrg/scilab
Catalog: scilab/modules/scicos/locales/*.po
Languages: fr_fr

source: IDA_ILL_INPUT: One of the input arguments was illegal. This errors message may be returned if the linear solver function initialization (called by the user after calling IDACreate) failed to set the linear solver-specific lsolve field in ida_mem.
fr_fr: IDA_ILL_INPUT: Un des arguments d'entrée était illégal. Ces messages d'erreur peuvent être retournés si la fonction d'initialisation du solveur linéaire (appelé par l'utilisateur après l'appel de IDACreate) a échoué lors de l'affectation du champ du solveur linéaire spécifique lpsolve dans ida_mem.

source: IDA_LINESEARCH_FAIL: The Linesearch algorithm failed to find a solution with a step larger than steptol in weighted RMS norm.
fr_fr: IDA_LINESEARCH_FAIL: L'algorithme de recherche linéaire n'a pas réussi à trouver une solution avec un pas plus grand que steptol en norme RMS pondérée.

source: IDA_LINIT_FAIL: The linear solver''s initialization routine failed.
fr_fr: IDA_LINIT_FAIL: La routine d'initialisation du solveur linéaire a échoué.

source: IDA_LSETUP_FAIL: The linear solver''s setup routine had a non-recoverable error.
fr_fr: IDA_LSETUP_FAIL: La routine de réglage du solveur linéaire a émis une erreur irrécupérable.

source: IDA_LSOLVE_FAIL: The linear solver''s solve routine had a non-recoverable error.
fr_fr: IDA_LSOLVE_FAIL: La routine de résolution du solveur linéaire a émis une erreur irrécupérable.

source: IDA_LSOLVE_NULL: The linear solver''s solve routine is NULL.
fr_fr: IDA_LSOLVE_NULL: La routine de résolution du solveur linéaire est NULL.

source: IDA_MEM_FAIL: A memory allocation failed.
fr_fr: IDA_MEM_FAIL: Une allocation mémoire a échoué.

source: IDA_MEM_NULL:The argument ida_mem was NULL
fr_fr: IDA_MEM_NULL:L'argument ida_mem était NULL

source: IDA_MISSING_ID :id = NULL (''id'' defines algebraic and differential states) but suppressalg option on.
fr_fr: IDA_MISSING_ID :id = NULL (''id'' définissent les états agébriques et différentiels) mais l'option suppressalg est on.

source: IDA_NO_EFUN: itol = IDA_WF but no EwtSet function was provided.
fr_fr: IDA_NO_EFUN: itol = IDA_WF mais aucune fonction EwtSet n'a été fournie.

source: IDA_NO_ESTOP: itask = IDA_NORMAL_TSTOP or itask = IDA_ONE_STEP_TSTOP but tstop was not set
fr_fr: IDA_NO_ESTOP: itask = IDA_NORMAL_TSTOP ou itask = IDA_ONE_STEP_TSTOP mais tstop n'a pas été réglé

source: IDA_NO_MALLOC: indicating that ida_mem was not allocated.
fr_fr: IDA_NO_MALLOC: indique que ida_mem n'a pas été alloué.

source: IDA_NO_RECOVERY: The user''s residual routine, or the linear solver''s setup or solve routine had a recoverable error, but IDACalcIC was unable to recover.
fr_fr: IDA_NO_RECOVERY: La routine utilisateur résidu, ou la fonction de réglage du solveur linéaire ou la routine de résolution ont eu une erreur récupérable, mais IDACalcIC n'a pas été capable de récupérer.

source: IDA_NULL_ABSTOL: absolute tolerances is = NULL illegal.
fr_fr: IDA_NULL_ABSTOL: la tolérance absolue est = NULL illégal.

source: IDA_NULL_F: user supplied ODE routine is (NULL) illegal.
fr_fr: IDA_NULL_F: la routine utilisateur ODE est (NULL) illégal.

source: IDA_NULL_G: user supplied zero-crossing routine is (NULL) illegal.
fr_fr: IDA_NULL_G: la routine utilisateur de zero-crossing est (NULL) illégal.

source: IDA_NULL_Y0: y0 = NULL illegal.
fr_fr: IDA_NULL_Y0: y0 = NULL illégal.

source: IDA_REP_RES_ERR: The user''s residual function repeatedly returned a recoverable error flag, but the solver was unable to recover.
fr_fr: IDA_REP_RES_ERR: la routine utilisateur résidu a retourné de façon répétée une erreur récupérable, mais le solveur n'a pas été capable de récupérer.

source: IDA_RES_FAIL: The user''s residual routine returned a non-recoverable error flag.
fr_fr: IDA_RES_FAIL: La routine utilisateur résidu a retournée une erreur irrécupérable.

source: IDA_RES_NULL: the returned residual res = NULL is illegal.
fr_fr: IDA_RES_NULL: le résidu retourné res = NULL est illégal.

source: IDA_RTFUNC_FAIL: The root founding function failed.
fr_fr: IDA_RTFUNC_FAIL: La fonction de recherche de racine a échoué.

source: IDA_Residual_NAN: The residual function returns NAN.
fr_fr: IDA_Residual_NAN: la fonction résidu a retourné NAN.

source: IDA_Rootfunction_NAN: The Root function returns NAN.
fr_fr: IDA_Rootfunction_NAN: la fonction racine a retournée NAN.

source: IDA_TOO_CLOSE: ''tout'' too close to ''t0'' to start integration.
fr_fr: IDA_TOO_CLOSE: ''tout'' trop proche de ''t0'' pour démarrer l'intégration.

source: IDA_TOO_MUCH_ACC: The solver could not satisfy the accuracy demanded by the user for some internal step.
fr_fr: IDA_TOO_MUCH_ACC: Le solveur n'a pas pu satisfaire la précision demandée par l'utilisateur pour certains pas internes.

source: IDA_TOO_MUCH_WORK: The solver took mxstep internal steps but could not reach tout. The default value for mxstep is MXSTEP_DEFAULT = 500.
fr_fr: IDA_TOO_MUCH_WORK: Le solveur a pris mxstep pas internes mais n'a pas pu atteindre tout. La valeur par défaut de mxstep est MXSTEP_DEFAULT = 500.

source: IDA_TRET_NULL: ''tret'' = NULL illegal.
fr_fr: IDA_TRET_NULL: ''tret'' = NULL illégal.

source: IDA_Y0_FAIL_CONSTR: y0 fails to satisfy constraints.
fr_fr: IDA_Y0_FAIL_CONSTR: y0 a échoué à satisfaire les contraintes.

source: IDA_YOUT_NULL: ''yout'' = NULL illegal.
fr_fr: IDA_YOUT_NULL: ''yout'' = NULL illégal.

source: IDA_YP0_NULL: the derivative yp0 = NULL is illegal.
fr_fr: IDA_YP0_NULL: la dérivée yp0 = NULL est illégal.

source: IDA_YPRET_NULL: yret = NULL illegal..
fr_fr: IDA_YPRET_NULL: yret = NULL illégal..

source: IDA_YRET_NULL: yret = NULL illegal..
fr_fr: IDA_YRET_NULL: yret = NULL illégal..

source: KIN_FIRST_SYSFUNC_ERR: The system function failed at the first call. Please verify your model. There might be an error in the computing function, for example a function may be called with illegal inputs.
fr_fr: KIN_FIRST_SYSFUNC_ERR: La fonction système a échoué au premier appel. Vérifier votre modèle SVPl. Il y a peut être une erreur dans la fonction de calcul, par exemple une fonction peut avoir été appelée avec des entrées illégales.

source: KIN_ILL_INPUT: A supplied parameter is invalid (check error message).
fr_fr: KIN_ILL_INPUT: Un paramètre fourni est invalide (vérifiez le message d'erreur).

source: KIN_LINESEARCH_BCFAI: The line search algorithm (implemented in KINLineSearch) was unable to satisfy the beta-condition for MXNBCF + 1 nonlinear iterations (not necessarily consecutive), which may indicate the algorithm is making poor progress
fr_fr: KIN_LINESEARCH_BCFAI: L'algorithme de recherche linéaire (implémenté dans KINLineSearch) n'a pas été capable de satisfaire la condition béta pour MXNBCF + 1 itérations non linéaires (pas nécessairement consécutivess), ce qui peut indiquer que l'algorithme progresse lentement

source: KIN_LINESEARCH_NONCONV: The line-search algorithm was unable to find an iterate sufficiently distinct from the current iterate failure to satisfy the sufficient decrease condition could mean the current iterate is close to an approximate solution of the given nonlinear system, the finite-difference approximation of the matrix-vector product J(u)*v is inaccurate, or the real scalar scsteptol is too large
fr_fr: KIN_LINESEARCH_NONCONV: L'algorithme de recherche linéaire n'a pas été capable de trouver un intéré suffisamment distinct de l'itéré courant.. Cet échec à satisfaire la condition de décroissance peut vouloir dire que l'itéré courant est proche d'une solution approximée du système non linéaire donné. L'approximation obtenue par différences finies du produit vecteur matrix J(u)*v est imprécise, ou le scalaire réel scsteptol est trop grand

source: KIN_LINIT_FAIL: The linear solver initialization routine (linit) encountered an error.
fr_fr: KIN_LINIT_FAIL: La routine d'initialisation du solveur linéaire (linit) a rencontré une erreur.

source: KIN_LINSOLV_NO_RECOVERY: The user-supplied routine psolve encountered a recoverable error, but the preconditioner is already current
fr_fr: KIN_LINSOLV_NO_RECOVERY: La routine utilisateur psolve a rencontré une erreur récupérable, mais le préconditionneur est déjà courant

source: KIN_LSETUP_FAIL: The user-supplied routine pset (used to compute the preconditioner) encountered an unrecoverable error .
fr_fr: KIN_LSETUP_FAIL: La routine utilisateur pset (utilisée pour calculer le préconditionneur) a rencontré une erreur irrécupérable.

source: KIN_LSOLVE_FAIL: Either the user-supplied routine psolve (used to solve the preconditioned linear system) encountered an unrecoverable error, or the linear solver routine (lsolve) encountered an error condition.
fr_fr: KIN_LSOLVE_FAIL: Soit la routine utilisateur psolve (utilisée pour résoudre le système linéaire préconditionné) a rencontré une erreur irrécupérable, soit la routine du solveur linéaire (lsolve) a rencontré une condition d'erreur.

source: KIN_MAXITER_REACHED: The maximum number of nonlinear iterations has been reached
fr_fr: KIN_MAXITER_REACHED: Le nombre maximum d'itération non linéaire a été atteint

source: KIN_MEM_FAIL: An error occurred during memory allocation (either insufficient system resources are available or the vector kernel has not yet been initialized
fr_fr: KIN_MEM_FAIL: Une erreur est apparue lors de l'allocation mémoire (soit les ressources système ne sont pas suffisantes, soit le vecteur noyau n'a pas été initialisé

source: KIN_MEM_NULL: An error in the memory allocation in KINCreate or KINMalloc.
fr_fr: KIN_MEM_NULL: Une erreur dans l'allocation mémoire dans KINCreate ou KINMalloc.

source: KIN_MXNEWT_5X_EXCEEDE: Five consecutive steps have been taken that satisfy the following inequality: ||uscale*p||_L2 > 0.99*mxnewtstep where p denotes the current step and mxnewtstep is a real scalar upper bound on the scaled step length such a failure may mean ||fscale*func(u)||_L2 asymptotes from above to a finite value, or the real scalar mxnewtstep is too small
fr_fr: KIN_MXNEWT_5X_EXCEEDE: Cinq pas consécutifs ont été pris qui satisfont l'inégalité suivante: ||uscale*p||_L2 > 0.99*mxnewtstep où p correspond au pas courant et mxnewtstep est une borne supérieure réelle sur la longueur de pas mis à l'échelle. Un tel échec peut vouloir dire ||fscale*func(u)||_L2 est une asymptotes à partir du dessus d'une valeur finie, ou le scalaire réel mxnewtstep est trop petit

source: KIN_NAN_ERR: The residual function returns NAN. Please verify your model: some functions might be called with illegal inputs.
fr_fr: KIN_NAN_ERR: La fonction résiduelle retourne NAN. Vérifiez votre modèle SVP: des fonctions peuvent avoir été appelées avec des valeurs d'entrées illégales.

source: KIN_NO_MALLOC: Additional system memory has not yet been allocated for vector storage (forgot to call the KINMalloc routine)
fr_fr: KIN_NO_MALLOC: La mémoire système additionnelle n'a pas encore été allouée pour le stockage du vecteur (oublie d'appeler la routine KINMalloc)

source: KIN_REPTD_SYSFUNC_ERR: The system function failed repeatedly. Please verify your model. There might be an error in the computing function, for example a function may be called with illegal inputs
fr_fr: KIN_REPTD_SYSFUNC_ERR: La fonction système a échoué de façon répétitive. Vérifiez votre modèle SVP. Il peut y avoir une erreur dans la fonction de calcul, par exemple, une fonction peut avoir été appelée avec des entrées illégales

source: KIN_SYSFUNC_FAIL: Error in the computing function. Please verify your model.
fr_fr: KIN_SYSFUNC_FAIL: Erreur dans la fonction de calcul. Vérifier votre modèle SVP.

source: Leaving block %d
fr_fr: Laisser le bloc %d

source: Slider t=%10.3f, flag=%d
fr_fr: Curseur t=%10.3f, drapeau=%d

source: The number of parameter provided by Scicos blocks is different from what expected by the code generated by the Modelica compiler. You might have relaxed a parameter using FIXED property (i.e., fixed=false) in a Modelica model. This will be corrected in the next version
fr_fr: Le nombre de paramètres fournis par les blocks Scicos est différent de ce qui est attendu par le code généré par le compilateur Modelica. Vous avez peut être relaché un paramètre en utilisant la propriété FIXED (i.e., fixed=false) dans un modèle Modelical. Ceci sera corrigée dans une prochaine version

source: Undefined Function type
fr_fr: Type de fonction non défini

source: Undefined data type.
fr_fr: Type de données non défini.

source: Usage : [myvar]=getscicosvars(["str1";"str2";...]);
fr_fr: Utilisation : [myvar]=getscicosvars([« str1 » ; « str2 » ; …]);

source: You have changed a parameter in your model, but the model has been compiled to use an XML file containing initial values and parameters. So you should either recompile your Scicos diagram or [re]launch the initialization interface to regenerate the XML file with new parameters.
fr_fr: Vous avez changé un paramètre dans votre modèle, mais le modèle a été compilé pour employer un fichier XML contenant des valeurs initiales et des paramètres. Ainsi vous devriez soit recompiler votre diagramme Scicos soit [re]lancer l'interface d'initialisation pour régénérer le fichier XML avec de nouveaux paramètres.

source: algebraic loop detected
fr_fr: Boucle algébrique détectée

source: at time %f
fr_fr: au temps %f

source: block %d is called
fr_fr: le bloc %d est appelé

source: block produces an internal error
fr_fr: le bloc produit une erreur interne

source: cannot allocate memory
fr_fr: impossible d'allouer la mémoire

source: cannot allocate memory in block=%d
fr_fr: impossible d'allouer la mémoire dans le block=%d

source: event conflict
fr_fr: conflit d'événement

source: initial conditions not converging
fr_fr: les conditions initiales ne convergent pas

source: input to zero-crossing stuck on zero
fr_fr: entrée au passage à zéro coincée sur zéro

source: integration problem istate=%d
fr_fr: Problème d'intégration istate=%d

source: mode of block %d=%d,
fr_fr: mode du bloc %d=%d,

source: root found at t=: %f
fr_fr: racine trouvée à t=: %f

source: scheduling problem
fr_fr: problème d'ordonnancement

source: scicos unexpected error, please report...
fr_fr: Erreur inattendue Scicos, rapportez le bug SVP...

source: singularity in a block
fr_fr: singularité dans un bloc

source: sliding mode condition, cannot integrate
fr_fr: condition de mode glissant, ne peut pas intégrer

source: the block %d has been called with input out of its domain
fr_fr: le block %d a été appelé avec des entrées hors de son domaine

source: type 1 function not allowed for scilab blocks
fr_fr: fonction de type 1 non permise pour des des blocs de scilab

source: type 2 function not allowed for scilab blocks
fr_fr: fonction de type 2 non permise pour des des blocs de scilab

source: unknown or erroneous block
fr_fr: bloc inconnu ou incorrect

source: with flag %d
fr_fr: avec le drapeau %d
