Repository: ScilabOrg/scilab
Catalog: scilab/modules/scicos/locales/*.po
Languages: fr_fr

source: (already programmed) event. There may be an error in
fr_fr: événement (déjà programmé). Il peut y a une erreur dans

source: your model. Please check your model
fr_fr: votre modèle. Veuillez vérifier votre modèle

source: The residual function returns NAN/Inf. Please verify your model: some functions might be called with illegal inputs.
fr_fr: La fonction résiduelle renvoie NaN/Inf. Veuillez vérifier votre modèle : quelques fonctions pourraient être appelées avec des valeurs d'entrée illégales.

source: Warning: an event is reprogrammed at t=%g by removing another
fr_fr: Attention: un évènement est reprogrammé à t=%g par la suppression d'un autre

source: error in Jacobian
fr_fr: erreur dans le Jacobien

source: MEMORY_ERROR: %s() failed - returned NULL pointer
fr_fr: MEMORY_ERROR : %s () a échoué - le pointeur NULL a été retourné

source: SUNDIALS_ERROR: %s() failed - returned NULL pointer
fr_fr: SUNDIALS_ERROR : %s () a échoué - le pointeur NULL a été retourné

source: SUNDIALS_ERROR: %s() failed with flag = %d
fr_fr: SUNDIALS_ERROR : %s () a échoué avec le drapeau = %d

source: Warning: The computing function #%d returns a NaN/Inf
fr_fr: Avertissement : La fonction de calcul #%d renvoie NaN/Inf

source: Warning: The initialization system #%d returns a NaN/Inf
fr_fr: Avertissement : Le système d'initialisation #%d renvoie un NaN/Inf

source: Warning: The residual function #%d returns a NaN/Inf
fr_fr: Attention: La fonction résidu n° %d retourne un NaN/Inf

source: Warning: The zero-crossing function #%d returns a NaN
fr_fr: Avertissement : La fonction passant par zéro #%d renvoie un NaN

source: Warning: The zero_crossing function #%d returns a NaN/Inf
fr_fr: Attention: La fonction zero_crossing n° %d retourne un NaN/Inf

source: getscicosvars : utility function to retrieve
fr_fr: getscicosvars : fonction utilitaire pour récupérer

source: scicos arrays during simulation.
fr_fr: tableaux scicos pendant la simulation

source: that must be informed with the following values :
fr_fr: qui doit être informée avec la valeurs suivantes:

source: %s : Allocation error.
fr_fr: %s : Erreur d'allocation.

source: %s : Bad size for Rhs(1).
fr_fr: %s : Mauvaise dimension pour Rhs(1).

source: %s : Bad size for Rhs(2).
fr_fr: %s : Mauvaise dimension pour Rhs(2).

source: %s : Error.
fr_fr: %s : Erreur.

source: %s : First argument must be a Typed list.
fr_fr: %s : Le premier argument doit être une liste typée.

source: %s : First argument must be a matrix or an hypermatrix of real, complex or integer numbers.
fr_fr: %s : Le premier argument doit être une matrice ou une hypermatrice de réels, complexes ou de nombres entiers.

source: %s : First argument must be a scicos model.
fr_fr: %s : Le premier argument doit être un modèle scicos.

source: %s : First argument must be a scicos signal structure.
fr_fr: %s : Le premier argument doit être une structure scicos signal.

source: %s : First argument must be a scicos_block typed list.
fr_fr: %s : Le premier argument doit être une liste typée scicos_block.

source: %s : First argument must be a string.
fr_fr: %s : Le premier argument doit être une chaîne de caractères.

source: %s : First argument must be a structure.
fr_fr: %s : Le premier argument doit être une structure.

source: %s : First argument must be a valid scicos_block typed list.
fr_fr: %s : Le premier argument doit être une liste typée scicos_block valide.

source: %s : Fourth argument must be a Tlist.
fr_fr: %s : Le quatrième argument doit être une Tlist.

source: %s : Function not found
fr_fr: %s : Fonction non trouvée

source: %s : Incompatible sim.nb RHS parameter.
fr_fr: %s : Paramètre RHS sim.nb incompatible.

source: %s : No more free memory.
fr_fr: %s : Plus de mémoire disponible.

source: %s : No more memory.
fr_fr: %s : Pas assez de mémoire.

source: %s : Only hypermatrix with 3 dimensions is allowed.
fr_fr: %s : Seules les hypermatrices à 3 dimensions sont autorisées.

source: %s : Second argument must be a real.
fr_fr: %s : Le second argument doit être un réel.

source: %s : Second argument must be a scalar.
fr_fr: %s : Le deuxième argument doit être une grandeur scalaire.

source: %s : Second argument must be scalar.
fr_fr: %s : Le second argument doit être un scalaire.

source: %s : Second element of sim must be a list.
fr_fr: %s : Le second élément de sim doit être une liste.

source: %s : Sixth argument must have a maximum of seven elements.
fr_fr: %s : Le sixième élément doit avoir un maximum de sept éléments.

source: %s : Sixth argument must have at least four elements.
fr_fr: %s : Le sixième argument doit avoir au moins quatre élémens.

source: %s : Third argument must be a scalar.
fr_fr: %s : Le troisième élément doit être un scalaire.

source: %s : Third argument must be scalar.
fr_fr: %s : Le troisième argument doit être scalaire.

source: %s : Undefined Function type
fr_fr: %s : Type de fonction non défini

source: %s : Undefined field in string matrix position : %d.
fr_fr: %s : Champ non défini à la position %d dans la matrice de chaînes de caractères.

source: %s : Undetermined Size. in(%d)=%d. Please adjust your model.
fr_fr: %s : Dimension non déterminée. in(%d)=%d. Ajuster votre modèle SVP.

source: %s : Undetermined Size. in2(%d)=%d. Please adjust your model.
fr_fr: %s : Dimension non déterminée. in2(%d)=%d. Ajuster votre modèle SVP.

source: %s : Undetermined Size. out(%d)=%d. Please adjust your model.
fr_fr: %s : Dimension non déterminée. out(%d)=%d. Ajuster votre modèle SVP.

source: %s : Undetermined Size. out2(%d)=%d. Please adjust your model.
fr_fr: %s : Dimension non déterminée. out2(%d)=%d. Ajuster votre modèle SVP.

source: %s : Undetermined Type. intyp(%d)=%d. Please adjust your model.
fr_fr: %s : Type non déterminé. intyp(%d)=%d. Ajuster votre modèle SVP.

source: %s : Undetermined Type. outtyp(%d)=%d. Please adjust your model.
fr_fr: %s : Type non déterminé. outtyp(%d)=%d. Ajuster votre mmodèle SVP.

source: %s : bad dimension for lnksz argument.
fr_fr: %s : mauvaise dimension pour l'argument lnksz.

source: %s : bad dimension for lnktyp argument.
fr_fr: %s : mauvaise dimension pour l'argument lnktyp.

source: %s : error
fr_fr: %s : erreur

source: %s : error in cross variable size checking : %d
fr_fr: %s : erreur dans la vérification croisée des dimensions des variables: %d

source: %s : error. Type %d not yet supported for outtb.
fr_fr: %s : erreur. Le type %d n'est pas encore supporté pour outtb.

source: %s : error. Type %d of double scalar matrix not yet supported for outtb.
fr_fr: %s : erreur. Le type %d de la matrice de double scalaire n'est pas encore supporté pour outtb.

source: %s : error. Type %d of int scalar matrix not yet supported for outtb.
fr_fr: %s : erreur. Le type %d de la matrice d'entier scalaire n'est pas encore supporté pour outtb.

source: %s : inconsistent dimension between lnksz and lnktyp.
fr_fr: %s : dimension incompatible entre lnksz et lnktyp.

source: %s : lnksz and lnktyp argument must have the same length.
fr_fr: %s : Les arguments lnksz et lnktyp doivent avoir la même longueur.

source: %s : lnksz argument must be double or integer.
fr_fr: %s : L'argument lnksz doit être double ou entier.

source: %s : lnktyp argument must be double or integer.
fr_fr: %s : L'argument lnktyp doit être double ou entier.

source: %s : outtb element of state must be a list.
fr_fr: %s : L'élément d'état outtb doit être une liste.

source: %s : oz element of state must be a list.
fr_fr: %s : L'élément d'état oz doit être une liste.

source: %s : sim.opar must be a list.
fr_fr: %s : sim.opar doit être une liste.

source: %s : type 1 function not allowed for scilab blocks
fr_fr: %s : Les fonctions de type 1 ne sont pas autorisées pour les blocks scilab

source: %s : type 2 function not allowed for scilab blocks
fr_fr: %s : Les fonctions de type 2 ne sont pas autorisées pour les blocks scilab

source: %s : unknown block : %s
fr_fr: %s : block inconnu : %s

source: %s :the handle is not or no more valid.
fr_fr: %s : le handle n'est pas ou n'est plus valide.

source: %s: 1st and 2nd argument must have equal size
fr_fr: %s: Les 1er et 2nd arguments doivent avoir une dimension identique

source: %s: Memory allocation error.
fr_fr: %s : Erreur d'allocation de mémoire.

source: %s: error %d. A type of a scilab object has changed.
fr_fr: %s: erreur %d. Le type d'un objet Scilab a changé.

source: %s: error %d. Bad double object sub_type.
fr_fr: %s: erreur %d. Mauvais objet double sub_type.

source: %s: error %d. Bad int object sub_type.
fr_fr: %s: erreur %d. Mauvais objet entier sub_type.

source: %s: error %d. No more space on the stack for new data.
fr_fr: %s: erreur %d. Plus de place disponible sur la stack pour de nouvelles données.

source: %s: error %d. Only int or double object are accepted.
fr_fr: %s: erreur %d. Uniquement des objets entiers ou double sont acceptés.

source: %s: error %d. Stack is full.
fr_fr: %s: erreur %d. La stack est pleine.

source: %s: error %d. Undefined error.
fr_fr: %s: erreur %d. Erreur non définie.

source: %s: scicosim is not running.
fr_fr: %s: scicosim n'est pas lancé.

source: **** SUNDIALS.IDA failed to initialize ->try again *****
fr_fr: **** SUNDIALS.IDA échec de l'initialisation -> essayer encore *****

source: **** SUNDIALS.IDA successfully initialized *****
fr_fr: **** SUNDIALS.IDA initialisé avec succès *****

source: **** SUNDIALS.Ida: too much work at time=%g (stiff region, change RTOL and ATOL)
fr_fr: **** SUNDIALS.Ida: trop de travail à l'instant=%g (région raide, changer RTOL et ATOL)

source: ****SUNDIALS.Cvode from: %f to %f hot= %d
fr_fr: ****SUNDIALS.Cvode de: %f à %f hot= %d

source: ****SUNDIALS.Cvode reached: %f
fr_fr: ****SUNDIALS.Cvode atteint: %f

source: ****SUNDIALS.Cvode: too much work at time=%g (stiff region, change RTOL and ATOL)
fr_fr: ****SUNDIALS.Cvode: trop de travail à l'instant=%g (région raide, changer RTOL et ATOL)

source: ****SUNDIALS.Ida reached: %f
fr_fr: ****SUNDIALS.Ida atteint: %f

source: ****daskr from: %f to %f hot= %d
fr_fr: ****daskr de: %f à %f hot= %d

source: - ["str1";"str2",...] is a string matrix
fr_fr: - ["str1";"str2",...] est une matrice de chaînes de caractères

source: - myvar : an int32 or double matrix or a Tlist.
fr_fr: - myvar : un int32 ou une matrice double ou une tlist.

source: CV_BAD_ABSTOL: abstol has negative component(s) (illegal).
fr_fr: CV_BAD_ABSTOL: abstol a des composantes nétagives (illégale).

source: CV_BAD_DKY: The dky argument was NULL. dky is the output derivative vector [((d/dt)^k)y](t).
fr_fr: CV_BAD_DKY: L'argument dky était NULL. dky est le vecteur de la dérivée de la sortie [((d/dt)^k)y](t).

source: CV_BAD_EWT: Initial ewt has component(s) equal to zero (illegal).
fr_fr: CV_BAD_EWT: L'ewt initial has des composantes égales à zéros (illégale).

source: CV_BAD_H0: h0 and tout - t0 inconsistent.
fr_fr: CV_BAD_H0: h0 et tout - t0 sont inconsistents.

source: CV_BAD_INIT_ROOT: Root found at and very near initial t.
fr_fr: CV_BAD_INIT_ROOT: La racine trouvée sur et près du t initial.

source: CV_BAD_ITASK: Illegal value for itask.
fr_fr: CV_BAD_ITASK: Valeur illégale pour itask.

source: CV_BAD_ITOL: Illegal value for itol. The legal values are CV_SS, CV_SV, and CV_WF.
fr_fr: CV_BAD_ITOL: Valeur illégale pour itol. Les valeurs légales sont CV_SS, CV_SV, et CV_WF.

source: CV_BAD_K: k (the order of the derivative of y to be computed) is not in the range 0, 1, ..., qu, where qu is the order last used
fr_fr: CV_BAD_K: k (l'ordre de la dérivée de y à calculer) n'est pas dans l'interval 0, 1, ..., qu, où qu est le dernier ordre utilisé

source: CV_BAD_NVECTOR: A required vector operation is not implemented.
fr_fr: CV_BAD_NVECTOR: Une opération vectorielle requise n'est pas implémentée.

source: CV_BAD_RELTOL: relative tolerances is reltol < 0 illegal.
fr_fr: CV_BAD_RELTOL: la tolérance relative est reltol < 0 illégale.

source: CV_BAD_T: t is not in the interval [tn-hu,tn].
fr_fr: CV_BAD_T: t n'est pas dans l'interval [tn-hu,tn].

source: CV_BAD_TOUT: Trouble interpolating. ''tout'' too far back in direction of integration
fr_fr: CV_BAD_TOUT: Problèmes lors de l'interpolation. ''tout'' est trop loins derrière la direction d'intégration

source: CV_BAD_TSTOP: tstop is behind current simulation time in the direction of integration.
fr_fr: CV_BAD_TSTOP: tstop est derrière le temps de simulation courant dans la direction d'intégration.

source: CV_CLOSE_ROOTS: Root found at and very near starting time.
fr_fr: CV_CLOSE_ROOTS: La raciné trouvée est sur et très près de l'instant de départ.

source: CV_CONV_FAILURE: Convergence test failures occurred too many times (= MXNCF = 10) during one internal time step or occurred with |h| = hmin.
fr_fr: CV_CONV_FAILURE: L'échec du test de convergence est apparau trop souvent (= MXNCF = 10) pendant un pas temporelle interne ou est apparu avec |h| = hmin.

source: CV_Derivative_NAN: The Derivatives returned by blocks are NAN.
fr_fr: CV_Derivative_NAN: Les dérivées retournées par les blocks sont NAN.

source: CV_ERR_FAILURE: Error test failures occurred too many times (=MXETF = 7) during one internal step or occurred with |h|=h_min
fr_fr: CV_ERR_FAILURE: L'échec du test d'erreur est apparu trop souvent (=MXETF = 7) pendant un pas temporelle ou est apparu avec |h|=h_min

source: CV_EWT_FAIL: The user-provide EwtSet function failed.
fr_fr: CV_EWT_FAIL: Echec de la fonction EwtSet fournie par l'utilisateur

source: CV_FIRST_RHSFUNC_ERR: The right-hand side function (user supplied ODE) had a recoverable error at the first call
fr_fr: CV_FIRST_RHSFUNC_ERR: La fonction du coté droit (ODE fournie pas l'utilisateur) a une erreur récupérable au premier appel

source: CV_ILL_INPUT: indicating an input argument was illegal. This include the situation where a component of the error weight vector becomes negative during internal time-stepping. This also includes if the linear solver function initialization (called by the user after calling CVodeCreat) failed to set the linear solver-specific ''lsolve'' field in cvode_mem. This error happens if number of root functions is positive but the return surface value is NULL.
fr_fr: CV_ILL_INPUT: indique qu'un argument d'entrée était illégal. Ceci comprend la situation ou une composante du vecteur de poids de l'erreur est devenu négative pendant un pas temporel interne. Ceci inclue aussi le cas où l'initialisation de la fonction de résolution linéaire (appelé par l'utilisateur après l'appel de CVodeCreat) a échoué lors de l'affectation du champ du solveur linéaire spécifique ''lsolve'' dans cvode_mem. Cette erreur apparaît sur le nombre de fonctions racines est positif mais la valeur de retour de la surface est NULL.

source: CV_LINIT_FAIL: The linear solver''s initialization function failed.
fr_fr: CV_LINIT_FAIL: La fonction d'initialisation du solveur linéaire a échoué.

source: CV_LSETUP_FAIL: The linear solver''s setup routine failed in an unrecoverable manner.
fr_fr: CV_LSETUP_FAIL: La routine de réglage du solveur linéaire a échoué de façon irrécupérable.

source: CV_LSOLVE_FAIL: The linear solver''s solve routine failed in an unrecoverable manner.
fr_fr: CV_LSOLVE_FAIL: La routine de résolution du solveur linéaire a échoué de façon irrécupérable.

source: CV_LSOLVE_NULL: The linear solver''s solve routine is NULL.
fr_fr: CV_LSOLVE_NULL: La routine de résolution du solveur linéaire est NULL.

source: CV_MEM_FAIL: a memory allocation failed, including an attempt to increase maxord
fr_fr: CV_MEM_FAIL: une allocation mémoire a échoué, incluant une tentative d'accroitre maxord

source: CV_MEM_NULL: the cvode memory was NULL
fr_fr: CV_MEM_NULL: la mémoire cvode était NULL

source: CV_NO_EFUN: itol = CV_WF but no EwtSet function was provided.
fr_fr: CV_NO_EFUN: itol = CV_WF mais aucune fonction EwtSet n'a été fournie.

source: CV_NO_ESTOP: itask = CV_NORMAL_TSTOP or itask = CV_ONE_STEP_TSTOP but tstop was not set
fr_fr: CV_NO_ESTOP: itask = CV_NORMAL_TSTOP ou itask = CV_ONE_STEP_TSTOP mais tstop n'a pas été défini

source: CV_NO_MALLOC: indicating that cvode_mem has not been allocated (i.e., CVodeMalloc has not been called).
fr_fr: CV_NO_MALLOC: indique que cvode_mem n'a pas été alloué (i.e., CVodeMalloc n'a pas été appelé).

source: CV_NULL_ABSTOL: absolute tolerances is = NULL illegal.
fr_fr: CV_NULL_ABSTOL: les tolérances absolues is = NULL illégal.

source: CV_NULL_F: user supplied ODE routine is (NULL) illegal.
fr_fr: CV_NULL_F: la routine ODE fournie par l'utilisateur est NULL illégal.

source: CV_NULL_G: user supplied zero-crossing routine is (NULL) illegal.
fr_fr: CV_NULL_G: la routine de zero-crossing fournie par l'utilisateur est NULL illégal.

source: CV_NULL_Y0: y0 = NULL illegal.
fr_fr: CV_NULL_Y0: y0 = NULL illégal.

source: CV_REPTD_RHSFUNC_ERR: Convergence tests occurred too many times due to repeated recoverable errors in the right-hand side function (user supplied ODE). This error may be raised due to repeated recoverable errors during the estimation of an initial step size.
fr_fr: CV_REPTD_RHSFUNC_ERR: Les tests de convergence sont apparus trop souvent du à des erreurs récupérables répétées dans la fonction du membre de droite (ODE fournie par l'utilisateur). Cette erreur a pu être émise à cause d'erreurs récupérables répétées pendant l'estimation de la taille du pas initial.

source: CV_RHSFUNC_FAIL: The right-hand side function (user supplied ODE) failed in an unrecoverable manner
fr_fr: CV_RHSFUNC_FAIL: La fonction du membre de droite (ODE fournie par l'utilisateur) a échoué de manière irrécupérable

source: CV_RTFUNC_FAIL: The root finding routine failed in an unrecoverable manner.
fr_fr: CV_RTFUNC_FAIL: La routine de recherche de racine a échoué de manière irrécupérable.

source: CV_Rootfunction_NAN: The Root function returns NAN.
fr_fr: CV_Rootfunction_NAN: La fonction Root retourne NAN.

source: CV_TOO_CLOSE: ''tout'' too close to ''t0'' to start integration.
fr_fr: CV_TOO_CLOSE: ''tout'' trop proche de ''t0'' pour démarrer l'intégration.

source: CV_TOO_MUCH_ACC: The solver could not satisfy the accuracy demanded by the user for some internal step
fr_fr: CV_TOO_MUCH_ACC: Le solveur ne peut pas satisfaire la précision demandée par l'utilisateur pour certains pas internes

source: CV_TOO_MUCH_WORK: The solver took mxstep internal steps but could not reach ''tout''. The default value for mxstep is MXSTEP_DEFAULT = 500.
fr_fr: CV_TOO_MUCH_WORK: Le solveur a pris mxstep pas internes pour atteindre ''tout''. La valeur pas défaut de est MXSTEP_DEFAULT = 500.

source: CV_TRET_NULL: ''tret'' = NULL illegal.
fr_fr: CV_TRET_NULL: ''tret'' = NULL illégal.

source: CV_UNREC_RHSFUNC_ERR: The right-hand side function (user supplied ODE) had a recoverable error, but no recovery was possible.
fr_fr: CV_UNREC_RHSFUNC_ERR: Le fonction du membdre de droite (ODE fournie par l'utilisateur) a subi une erreur récupérable, mais aucune récupération n'était possible.

source: CV_YOUT_NULL: ''yout'' = NULL illegal.
fr_fr: CV_YOUT_NULL: ''yout'' = NULL illégal.

source: Cannot find the initial mode, maybe there is a sliding mode condition
fr_fr: Ne peut pas trouver le mode initial, peut être y a-t-il une condition de mode glissant

source: End of activation
fr_fr: Fin d'activation

source: End of activation
fr_fr: Fin d'activation

source: Entering the block
fr_fr: Entre dans le block

source: Error in the Debug block
fr_fr: Erreur dans le bloc de débogage

source: Error: cannot find '%s'
fr_fr: Erreur : impossible de trouver '%s'

source: Error: cannot write to '%s'
fr_fr: Erreur : impossible d'écrire dans '%s'

source: Event: %d activated at t=%f
fr_fr: Événement : %d activé à t=%f

source: Function not found
fr_fr: Fonction non trouvée

source: IDACalc cannot find the initial condition at this point. If you are using a Modelica model, you can try with the initialization GUI to try with other nonlinear solvers.
fr_fr: IDACalc ne peut pas trouver la condition initiale en ce point. Si vous utilisez un modèle Modelica, vous pouvez essayer l'interface graphique d'initialisation pour essayer avec d'autres solveurs non linéaires.

source: IDA_BAD_ABSTOL: abstol has negative component(s) (illegal).
fr_fr: IDA_BAD_ABSTOL: abstol a des composantes négatives (illégal).

source: IDA_BAD_EWT: Some component of the error weight vector is zero (illegal), either for the input value of y0 or a corrected value.
fr_fr: IDA_BAD_EWT: Des composantes du vecteur de poids de l'erreur sont nulles (illégal), soit pour la valeur d'entrée de y0 ou pour une valeur corrigée.

source: IDA_BAD_H0: h0 and tout - t0 inconsistent.
fr_fr: IDA_BAD_H0: h0 et tout - t0 incompatibles.

source: IDA_BAD_HINIT: yret = NULL illegal..
fr_fr: IDA_BAD_HINIT: yret = NULL illégal..

source: IDA_BAD_INIT_ROOT: Root found at and very near initial t.
fr_fr: IDA_BAD_INIT_ROOT: Racine trouvée à et très près du t initial.

source: IDA_BAD_ITASK: Illegal value for itask.
fr_fr: IDA_BAD_ITASK: Vauleur illégale pour itask.

source: IDA_BAD_ITOL: Illegal value for itol. The legal values are IDA_SS, IDA_SV, and IDA_WF.
fr_fr: IDA_BAD_ITOL: Valeur illégale pour itol. Les valeurs légales sont IDA_SS, IDA_SV, et IDA_WF.

source: IDA_BAD_NVECTOR: A required vector operation is not implemented.
fr_fr: IDA_BAD_NVECTOR: Une opération vectorielle requise n'est pas implémentée.

source: IDA_BAD_RELTOL: relative tolerances is reltol < 0 illegal.
fr_fr: IDA_BAD_RELTOL: la tolérance relative est reltol < 0 illégal.

source: IDA_BAD_T: t is not in the interval [tn-hu,tn].
fr_fr: IDA_BAD_T: t n'est pas dans l'interval [tn-hu,tn].

source: IDA_BAD_TOUT: Trouble interpolating. ''tout'' too far back in direction of integration
fr_fr: IDA_BAD_TOUT: Difficulté d'interpolation. ''tout'' est trop loin derrière la direction d'intégration

source: IDA_BAD_TSTOP: tstop is behind current simulation time in the direction of integration.
fr_fr: IDA_BAD_TSTOP: tstop est derrière le temps courant de simulation dans la direction d'intégration.

source: IDA_CLOSE_ROOTS: Root found at and very near starting time.
fr_fr: IDA_CLOSE_ROOTS: Racine trouvée à et très près de l'instant de départ.

source: IDA_CONSTR_FAIL: IDACalcIC was unable to find a solution satisfying the inequality constraints.
fr_fr: IDA_CONSTR_FAIL: IDACalcIC n'a pas été capable de trouver une solution satisfiant les contraintes d'inégalités.

source: IDA_CONV_FAIL: IDACalcIC->Failed to get convergence of the Newton iterations. or IDA_solve->Convergence test failures occurred too many times (= MXNCF = 10) during one internal step.
fr_fr: IDA_CONV_FAIL: IDACalcIC->A échoué à obtenir la convergence des itérations de Newton. ou IDA_solve->Les échecs du test de convergence sont apparus trop souvent (= MXNCF = 10) pendant un pas interne.

source: IDA_ERR_FAIL: Error test failures occurred too many times (=MXETF = 10) during one internal step or occurred with |h|=h_min
fr_fr: IDA_ERR_FAIL: Les échecs du test d'erreur sont apparus trop souvent (=MXETF = 10) pendant un pas interne ou sont apparus avec |h|=h_min

source: IDA_EWT_FAIL: The user-provide EwtSet function failed.
fr_fr: IDA_EWT_FAIL: La fonction EwtSet fournie par l'utilisateur a échoué.

source: IDA_FIRST_RES_FAIL: The user''s residual routine returned a recoverable error flag on the first call, but IDACalcIC was unable to recover.
fr_fr: IDA_FIRST_RES_FAIL: La routine résidu de l'utilisateur a retournée une erreur récupérable lors du premier appel, mais IDACalcIC n'a pas été capable de récupérer.
