Repository: ScilabOrg/scilab
Catalog: scilab/modules/statistics/locales/*/statistics.po
Languages: ja_jp, ru_ru

source: %s: Wrong number of input arguments: %d to %d expected.
ja_jp: %1$s: 入力引数の数が不正です: %3$d への %2$d を想定します。
ru_ru: %s: Неверное количество аргументов: Ожидалось от %d до %d.

source: %s: Wrong value for third input argument: ''%s'', ''%s'', %d or %d expected.
ru_ru: %s: Неверное значение третьего аргумента: Ожидалось ''%s'', ''%s'', %d или %d.

source: %s: Wrong value for second input argument: ''%s'', ''%s'', %d or %d expected.
ru_ru: %s: Неверное значение второго аргумента : Ожидалось ''%s'', ''%s'', %d или %d.

source: %s: Wrong type for input arguments: Numerical expected.
ja_jp: %s: 入力引数で不正な型: 数値を想定します。
ru_ru: %s: Неверны типы аргументов: Ожидались численные типы.

source: %s: Wrong size for both input arguments: same size expected.
ja_jp: %s: 両方の入力引数で不正なサイズ: サイズが一致する必要があります。
ru_ru: %s: Неверны размеры обоих аргументов: аргументы должны иметь одинаковый размер.

source: %s: Wrong size for first input argument: Must be > %d.
ru_ru: %s: Неверный размер первого аргумента: Должен быть > %d.

source: %s: Wrong value for second input argument: Real number between %d to %d expected.
ru_ru: %s: Неверное значение второго аргумента: Ожидалось вещественное число между %d и %d.

source: %s: Wrong number of input argument: %d expected.
ja_jp: %s: 入力引数の数が不正です: %d を想定します。
ru_ru: %s: Неверное количество аргументов: Ожидалось %d.

source: %s: Wrong value for third input argument: ''%s'', ''%s'', ''%s'', %d or %d expected.
ru_ru: %s: Неверное значение третьего аргумента: Ожидалось ''%s'', ''%s'', ''%s'', %d или %d.

source: %s: Wrong number of input argument: %d to %d expected.
ja_jp: %1$s: 入力引数の数が不正です: %3$d への %2$d を想定します。
ru_ru: %s: Неверное количество аргументов: Ожидалось от %d до %d.

source: %s: Wrong value for second input argument: ''%s'', ''%s'', ''%s'', %d or %d expected.
ru_ru: %s: Неверное значение второго аргумента: Ожидалось ''%s'', ''%s'', ''%s'', %d или %d.

source: %s: Wrong number of input arguments: %d expected.
ja_jp: %s: 入力引数の数が不正です: %d を想定します。
ru_ru: %s: Неверное количество аргументов: Ожидалось %d.

source: %s: Wrong type for first input argument: Vector expected.
ru_ru: %s: Неверный тип первого аргумента: Ожидался вектор.

source: %s: Wrong type for second input argument: Vector expected.
ru_ru: %s: Неверный тип второго аргумента: Ожидался вектор.

source: %s: Wrong value for third input argument: Same number of line as first input argument expected.
ru_ru: %s: Неверное значение третьего аргумента: Ожидалось такое же количество строк как и в первом аргументе.

source: %s: Wrong value for third input argument: Same number of column as first input argument expected.
ru_ru: %s: Неверное значение третьего аргумента: Ожидалось такое же количество столбцов как и в первом аргументе.

source: %s: Wrong value for input argument: ''%s'', ''%s'', %d or %d expected.
ja_jp: %s: 入力引数で不正な値: ''%s'', ''%s'', %d または %d を想定します。
ru_ru: %s: Неверное значение аргумента: Ожидалось ''%s'', ''%s'', %d или %d.

source: %s: Wrong value for second input argument: Must be between %d and %d.
ru_ru: %s: Неверное значение второго аргумента: Должно быть между %d и %d.

source: %s: Wrong type for first input argument: Numerical expected.
ru_ru: %s: Неверный тип первого аргумента: Ожидался числовой тип.

source: %s: Wrong type for first input arguments: Numerical expected.
ru_ru: %s: Неверный тип первого аргумента: Ожидался числовой тип.

source: %s: Wrong number of input argument: At least %d expected.
ja_jp: %s: 入力引数の数が不正です: 少なくとも %d を想定します。
ru_ru: %s: Неверное количество аргументов: Ожидалось как минимум %d.

source: %s: Wrong value for second input argument: Must be > 1.
ru_ru: %s: Неверное значение второго аргумента: Должно быть > 1.

source: %s: Wrong value for second input argument: ''%s'', ''%s'',''%s'', %d or %d.
ru_ru: %s: Неверное значение второго аргумента: Ожидалось''%s'', ''%s'',''%s'', %d или %d.

source: %s: Wrong number of input argument(s): %d to %d expected.
ru_ru: %s: Неверное количество аргументов: Ожидалось от %d до %d.

source: %s: Wrong type for third input argument: Boolean expected.
ru_ru: %s: Неверный тип третьего аргумента: Ожидался логический тип (Boolean).

source: %s: Wrong size for second inputargument: Size %s expected.
ru_ru: %s: Неверный размер второго аргумента: Ожидался размер %s.

source: %s: Graph demand out of bounds.
ja_jp: %s: グラフ要求が規定外です。
ru_ru: %s: Графический запрос не укладывается в границы.

source: Correlations Circle
ja_jp: 相関円
ru_ru: Корреляцонный Круг

source: Eigenvalues (in percent)
ja_jp: 固有値(パーセント)
ru_ru: Собственные значения (в процентах)

source: %s: Wrong type for first input argument: Vector, matrix of numbers or strings expected.
ru_ru: %s: Неверный тип первого аргумента: Ожидались вектор или матрица чисел или строк.

source: %s: Wrong value for second input argument: ''%s'' or ''%s'' expected.
ru_ru: %s: Неверное значение второго аргумента: Ожидалось ''%s'' или ''%s''.

source: %s: Wrong type for first input argument: Real vector or matrix expected.
ru_ru: %s: Неверный тип первого аргумента: Ожидалась матрица или вектор вещественных чисел.

source: %s: Wrong type for first input argument.
ru_ru: %s: Неверный тип первого аргумента.

source: %s: Wrong type for second input argument: Scalar or vector expected.
ru_ru: %s: Неверный тип второго аргумента: Ожидалось число или вектор.

source: %s: Wrong value for third input argument: ''%s'', ''%s'',''%s'', %d or %d.
ru_ru: %s: Неверное значение третьего аргумента: Ожидалось ''%s'', ''%s'',''%s'', %d или %d.

source: %s: Wrong size for second and third input argument: Same size expected.
ru_ru: %s: Неверные размеры второго и третьего аргументов: Размеры должны совпадать.

source: %s: Wrong size for third input argument: Same number of rows of the second input argument expected.
ru_ru: %s: Неверный размер третьего аргумента: Должно быть такое же количество строк как и во втором аргументе.

source: %s: Wrong size for third input argument: Same number of columns of the second input argument expected.
ru_ru: %s: Неверный размер третьего аргумента: Должно быть такое же количество столбцов как и во втором аргументе.

source: %s: Wrong value for fourth input argument: ''%s'', ''%s'', ''%s'', %d or %d expected.
ru_ru: %s: Неверное значение четвёртого аргумента: Ожидалось ''%s'', ''%s'', ''%s'', %d или %d.

source: %s: Wrong value of first input argument: Less or equal than length of last input argument expected.
ru_ru: %s: Неверное значение первого аргумента: Ожидалось число меньшее или равное длине последнего аргумента.

source: %s: Wrong size for first and second input arguments: Same dimensions expected.
ru_ru: %s: Неверны размеры первого и второго аргументов: Размерности должны совпадать.

source: %s: Wrong value for second input argument: ''%s'', ''%s'',''%s'' or a positive number expected.
ru_ru: %s: Неверное значение второго аргумента: Ожидалось ''%s'', ''%s'',''%s'' или положительное число.

source: %s: Input argument must be %d for '%s' option.
ru_ru: %s: Аргумент должен быть %d для опции '%s'.

source: %s and %s must have same size.
ja_jp: %s と %s は、サイズが一致しなくてはいけません。
ru_ru: %s и %s должны иметь одинаковые размеры.

source: X and Df
ja_jp: X と Df
ru_ru: X и Df

source: Df, P and Q
ja_jp: Df, P と Q
ru_ru: Df, P и Q

source: P,Q and X
ja_jp: P,Q と X
ru_ru: P,Q и X

source: %s: First input argument must be 'PQ', 'X' or 'DF'.
ru_ru: %s: Первый аргумента должен быть 'PQ', 'X' или 'DF'.

source: Answer appears to be lower than lowest search bound %f
ja_jp: 答えは、最低の境界線 %f よりも低いようです
ru_ru: Похоже ответ будет ниже нижней границы поиска %f

source: Answer appears to be higher than greatest search bound %f
ja_jp: 答えは、最上の境界線 %f よりも高いようです
ru_ru: Похоже ответ будет выше верхней границы поиска %f

source: cdfchi: Error in cumgam
ja_jp: cdfchi: cumgam の誤り
ru_ru: cdfchi: Ошибка в cumgam

source: Input argument %c is out of range. Bound exceeded: %f
ja_jp: 入力引数 %c は範囲外です。 境界線を想定します: %f
ru_ru: Аргумент %c вне допустимого диапазона. Превышен предел: %f

source: T and Df
ja_jp: T と Df
ru_ru: T и Df

source: P,Q and T
ja_jp: P,Q と T
ru_ru: P,Q и T

source: %s: First input argument must be 'PQ', 'T' or 'DF'.
ru_ru: %s: Первый аргумент должен быть 'PQ', 'T' или 'DF'.

source: X,Shape and Scale
ja_jp: X,形状 と 比率
ru_ru: X, Shape и Scale

source: Shape,Scale,P and Q
ja_jp: 形状,比率,P と Q
ru_ru: Shape, Scale, P и Q

source: Scale,P,Q and X
ja_jp: 形状,P,Q と X
ru_ru: Scale, P, Q и X

source: P,Q,X and Shape
ja_jp: P,Q,X と 形状
ru_ru: P, Q, X и Shape

source: %s: First input argument must be 'PQ', 'X', 'Shape' or 'Scale'.
ru_ru: %s: Первый аргумент должен быть 'PQ', 'X', 'Shape' или 'Scale'.

source: F,Dfn and Dfd
ja_jp: F,Dfn と Dfd
ru_ru: F, Dfn и Dfd

source: Dfn,Dfd,P and Q
ja_jp: Dfn,Dfd,P と Q
ru_ru: Dfn, Dfd, P и Q

source: Dfd,P,Q and F
ja_jp: Dfd,P,Q と F
ru_ru: Dfd, P, Q и F

source: P,Q,F and Dfn
ja_jp: P,Q,F と Dfn
ru_ru: P, Q, F и Dfn

source: %s: First input argument must be 'PQ', 'F', 'Dfn' or 'Dfd'.
ru_ru: %s: Первый аргумент должен быть 'PQ', 'F', 'Dfn' или 'Dfd'.

source: F,Dfn,Dfd and Pnonc
ja_jp: F,Dfn,Dfd と Pnonc
ru_ru: F, Dfn, Dfd и Pnonc

source: Dfn,Dfd,Pnonc,P and Q
ja_jp: Dfn,Dfd,Pnonc,P と Q
ru_ru: Dfn, Dfd, Pnonc, P и Q

source: Dfd,Pnonc,P,Q and F
ja_jp: Dfd,Pnonc,P,Q と F
ru_ru: Dfd,Pnonc,P,Q и F

source: Pnonc,P,Q,F and Dfn
ja_jp: Pnonc,P,Q,F と Dfn
ru_ru: Pnonc,P,Q,F и Dfn

source: P,Q,F,Dfn and Dfd
ja_jp: P,Q,F,Dfn と Dfd
ru_ru: P,Q,F,Dfn и Dfd

source: %s: First input argument must be 'PQ', 'F', 'Dfn', 'Dfd' or 'Pnonc'.
ru_ru: %s: Первый аргумент должен быть 'PQ', 'F', 'Dfn', 'Dfd' или 'Pnonc'.

source: S and Xlam
ja_jp: S と Xlam
ru_ru: S и Xlam

source: Xlam,P and Q
ja_jp: Xlam,P と Q
ru_ru: Xlam,P и Q

source: P,Q and S
ja_jp: P,Q と S
ru_ru: P,Q и S

source: %s: First input argument must be 'PQ', 'S' or 'Xlam'.
ru_ru: %s: Первый аргумента должен быть 'PQ', 'S' или 'Xlam'.

source: S,Xn,Pr and Ompr
ja_jp: S,Xn,Pr と Ompr
ru_ru: S,Xn,Pr и Ompr

source: Xn,Pr,Ompr,P and Q
ja_jp: Xn,Pr,Ompr,P と Q
ru_ru: Xn,Pr,Ompr,P и Q

source: Pr,OMPr,P,Q and S
ja_jp: Pr,OMPr,P,Q と S
ru_ru: Pr,OMPr,P,Q и S

source: P,Q,S and Xn
ja_jp: P,Q,S と Xn
ru_ru: P,Q,S и Xn

source: %s: First input argument must be 'PQ', 'S', 'Xn' or 'PrOmpr'.
ru_ru: %s: Первый аргумент должен быть 'PQ', 'S', 'Xn' или 'PrOmpr'.

source: X,Df and Pnonc
ja_jp: X,Df と Pnonc
ru_ru: X,Df и Pnonc

source: Df,Pnonc,P and Q
ja_jp: Df,Pnonc,P と Q
ru_ru: Df,Pnonc,P и Q

source: Pnonc,P,Q and X
ja_jp: Pnonc,P,Q と X
ru_ru: Pnonc,P,Q и X

source: P,Q,X and Df
ja_jp: P,Q,X と Df
ru_ru: P,Q,X и Df

source: %s: First input argument must be 'PQ', 'X', 'Df' or 'Pnonc'.
ru_ru: %s: Первый аргумент должен быть 'PQ', 'X', 'Df' или 'Pnonc'.

source: X,Y,A and B
ja_jp: X,Y,A と B
ru_ru: X,Y,A и B

source: A,B,P and Q
ja_jp: A,B,P と Q
ru_ru: A,B,P и Q

source: B,P,Q,X and Y
ja_jp: B,P,Q,X と Y
ru_ru: B,P,Q,X и Y

source: P,Q,X,Y and A
ja_jp: P,Q,X,Y と A
ru_ru: P,Q,X,Y и A

source: %s: First input argument must be 'PQ', 'XY', 'A' or 'B'.
ru_ru: %s: Первый аргумент должен быть 'PQ', 'XY', 'A' или 'B'.

source: S,XN,PR and OMPR
ja_jp: S,XN,PR と OMPR
ru_ru: S,XN,PR и OMPR

source: XN,PR,OMPR,P and Q
ja_jp: XN,PR,OMPR,P と Q
ru_ru: XN,PR,OMPR,P и Q

source: PR,OMPR,P,Q and S
ja_jp: PR,OMPR,P,Q と S
ru_ru: PR,OMPR,P,Q и S

source: P,Q,S and Xn
ja_jp: P,Q,S と Xn
ru_ru: P,Q,S и Xn

source: X,Mean and Std
ja_jp: X,平均 と Std
ru_ru: X,Mean и Std

source: Mean,Std,P and Q
ja_jp: 平均,Std,P と Q
ru_ru: Mean,Std,P и Q

source: Std,P,Q and X
ja_jp: Std,P,Q と X
ru_ru: Std,P,Q и X

source: P,Q,X and Mean
ja_jp: P,Q,X と 平均
ru_ru: P,Q,X и Mean

source: %s: First input argument must be 'PQ', 'X', 'Mean' or 'Std'.
ru_ru: %s: Первый аргумент должен быть 'PQ', 'X', 'Mean' или 'Std'.

source: Std must not be zero
ja_jp: Stdはゼロではいけません
ru_ru: Std не может быть нулевым

source: %s: Wrong number of input arguments with the '%s' option: %d expected.
ja_jp: %s: '%s' オプションと入力引数の数が不正です: %d を想定します。

source: %s: Wrong size for input argument #%d and #%d: Same size expected.
ja_jp: %s: 入力引数 #%d と #%d で不正なサイズ: サイズが一致する必要があります。

source: %s: Wrong size for input argument #%d: Must be > %d.
ja_jp: %s: 入力引数 #%d で不正なサイズ: > %d でなくてはなりません。

source: %s: Wrong size for input argument #%d: Same number of columns of the second input argument expected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 第二の入力引数の同じ欄の数を想定します。

source: %s: Wrong size for input argument #%d: Same number of rows of the second input argument expected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 第二の入力引数の同じ列の数を想定します。

source: %s: Wrong size for input argument #%d: Size %s expected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: サイズ %s を想定します。

source: %s: Wrong size for input arguments #%d and #%d: Same dimensions expected.
ja_jp: %s: 入力引数 #%d と #%d で不正なサイズ: 次元が一致する必要があります。

source: %s: Wrong type for input argument #%d.
ja_jp: %s: 入力引数 #%d で不正な型です。

source: %s: Wrong type for input argument #%d: Boolean expected.
ja_jp: %s: 入力引数 #%d で不正な型: ブーリアンを想定します。

source: %s: Wrong type for input argument #%d: Numerical expected.
ja_jp: %s: 入力引数 #%d で不正な型: 数値を想定します。

source: %s: Wrong type for input argument #%d: Real vector or matrix expected.
ja_jp: %s: 入力引数 #%d で不正な型: 実ベクトルか、または、行列を想定します。

source: %s: Wrong type for input argument #%d: Scalar or vector expected.
ja_jp: %s: 入力引数 #%d で不正な型: スカラー、または、ベクトルを想定します。

source: %s: Wrong type for input argument #%d: Vector expected.
ja_jp: %s: 入力引数 #%d で不正な型: ベクトルを想定します。

source: %s: Wrong type for input argument #%d: Vector, matrix of numbers or strings expected.
ja_jp: %s: 入力引数 #%d で不正な型: ベクトルか文字 または、数の行列を想定します。

source: %s: Wrong type for input arguments #%d: Numerical expected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 数値を想定します。

source: %s: Wrong value for %d input argument: ''%s'', ''%s'', %d or %d expected.
ja_jp: %s: %d の入力引数で不正な値: ''%s'', ''%s'', %d または %d を想定します。

source: %s: Wrong value for input argument #%d: '%s', '%s' or '%s' expected.
ja_jp: %s: 入力引数 #%d で不正な値: '%s', '%s' または '%s' を想定します。

source: %s: Wrong value for input argument #%d: '%s', '%s', '%s' or '%s' expected.
ja_jp: %s: 入力引数 #%d で不正な値: '%s', '%s', '%s' または '%s' を想定します。

source: %s: Wrong value for input argument #%d: '%s', '%s', '%s', '%s' or '%s' expected.
ja_jp: %s: 入力引数 #%d で不正な値: '%s', '%s', '%s', '%s' または '%s' を想定します。

source: %s: Wrong value for input argument #%d: ''%s'' or ''%s'' expected.
ja_jp: %s: 入力引数 #%d で不正な値: ''%s'' または ''%s'' を想定します。

source: %s: Wrong value for input argument #%d: ''%s'', ''%s'', %d or %d expected.
ja_jp: %s: 入力引数 #%d で不正な値: ''%s'', ''%s'', %d または %d を想定します。

source: %s: Wrong value for input argument #%d: ''%s'', ''%s'', ''%s'', %d or %d expected.
ja_jp: %s: 入力引数 #%d で不正な値: ''%s'', ''%s'', ''%s'', %d または %d を想定します。

source: %s: Wrong value for input argument #%d: ''%s'', ''%s'',''%s'' or a positive number expected.
ja_jp: %s: 入力引数 #%d で不正な値: ''%s'', ''%s'',''%s'' または 明確な数を想定します。

source: %s: Wrong value for input argument #%d: ''%s'', ''%s'',''%s'', %d or %d.
ja_jp: %s: 入力引数 #%d で不正な値: ''%s'', ''%s'',''%s'', %d または %d

source: %s: Wrong value for input argument #%d: Must be > %d.
ja_jp: %s: 入力引数 #%d で不正な値: > %d でなくてはなりません。

source: %s: Wrong value for input argument #%d: Must be between %d and %d.
ja_jp: %s: 入力引数 #%d で不正な値: %d と %d の間でなくてはなりません。

source: %s: Wrong value for input argument #%d: Real number between %d to %d expected.
ja_jp: %1$s: 入力引数 #%2$d で不正な値: %4$d への %3$d 間の実数を想定します。

source: %s: Wrong value for input argument #%d: Same number of column as first input argument expected.
ja_jp: %s: 入力引数 #%d で不正な値: 最初の入力引数で列の同数を想定します。

source: %s: Wrong value for input argument #%d: Same number of line as first input argument expected.
ja_jp: %s: 入力引数 #%d で不正な値: 最初の入力引数で行の同数を想定します。

source: %s: Wrong value of input argument #%d: Less or equal than length of last input argument expected.
ja_jp: %s: 入力引数 #%d の値が不正です: 最後の入力引数の長さ以下、または、同等の長さを想定します。

source: %s: Wrong value of w : %d; 0 or 1 expected.
ja_jp: %s: w の間違った値 : %d; 0 または 1 を想定します。

source: Keeping %i values from %i to %i in sorted order
ja_jp: %1$i から分類された順序の %3$i までの %2$i 値を保ちます

source: Size of x is zero : returning NaN.
ja_jp: xのサイズはゼロです : NaNを返します。

source: Size of x:%i
ja_jp: xのサイズ:%i

source: Unexpected value of orien : %s
ja_jp: 適用の思いがけない値 : %s

source: Wrong value for input argument orien: %s.
ja_jp: 入力引数 orien で不正な値: %s

source: discard=%s
ja_jp: 放棄=%s

source: orien=%s
ja_jp: 適応=%s
