Repository: ScilabOrg/scilab
Catalog: scilab/modules/data_structures/locales/*/data_structures.po
Languages: de_de, ja_jp, pl_pl

source: An hypermatrix extraction must have at least 2 arguments.
de_de: Eine Extraktion einer Hypermatrix muß mindesten zwei Argumente haben.
ja_jp: 多次元配列の抽出は、最低2つの引数が必要です
pl_pl: Wyprowadzenie hipermacierzy musi mieć przynajmniej 2 parametry.

source: An hypermatrix insertion must have at least 3 arguments
de_de: Ein Einfügen einer Hypermatrix muß mindestens drei Argumente haben.
ja_jp: 多次元配列の挿入は、最低３つの引数が必要です
pl_pl: Wprowadzenie hipermacierzy musi mieć przynajmniej 3 parametry

source: Argument is not an hypermatrix
de_de: Argument ist keine Hypermatrix
ja_jp: 入力引数は多次元配列でありません
pl_pl: Parametr nie jest hipermacierza

source: Argument is not an hypermatrix.
de_de: Argument ist keine Hypermatrix.
ja_jp: 入力引数は多次元配列ではありません。
pl_pl: Parametr nie jest hipermacierza.

source: Bad hypermatrix insertion.
de_de: Schlechtes Einfügen einer Hypermatrix.
ja_jp: 多次元配列の不正な差し込みです。
pl_pl: Złe wprwadzenie hipermacierzy.

source: Incompatible hypermatrix extraction.
de_de: Inkompatible Extraktion einer Hypermatrix.
ja_jp: 互換性がない多次元配列の抽出です。
pl_pl: Niekompatybilne wyprowadzenie hipermacierzy.

source: %s: ''dims'' can not be used as a field name.
de_de: %s: ''dims'' kann nicht als Feldname verwendet werden.
ja_jp: %s: ''dims'' は項目名として使うことができません。
pl_pl: %s: ''dims'' nie może zostać użyte jako nazwa pola.

source: %s: Wrong number of input argument(s) : an even number is expected.
de_de: %s: Falsche Anzahl Eingabeargumente: gerade Anzahl erwartet.
ja_jp: %s: 入力引数の数が不正です: 偶数を想定します。
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych : Oczekiwano liczb parzystych.

source: %s: Wrong number of input argument(s): %d expected.
de_de: %s: falsche Anzahl von Eingangsargumenten: %d erwartet.
ja_jp: %s: 入力引数(s)で不正な数: %d を想定します。
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano %d.

source: %s: Wrong number of input arguments: %d expected
de_de: %s: falsche Anzahl von Eingangsargumenten: %d erwartet
ja_jp: %s: 入力引数で不正な数値: %d が想定されます。
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano %d.

source: %s: Wrong type for input argument #%d: A string expected.
de_de: %s: falscher Typ für Eingangsargument #%d: eine Zeichenkette erwartet.
ja_jp: %s: 入力引数 #%d で不正な型: 文字列を想定します。
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: Oczekiwano wartości typu string.

source: %s: Wrong type for input argument #%d: struct array expected.
de_de: %s: falscher Typ für Eingangsargument #%d: ein strukturiertes Datenfeld erwartet.
ja_jp: %s: 入力引数 #%d で不正な型: 構造配列を想定します。
pl_pl: %s: Nieprawidłowy typ dla argumentu wejściowego #%d: oczekiwano struktury tablicy.

source: %s: field name ''%s'' defined twice.
de_de: %s: Feldname ''%s'' doppelt definiert.
ja_jp: %s: 項目名 "%s" 定義は重複します。
pl_pl: %s: Nazwa pola ''%s'' zdefiniowana jest dwa razy.

source: Bad (%d th) index in hypermatrix extraction.
de_de: Falscher (%d th) Index in der Extraktion einer Hypermatrix.
ja_jp: 多次元配列 抽出の (%d 番目) インデックスが不正
pl_pl: Zły (%d) indeks w wyprowadzeniu hipermacierzy.

source: Too many arguments in the stack, edit stack.h and enlarge intersiz.
de_de: Zu viele Argumente im Stapel, editieren Sie stack.h und vergrößern Sie intersiz
ja_jp: スタックの多すぎる引数です、stack.h を編集して intersiz を大きくして下さい。
pl_pl: Zbyt wiele parametrów w stosie, edytuj stack.k i zwiększ intersiz.
