Repository: ScilabOrg/scilab
Catalog: scilab/modules/sound/locales/*/sound.po
Languages: fr_fr, ru_ru, zh_cn

source: %s: Wrong number of input arguments: %d to %d expected.
fr_fr: %s: Mauvais nombre d'arguments d'entrée: %d à %d attendus.
ru_ru: %s: Неверное количество аргументов: Ожидалось от %d до %d.
zh_cn: %s：输入参数的数目错误：应该为%d到%d个参数。

source: %s: Cannot open file %s.
fr_fr: %s: Ne peut pas ouvrir le fichier %s.
ru_ru: %s: Не удалось открыть файл %s.
zh_cn: %s：无法打开文件%s。

source: %s: An error occurred: %s
fr_fr: %s: Une erreur s'est produite: %s
ru_ru: %s: Произошла ошибка: %s
zh_cn: %s：出现错误：%s

source: %s: Wrong value for input argument #%d: Must be %s, an integer or a vector of 2 integers.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° %d: Doit être %s, un entier ou un vecteur de 2 entiers.
ru_ru: %s: Неверное значение аргумента #%d: Должно быть %s, целым числом или вектором из двух целых.
zh_cn: %s：输入参数#%d的值错误：必须为%s，一个整数或包含两个整数的向量。

source: %s: Wrong value for input argument: Index range must be specified as a scalar or 2-element vector.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée: La plage d'index doit être spécifiée sous la forme d'un scalaire ou d'un vecteur de 2 éléments.
ru_ru: %s: Неверное значение аргумента: Указатель в интервале должен задаваться как скаляр или двухэлементный вектор.
zh_cn: %s：输入参数的值错误：索引范围必须用一个标量或者包含两个元素的向量来指定。

source: %s: An error occurred: Data compression format %s is not supported.
fr_fr: %s: Une erreur est survenue: Le format de compression de donnée %s n'est pas supporté.
ru_ru: %s: Произошла ошибка: Формат сжатия данных %s не поддерживается.
zh_cn: %s：一个错误发生：不支持格式%s的数据压缩。

source: %s: Wrong number of input argument(s): At least %d expected.
fr_fr: %s: Mauvais nombre d'argument(s) en entrée: Au moins %d attendus.
ru_ru: %s: Неверное количество аргументов: Ожидалось как минимум %d.
zh_cn: %s：输入参数的数目错误：至少%d个。

source: %s: Wrong values for input argument: Filename must be a string.
fr_fr: %s: Mauvaise valeurs pour l'argument d'entréet: Filename doit être une chaîne de caractères.
ru_ru: %s: Неверное значение аргумента: Имя файла должно быть строкой.
zh_cn: %s：输入参数的值错误：文件名必须为一个字符串。

source: %s: Wrong input argument #%d: '%s' or '%s' expected.
fr_fr: %s: Mauvais argument d'entrée n° %d: '%s' ou '%s' attendu.
ru_ru: %s: Неверный аргумент #%d: Ожидался '%s' или '%s'.
zh_cn: %s：输入参数#%d错误：应该为'%s'或'%s'。

source: Cannot play file.
fr_fr: Ne peux pas jouer le fichier.
ru_ru: Не удалось проиграть файл.
zh_cn: 无法播放文件。

source: Scilab sound module not installed.
fr_fr: Le module Scilab sound n'est pas installé.
ru_ru: Модуль Scilab 'sound' не установлен.
zh_cn: Scilab sound模块没有被安装。

source: %s: .wav input file must be a file, not a pipe.
fr_fr: %s: le fichier d'entrée .wav doit être un fichier et pas une pipe.
ru_ru: %s: входной .wav файл должен быть файлом, а не каналом (pipe).
zh_cn: %s：.wav输入文件必须是一个文件，而不能是管道（pipe）。

source: %s : not a RIFF file.
fr_fr: %s : pas un fichier RIFF.
ru_ru: %s : не RIFF-файл.
zh_cn: %s：不是一个RIFF文件。

source: %s: not a WAVE file.
fr_fr: %s : pas un fichier WAVE.
ru_ru: %s: не WAVE-файл.
zh_cn: %s：不是一个WAVE文件。

source: %s: missing fmt spec.
ru_ru: %s: отстутствует определение fmt.
zh_cn: %s：缺少fmt规格。

source: %s : fmt chunk is too short
ru_ru: %s : порция данных fmt слишком мала
zh_cn: %s：fmt块太短。

source: %s: this WAV file is in Microsoft Official Unknown format.
fr_fr: %s: ce fichier WAV est dans un format Microsoft Officiel Inconnu.
ru_ru: %s: этот WAV-файл в формате Microsoft Official Unknown.
zh_cn: %s：该WAV文件是Microsoft Official Unknown格式。

source: %s: user options overiding style read in .wav header
fr_fr: %s: les options utilisateur surpassent le style de lecture de l'entête .wav
ru_ru: %s: пользовательские опции перекрывает чтение стиля в заголовке .wav
zh_cn: %s：用户选项取代了.wav头中的风格。

source: %s : this WAV file is in Microsoft ADPCM format.
fr_fr: %s : ce fichier WAV est dans un format Microsoft ADPCM.
ru_ru: %s : этот WAV-файл в формате Microsoft ADPCM.
zh_cn: %s：该WAV文件是Microsoft ADPCM格式。

source: %s: User options overiding style read in .wav header.
fr_fr: %s: les options utilisateur surpassent le style de lecture de l'entête .wav.
ru_ru: %s: пользовательские опции перекрывает чтение стиля в заголовке .wav
zh_cn: %s：用户选项取代了.wav头中的风格。

source: %s: User options overiding style read in .wav header
fr_fr: %s: les options utilisateur surpassent le style de lecture de l'entête .wav
ru_ru: %s: пользовательские опции перекрывает чтение стиля в заголовке .wav
zh_cn: %s：用户选项取代了.wav头中的风格。

source: %s: this WAV file is in OKI ADPCM format.
fr_fr: %s: ce fichier WAV est OKI Format ADPCM.
ru_ru: %s: этот WAV-файл в формате OKI ADPCM.
zh_cn: %s：该WAV文件是OKI ADPCM格式。

source: %s: this WAV file is in Digistd format.
fr_fr: %s: ce fichier WAV est dans un format Digistd.
ru_ru: %s: этот WAV-файл в формате Digistd.
zh_cn: %s：该WAV文件是Digistd格式。

source: %s: this WAV file is in Digifix format.
fr_fr: %s: ce fichier WAV est dans un format Digifix.
ru_ru: %s: этот WAV-файл в формате Digifix.
zh_cn: %s：该WAV文件是Digifix格式。

source: %s: this WAV file is in IBM U-law format.
fr_fr: %s: ce fichier WAV est dans un format IBM Loi U.
ru_ru: %s: этот WAV-файл в формате IBM U-law.
zh_cn: %s：该WAV文件是IBM U-law格式。

source: %s: this WAV file is in IBM A-law format.
fr_fr: %s: ce fichier WAV est dans un format IBM Loi A.
ru_ru: %s: этот WAV-файл в формате IBM A-law.
zh_cn: %s：该WAV文件是IBM A-law格式。

source: %s: this WAV file is in IBM ADPCM format.
fr_fr: %s: ce fichier WAV est dans un format IBM ADPCM.
ru_ru: %s: этот WAV-файл в формате IBM ADPCM.
zh_cn: %s：该WAV文件是IBM ADPCM格式。

source: %s: don't understand format.
fr_fr: %s: ne comprends pas le format.
ru_ru: %s: формат не распознан.
zh_cn: %s：无法分析格式。

source: User options overiding channels read in .wav header
fr_fr: Les options utilisateur surpassent les lectures de canaux dans l'entête .wav
ru_ru: Пользовательские опции перекрывают количество каналов прочитанное из .wav-заголовка
zh_cn: 用户选项替代了.wav头中的通道。

source: User options overiding rate read in .wav header
fr_fr: Les options utilisateur surpassent la période d'échantillonnage de lecture dans l'entête .wav
ru_ru: Пользовательские опции перекрывают частоту дискретизации прочитанную из .wav-заголовка
zh_cn: 用户选项替代了.wav头中的速率。

source: %s: User options overiding size read in .wav header.
fr_fr: %s: Les options utilisateur surpassent la taille de lecture dans l'entête .wav.
ru_ru: %s: Пользовательские опции перекрывают размер прочитанный из .wav-заголовка.
zh_cn: %s：用户选项替代了.wav头中的大小。

source: %s: Incorrect .wav size.
fr_fr: %s: Taille .wav incorrecte.
ru_ru: %s: Некорректный размер .wav.
zh_cn: %s：不正确的.wav大小。

source: %s: missing data chunk.
fr_fr: %s: morceau de donnée manquant.
ru_ru: %s: отсутствует чанк данных.
zh_cn: %s：缺少数据块。

source: Reading Wave file: %s format, %d channel%s, %d samp/sec
fr_fr: Lecture du fichier Wave: format %s, canal %d%s, %d ech./sec
ru_ru: Чтеник Wave-файла: формат %s, каналов %d %s, %d отсчётов в секунду
zh_cn: 读Wave文件：%s格式，%d通道%s，%d采样/秒。

source: %d byte/sec, %d block align, %d bits/samp, %u data bytes
ru_ru: %d байт/сек, %d выравнивание блока, %d бит/отсчёт, %u байт данных
zh_cn: %d字节/秒，%d块对齐，%d位/采样，%u数据字节

source: Premature EOF on .wav input file.
fr_fr: EOF prématuré dans le fichier d'entrée .wav.
ru_ru: Преждевременный конец файла (EOF) во входном .wav-файле.
zh_cn: 在.wav输入文件中提前出现了文件结束符EOF。

source: Length in output .wav header will wrong since can't seek to fix it.
zh_cn: 在输出的.wav头中的长度可能错误，因为不能修复。

source: User options overiding style written to .wav header.
fr_fr: Les options utilisateur surpassent le style écrit dans l'entête .wav.
zh_cn: 用户选项替代了.wav头中的风格。

source: Sciprinting - writing bad .wav file using %s
zh_cn: Sciprinting - 使用%s写出错误的.wav文件。

source: Sciprinting - writing bad .wav file using unsigned data and %d bits/sample.
fr_fr: Sciprinting - écrit un mauvais fichier .wav en utilisant des données non signées %d bits/echantillon.
zh_cn: Sciprinting - 使用无符号数据和%d位/采样写出错误的.wav文件。

source: Sciprinting - writing bad .wav file using signed data and %d bits/sample.
fr_fr: Sciprinting - écrit un mauvais fichier .wav en utilisant des données signées et %d bits/échantillon.
zh_cn: Sciprinting - 使用有符号数据和%d位/采样写出错误的.wav文件。

source: Sciprinting - writing bad .wav file using A-law data and %d bits/sample.
fr_fr: Sciprinting - écrit un mauvais fichier .wav en utilisant des données au format loi A et %d bits/échantillon.
zh_cn: Sciprinting - 使用A-law数据和%d位/采样写出错误的.wav文件。

source: Sciprinting - writing bad .wav file using U-law data and %d bits/sample.
fr_fr: Sciprinting - écrit un mauvais fichier .wav en utilisant des données au format loi U et %d bits/échantillon.
zh_cn: Sciprinting - 使用U-law数据和%d位/采样写出错误的.wav文件。

source: Writing Wave file: %s format, %d channel%s, %d samp/sec
fr_fr: Ecriture d'un fichier Wave: format %s, %d canaux%s, %d éch./sec
zh_cn: 写Wave文件：%s格式，%d通道%s，%d采样/秒

source: %d byte/sec, %d block align, %d bits/samp
fr_fr: %d byte/sec, %d align. bloc, %d bits/éch.
zh_cn: %d字节/秒，%d快对齐，%d位/采样

source: Finished writing Wave file, %u data bytes
fr_fr: Fin d'écriture du fichier Wave, %u bytes de données
zh_cn: 写Wave文件结束，%u字节。

source: Sorry, can't rewind output file to rewrite .wav header.
zh_cn: 抱歉，不能返回输出文件来重写.wav头。

source: Can't open input file '%s': %s
fr_fr: Ne peux pas ouvrir le fichier '%s': %s
ru_ru: Не удалось открыть входной файл '%s': %s
zh_cn: 无法打开输入文件'%s':%s

source: Error while reading
fr_fr: Erreur pendant la lecture
ru_ru: Ошибка в процессе чтения
zh_cn: 读数据时发生错误

source: Input file: using sample rate %lu
fr_fr: Fichier d'entrée: utiliser la période d'échantillonnage %lu
ru_ru: Входной файл: используется частота сэмплов %lu
zh_cn: 输入文件：使用采样率%lu

source: size %s, style %s, %d %s
fr_fr: dimension %s, style %s, %d %s
ru_ru: размер %s, стиль %s, %d %s
zh_cn: 大小%s，风格%s，%d %s

source: Sorry wav file too big
fr_fr: Désole fichier wav trop gros
ru_ru: Простите, wav-файл слишком велик
zh_cn: 抱歉，wav文件太大。

source: Can't open output file '%s': %s
fr_fr: Ne peux pas ouvrir le fichier de sorti '%s': %s
ru_ru: Не удалось открыть выходной файл '%s': %s
zh_cn: 无法打开输出文件'%s'：%s

source: Sampling rate for %s file was not given
fr_fr: La période d'échantillonnage pour le fichier %s file n'a pas été donnée
ru_ru: Не задана частота сэмплов для файла %s
zh_cn: 没有指定%s文件的采样率，

source: Sampling rate %lu for %s file is bogus
fr_fr: La période d'échantillonnage %lu pour le fichier %s est mauvaise
ru_ru: Частота сэмплов %lu для файла %s ошибочна
zh_cn: 采样率%lu用于%s文件是假（bogus）的。

source: Data size was not given for %s file
fr_fr: La dimension des données n'a pas été donnée pour le fichier %s
ru_ru: Размер данных не был задан для файла %s
zh_cn: 没有指定%s文件的数据大小。

source: Data style was not given for %s file
fr_fr: Le style des données n'a pas été donné pour le fichier %s
ru_ru: Стиль данных не был задан для файла %s
zh_cn: 没有为%s文件制定数据风格。

source: No U-Law support for shorts
zh_cn: U-Law 编码不支持 shorts

source: No A-Law support for shorts
zh_cn: A-Law 编码不支持 shorts

source: Drop through in rawread!
zh_cn: rawread调用失败！

source: Sorry, don't have code to read %s, %s
fr_fr: Désolé, il n'y a pas de code pour lire %s, %s
ru_ru: Простите, нет кода для чтения %s, %s
zh_cn: 抱歉，没读%s，%s的代码

source: No U-Law support for shorts (try -b option ?)
fr_fr: Pas de supports pour la loi U pour les shorts (avez vous essayé l'option -b ?)
zh_cn: U-Law 编码不支持 shorts（尝试 -b 选项？）

source: No A-Law support for shorts (try -b option ?)
fr_fr: Pas de supports pour la loi A pour les shorts (avez vous essayé l'option -b ?)
zh_cn: A-Law 编码不支持 shorts（尝试 -b 选项？）

source: Drop through in rawwrite!
zh_cn: rawwrite调用失败！

source: Sorry, don't have code to write %s, %s
fr_fr: Désolé, il n'y a pas de code pour écrire %s, %s
ru_ru: Простите, нет кода для записи %s, %s
zh_cn: 抱歉，没写%s，%s的代码

source: Microsoft Official Unknown
fr_fr: Microsoft Officiel Inconnu

source: Microsoft ADPCM
fr_fr: Microsoft PCM

source: Microsoft A-law
fr_fr: Microsoft loi A

source: Microsoft U-law
fr_fr: Microsoft loi U

source: Digistd format.
fr_fr: Format Digistd.

source: Digifix format.
fr_fr: Format Digifix.

source: IBM U-law format.
fr_fr: Format IBM loi U.

source: IBM A-law
fr_fr: IBM loi A

source: Unknown
fr_fr: Inconnu
