Repository: ScilabOrg/scilab
Catalog: scilab/modules/core/locales/*.po
Languages: fr_fr

source: %s: Wrong type for input argument #%d: A real expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Un réel attendu.

source: %s: Wrong size for input argument #%d: A scalar expected.
fr_fr: %s : Dimension erronée de l'argument d'entrée n°%d : Un scalaire attendu.

source: %s: Wrong type for input argument #%d: A scilab function expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Une fonction Scilab attendue.

source: results may be inaccurate. rcond = %s1
fr_fr: Les résultats peuvent être inexacts. rcond = %s1

source: %s: Wrong type for input argument #%d: Matrix of strings expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Une matrice de chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: String expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Une chaîne de caractères attendue.

source: %s: Can not read input argument #%d.
fr_fr: %s : Impossible de lire l'argument d'entrée n°%d.

source: %s: Wrong type for argument #%d: Real scalar expected.
fr_fr: %s : Type erroné de l'argument %d : Un scalaire réel attendu.

source: %s: Wrong size for argument #%d: Real scalar expected.
fr_fr: %s : Dimension erronée de l'argument %d : Un scalaire réel attendu.

source: %s: No more memory.
fr_fr: %s : Plus de mémoire disponible.

source: %s: Wrong value for input argument #%d: An integer value expected.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Une valeur entière attendue.

source: %s: Memory allocation error.
fr_fr: %s : Erreur d'allocation mémoire.

source: %s: Wrong type for input argument #%d: An integer value expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Un entier attendu.

source: %s: Wrong type for input argument #%d.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d.

source: %s: Wrong type for input argument.
fr_fr: %s : Type erroné de l'argument d'entrée.

source: %s: Wrong size for input argument #%d.
fr_fr: %s : Dimension erronée de l'argument d'entrée n°%d.

source: %s: Wrong value for input argument #%d: Value greater than 0 expected.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Valeur plus grande que 0 attendue.

source: %s: Wrong type for input argument #%d: A scalar expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Un scalaire attendu.

source: %s: Wrong value for input argument #%d: An integer expected.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Un entier attendu.

source: %s: Wrong value for input argument #%d: '%s' or '%s' expected.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : '%s' ou '%s' attendu.

source: %s: Wrong value for input argument #%d: Must be in the interval [%d, %d].
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Doit être dans l'intervalle [%d, %d].

source: %s: Wrong value for input argument #%d.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d.

source: %s: Wrong type for input argument #%d: A string or a scalar integer value expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Une chaîne de caractères ou une valeur entière scalaire attendue.

source: %s: Wrong value for input argument #%d: '0' or '1' expected.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : '0' ou '1' attendu.

source: %s: Wrong type for inputs arguments.
fr_fr: %s : Type erroné des arguments d'entrée.

source: %s: Wrong value for input argument #%d: %d, %d or %d expected.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : %d, %d ou %d attendu.

source: %s: The file %s does not exist.
fr_fr: %s : Le fichier %s n'existe pas.

source: %s: Wrong type of input argument #%d: String expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Une chaîne de caractères attendue.

source: %s: Wrong value for input argument #%d: "%s" expected.
fr_fr: %s : Valeur erronée de l'argument d'entrée %d : "%s" attendu.

source: %s: Wrong type for input arguments #%d or #%d: Strings expected.
fr_fr: %s : Type erroné des arguments d'entrée n°%d ou n°%d : Des chaînes de caractères attendues.

source: Warning: Problems with %s.
fr_fr: Attention : Problèmes avec %s.

source: %s: Wrong size for input argument #%d: String expected.
fr_fr: %s : Dimension erronée de l'argument d'entrée n°%d : Une chaîne de caractères attendue.

source: %s: Wrong file version.xml %s.
fr_fr: %s: fichier version.xml incorrect %s.

source: %s: Wrong module name %s.
fr_fr: %s : Nom de module erroné %s.

source: %s: Wrong value for input argument #%d: '%s' expected.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : '%s' attendu.

source: %s: Wrong type for input arguments #%d and #%d: Strings expected.
fr_fr: %s : Type erroné des arguments d'entrée n°%d et n°%d : Des chaînes de caractères attendues.

source: %s: Cannot allocate memory.
fr_fr: %s: Ne peut allouer de la mémoire.

source: %s: Out of bounds value. Not in [%lu,%lu].
fr_fr: %s : Hors des valeurs limites. Pas dans [%lu,%lu].

source: %s: Wrong size for input argument #%d: Scalar expected.
fr_fr: %s : Dimension erronée de l'argument d'entrée n°%d : Un scalaire attendu.

source: %s: Wrong type for input argument #%d: Scalar, '%s' or '%s'.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Scalaire, '%s' ou '%s'.

source: %s: Wrong size for input argument #%d: A boolean expected.
fr_fr: %s : Dimension erronée de l'argument d'entrée n°%d : Un booléen attendu.

source: %s: Wrong type for input argument #%d: A boolean expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Un booléen attendu.

source: %s: Wrong value for input argument #%d: A int expected.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Un int attendu.

source: %s: Wrong type for input argument #%d: A string expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Une chaîne de caractères attendue.

source: %s: Wrong size for input argument #%d: A string expected.
fr_fr: %s : Dimension erronée de l'argument d'entrée n°%d : Une chaîne de caractères attendue.

source: %s: function-name is incorrect.
fr_fr: %s : function-name est incorrect.

source: %s: Wrong value for input argument #%d: Must be %s.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Doit être %s.

source: %s: Wrong type for input argument #%d: A scalar or a string expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Un scalaire ou une chaîne de caractères attendu.

source: %s: Impossible to read %s gateway.
fr_fr: %s : Impossible de lire l'interface %s.

source: %s: Invalid module name : %s.
fr_fr: %s : Nom de module invalide : %s.

source: %s: Cannot allocate memory. %s
fr_fr: %s : Impossible d'allouer de la mémoire. %s

source: %s: Cannot allocate this quantity of memory.
fr_fr: %s : Impossible d'allouer la quantité de mémoire indiquée.

source: %s: The requested size is smaller than the minimal one.
fr_fr: %s : La dimension demandée est plus petite que le minimum autorisé.

source: %s: Unable to create (or resize) the stack (probably a malloc error).
fr_fr: %s : Impossible de créer (ou de redimensionner) la pile (probablement du à une erreur de malloc).

source: %s: Unknown error.
fr_fr: %s : Erreur inconnue.

source: %s: Wrong number of input arguments: %d or %d expected.
fr_fr: %s : Nombre erroné d'arguments d'entrée : %d ou %d attendus.

source: %s: '%s' already exists.
fr_fr: %s: '%s' existe déjà.

source: %s: Unknown Error.
fr_fr: %s: Erreur inconnue.

source: WARNING: %s
fr_fr: ATTENTION : %s

source: WARNING: %s
fr_fr: AVERTISSEMENT : %s

source: Internal Functions:
fr_fr: Fonctions internes :

source: Commands:
fr_fr: Commandes :

source: %s: Wrong number of input arguments.
fr_fr: %s : Nombre erroné d'arguments d'entrée.

source: %s: Wrong number of output arguments: %d expected.
fr_fr: %s : Nombre erroné d'arguments de sortie : %d attendus.

source: %s: Wrong value for input argument #%d: '%s', '%s', '%s' or '%s' expected.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : '%s', '%s', '%s' ou '%s' attendu.

source: %s: Wrong value for input argument #%d: '%s', '%s', '%s' or '%s'.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : '%s', '%s', '%s' or '%s'.

source: %s: Wrong value for input argument #%d: '%s', '%s' or '%s'.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : '%s', '%s' ou '%s'.

source: %s: Wrong value for input argument #%d: '%s', '%s', '%s' expected. Input argument #%d must be '%s'.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : '%s', '%s', '%s' attendu. L'argument d'entrée n°%d doit être '%s'.

source: using %10d elements out of %10d.
fr_fr: utilise %10d éléments parmi %10d.

source: and %10d variables out of %10d.
fr_fr: et %10d variables parmi %10d.

source: Your variables are:
fr_fr: Vos variables sont :

source: Your global variables are:
fr_fr: Vos variables globales sont :

source: Fatal Error: Can't create table for scilab functions.
fr_fr: Erreur fatale : Impossible de créer la table des fonctions Scilab.

source: Error: Impossible to define %s environment variable.
fr_fr: Erreur : Impossible de définir la variable d'environnement %s.

source: Impossible to load %s library: %s
fr_fr: Impossible de charger la bibliothèque %s : %s

source: Impossible to load %s function in %s library: %s
fr_fr: Impossible de charger la fonction %s dans la bibliothèque %s : %s

source: Impossible to call %s in %s library: %s
fr_fr: Impossible d'appeler %s dans la bibliothèque %s : %s

source: Error: Not a valid primitive ID %d.
fr_fr: Erreur : Ce n'est pas un identifiant de primitive valide (ID = %d).

source: Aborting current computation
fr_fr: Abandon du calcul en cours

source: Error: Not a valid gateway ID %d. Should be between %d and %d.
fr_fr: Erreur : %d n'est pas un identifiant de passerelle valide. Doit être compris entre %d et %d.

source: The SCI environment variable is not set.
fr_fr: La variable d'environnement SCI n'est pas définie.

source: Cannot load the module declaration file: %s.
fr_fr: Impossible de charger le fichier de déclaration de module : %s.

source: Warning: Could not find %s
fr_fr: Attention : Ne peut pas trouver %s

source: Error: Could not parse file %s.
fr_fr: Erreur : Impossible d'analyser (parser) le fichier %s.

source: %s module not found.
fr_fr: Module %s introuvable.

source: Error: Not a valid module file %s (encoding not '%s') Encoding '%s' found.
fr_fr: Erreur : Fichier module %s invalide (l'encodage n'est pas '%s') Encodage '%s' trouvé.

source: Warning: "%d.%s ..." is interpreted as "%d.0%s ...". Use "%d .%s ..." for element wise operation
fr_fr: Attention : "%d.%s ..." est interprété comme "%d.0%s ...". Utilisez "%d .%s ..." pour une opération élément par élément

source: SCI environment variable not defined.
fr_fr: La variable d'environnement SCI n'est pas définie.

source: Warning
fr_fr: Attention

source: SCIHOME not defined.
fr_fr: La variable SCIHOME n'est pas définie.

source: TMPDIR not defined.
fr_fr: La variable TMPDIR n'est pas définie.

source: %s: Wrong type for input argument #%d: Compiled macro expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Une macro compilée attendue.

source: %s: stack size exceeded (Use stacksize function to increase it).
fr_fr: %s : Taille de la pile dépassée (utilisez la fonction stacksize pour augmenter la taille de la pile).

source: %s: Out of code.
fr_fr: %s : Plus de code.

source: %s: Wrong %s value %d instead of %d.
fr_fr: %s : Valeur erronée %s %d au lieu de %d.

source: %s: code %d not yet implemented.
fr_fr: %s : code %d pas encore implémenté.

source: %s: Unknown code %d at index2 %d.
fr_fr: %s : Code inconnu %d à index2 %d.

source: %s: Old version of if and while not implemented.
fr_fr: %s : Ancienne version de if et while pas implémentée.

source: %s: Wrong type value.
fr_fr: %s : Valeur de type erronée.

source: %s: Unknown operator %d.
fr_fr: %s : Opérateur %d inconnu.

source: %s: Wrong fromwhat value %s.
fr_fr: %s : Valeur erronée fromwhat %s.

source: %s: wrong code %d.
fr_fr: %s : Code erroné %d.

source: Error: Could not parse file %s
fr_fr: Erreur : Impossible d'analyser le fichier %s

source: Error: Not a valid version file %s (should start with <MODULE_VERSION> and contain <VERSION major='' minor='' maintenance='' revision='' string=''>)
fr_fr: Erreur : Fichier version %s invalide (il devrait commencer par <MODULE_VERSION> et contenir <VERSION major='' minor='' maintenance='' revision='' string=''>)

source: Error: Not a valid version file %s (encoding not 'utf-8') Encoding '%s' found
fr_fr: Erreur : Fichier version %s invalide (l'encodage n'est pas 'utf-8') Encodage '%s' trouvé

source: Error: could not parse file %s
fr_fr: Erreur : Impossible d'analyser (parser) le fichier %s

source: Error: Memory allocation.
fr_fr: Erreur d'allocation mémoire.

source: Error: Not a valid gateway file %s (should start with <GATEWAY> and contain <PRIMITIVE gatewayId='' primitiveId='' primitiveName=''>)
fr_fr: Erreur : Fichier interface %s invalide (devrait commencer par <GATEWAY> et contenir <PRIMITIVE gatewayId='' primitiveId='' primitiveName=''>)

source: Error: Not a valid gateway file %s (encoding not 'utf-8') Encoding '%s' found
fr_fr: Erreur : Fichier interface %s invalide (l'encodage n'est pas 'utf-8') Encodage '%s' trouvé

source: Error returning tlist, memory full.
fr_fr: Erreur en retournant un tlist, mémoire pleine.

source: tlist not completely filled.
fr_fr: tlist partiellement remplie.

source: List full.
fr_fr: Liste pleine.

source: Unexpected opcode, please report into the Scilab bug tracker.
fr_fr: Code opérateur inattendu. Merci de rapporter un bug sur le bug tracker Scilab.

source: Functions compiled with very old versions are no more handled.
fr_fr: Les fonctions compilées avec de très anciennes versions ne sont plus supportées.

source: No space to allocate Scilab stack.
fr_fr: Pas assez de mémoire disponible pour allouer le coeur de Scilab.

source: A fatal error has been detected by Scilab. Your instance will probably quit unexpectedly soon. If a graphic feature has been used, this might be caused by the system graphic drivers. Please try to update them and run this feature again. You can report a bug on %s with: * a sample code which reproduces the issue * the result of [a, b] = getdebuginfo() * the following information: %s %s
fr_fr: Une erreur grave a été détectée par Scilab. Votre instance va probablement se fermer inopinément. Ce problème provient sûrement de vos pilotes de cartes graphiques à l'utilisation d'une fonctionnalité graphique dans Scilab. Veuillez les mettre à jour et ré-essayer . Vous pouvez rapporter un bug sur %s avec : * un extrait de code qui reproduit le bug * le résultat de [a, b] = getdebuginfo() * les informations suivantes : %s %s

source: stack size exceeded!
fr_fr: Taille de la pile dépassée

source: Use stacksize function to increase it.
fr_fr: Utilisez la fonction stacksize pour l'augmenter.

source: Memory used for variables: %d
fr_fr: Mémoire utilisée pour les variables : %d

source: Intermediate memory needed: %d
fr_fr: Mémoire intermédiaire requise : %d

source: Total memory available: %d
fr_fr: Mémoire totale disponible : %d

source: %s: argument %d should be a list of size at least %d.
fr_fr: %s : L'argument %d doit être une liste de taille au moins %d.

source: %s: Wrong type for argument #%d: Real matrix expected.
fr_fr: %s : Type erroné de l'argument %d : Une matrice réelle attendue.

source: %s: Wrong size for argument #%d: (%d,%d) expected.
fr_fr: %s : Dimension erronée de l'argument %d : (%d,%d) attendu.

source: %s: Wrong type for element %d of argument #%d: Real or Complex matrix expected.
fr_fr: %s : Type erroné de l'élément %d de l'argument n°%d : Une matrice réelle ou complexe attendue.

source: %s: Wrong type for argument #%d: Real or Complex matrix expected.
fr_fr: %s : Type erroné de l'argument n°%d : Une matrice réelle ou complexe attendue.

source: %s: Too many variables.
fr_fr: %s : Trop de variables.

source: %s: Wrong type for argument #%d: List of size at least %d expected.
fr_fr: %s : Type erroné de l'argument %d : Une liste de taille au moins %d attendue.

source: %s: Wrong size for argument #%d: At least %d expected.
fr_fr: %s : Dimension erronée de l'argument %d : Au moins %d attendu.

source: %s: Wrong type for element %d of argument #%d: Boolean matrix expected.
fr_fr: %s : Type erroné de l'élément %d de l'argument n°%d : Une matrice booléenne attendue.

source: %s: Wrong type for argument #%d: Boolean matrix expected.
fr_fr: %s : Type erroné de l'argument %d : Une matrice booléenne attendue.

source: %s: Wrong type for element %d of argument #%d: Sparse matrix expected.
fr_fr: %s : Type erroné de l'élément %d de l'argument n°%d : Une matrice creuse attendue.

source: %s: Wrong type for argument #%d: Sparse matrix expected.
fr_fr: %s : Type erroné de l'argument %d : Une matrice creuse attendue.

source: %s: Wrong type for element %d of argument #%d: Vector expected.
fr_fr: %s : Type erroné de l'élément %d de l'argument n°%d : Un vecteur attendu.

source: %s: Wrong type for argument #%d: Vector expected.
fr_fr: %s : Type erroné de l'argument %d : Un vecteur attendu.

source: %s: Wrong type for argument #%d: Real vector expected.
fr_fr: %s : Type erroné de l'argument %d : Un vecteur réel attendu.

source: %s: Wrong size for argument #%d: %d expected.
fr_fr: %s : Dimension erronée de l'argument %d : %d attendu.

source: %s: Wrong type for element %d of argument #%d: Scalar expected.
fr_fr: %s : Type erroné de l'élément %d de l'argument n°%d : Un scalaire attendu.

source: %s: Wrong type for argument #%d: Scalar expected.
fr_fr: %s : Type erroné de l'argument n°%d : Un scalaire attendu.

source: %s: Wrong type for element %d of argument #%d: Matrix of strings expected.
fr_fr: %s : Type erroné de l'élément %d de l'argument n°%d : Une matrice de chaîne de caractères attendue.

source: %s: Wrong type for argument #%d: Matrix of strings expected.
fr_fr: %s : Type erroné de l'argument %d : Une matrice de chaîne de caractères attendue.

source: %s: Wrong type for argument #%d: List expected.
fr_fr: %s : Type erroné du paramètre %d : Une liste attendue.

source: %s: Wrong type for argument #%d: Polynomial matrix expected.
fr_fr: %s : Type erroné de l'argument %d : Une matrice polynomiale attendue.

source: %s: Wrong type for argument #%d: Polynomial expected.
fr_fr: %s : Type erroné de l'argument %d : Un polynôme attendu.

source: %s: Wrong type for argument #%d: Working int matrix expected.
fr_fr: %s : Type erroné de l'argument n°%d : Une matrice de travail d'entiers attendue.

source: %s: Wrong type for element %d of argument #%d: Row vector expected.
fr_fr: %s : Type erroné de l'élément %d de l'argument n°%d : Un vecteur ligne attendu.

source: %s: Wrong type for argument #%d: Row vector expected.
fr_fr: %s : Type erroné de l'argument %d : Un vecteur ligne attendu.

source: %s: argument %d >(%d) should be a column vector.
fr_fr: %s : L'argument %d >(%d) devrait être un vecteur colonne.

source: %s: Wrong type for argument #%d: Column vector expected.
fr_fr: %s : Type erroné de l'argument %d : Un vecteur colonne attendu.

source: %s: Wrong type for element %d of argument #%d: Pointer expected.
fr_fr: %s : Type erroné de l'élément %d de l'argument n°%d : Un pointeur attendu.

source: %s: Wrong type for argument #%d: Pointer expected.
fr_fr: %s : Type erroné de l'argument n°%d : Un pointeur attendu.

source: %s: Wrong type for argument #%d: Matrix expected.
fr_fr: %s : Type erroné de l'argument %d : Une matrice attendue.

source: %s: Subroutine '%s' not found.
fr_fr: %s : Impossible de trouver la sous-routine '%s'.

source: %s: Wrong type for argument #%d: Function or string (external function) expected.
fr_fr: %s : Type erroné de l'argument %d : Une fonction ou chaîne de caractères (fonction externe) attendue.

source: %s: Incompatible sizes.
fr_fr: %s : Tailles incompatibles.

source: %s: Optional argument %d not given and default value %s not found.
fr_fr: %s : L'argument optionnel %d n'est pas donné et la valeur par défaut %s n'est pas trouvée.

source: %f: No more space to store string arguments.
fr_fr: %f : Plus de place disponible pour stocker les arguments de type chaîne de caractères.

source: %s: Wrong type for element %d of argument #%d: Matrix of handle expected.
fr_fr: %s : Type erroné de l'élément %d de l'argument n°%d : Une matrice de handle attendue.

source: %s: Wrong type for argument #%d: Matrix of handle expected.
fr_fr: %s : Type erroné de l'argument %d : Une matrice de handle attendue.

source: %s: Wrong number of input argument(s): %d expected.
fr_fr: %s : Nombre erroné d'argument(s) d'entrée : %d attendu(s).

source: %s: Wrong number of input argument(s): %d to %d expected.
fr_fr: %s : Nombre erroné d'argument(s) d'entrée : %d à %d attendu(s).

source: %s: Wrong number of output argument(s): %d expected.
fr_fr: %s : Nombre erroné d'argument(s) de sortie : %d attendu(s).

source: %s: Wrong number of output argument(s): %d to %d expected.
fr_fr: %s : Nombre erroné d'argument(s) de sortie : %d à %d attendu(s).

source: %s: Optional arguments name=val must be at the end.
fr_fr: %s : Le paramètre optionnel name=val doit être à la fin.

source: %s: Unrecognized optional arguments %s.
fr_fr: %s : Le paramètre optionnel %s n'est pas reconnu.

source: Optional argument list is empty.
fr_fr: La liste d'arguments optionnels est vide.

source: Optional arguments list:
fr_fr: Liste d'arguments optionnels :

source: and %s.
fr_fr: et %s.

source: %s: bad call to %s! (1rst argument).
fr_fr: %s : Appel erroné sur %s (premier argument).

source: %s: (%s) too many arguments in the stack edit stack.h and enlarge intersiz.
fr_fr: %s : (%s) trop de variables dans la pile. Éditez stack.h et augmentez intersiz.

source: %s: (%s) bad third argument!
fr_fr: %s : (%s) troisième paramètre erroné !

source: %s: Wrong type for argument: Complex expected.
fr_fr: %s : Type erroné du paramètre : Un complexe attendu.

source: %s: bad call to %s!
fr_fr: %s : Appel erroné pour %s!

source: %s: argument %d > (%d) should be a complex matrix.
fr_fr: %s : Le paramètre %d > (%d) devrait être une matrice complexe.

source: %s: bad call to %s (third argument %c).
fr_fr: %s : Appel erroné pour %s (troisième paramètre %c).

source: %s: (%s) bad second argument!
fr_fr: %s : (%s) second paramètre erroné !

source: %s: createcvarfromptr: too many arguments on the stack, enlarge intersiz.
fr_fr: %s : createcvarfromptr : trop de variables sur la pile. augmentez intersiz.

source: %s: Recursion problems. Sorry ...
fr_fr: %s : Problèmes de récursion. Désolé...

source: %s: Too many names.
fr_fr: %s : Trop de noms.

source: %s: %s is not a Scilab function.
fr_fr: %s : %s n'est pas une fonction Scilab.

source: built in
fr_fr: Intégré

source: Invalid time domain.
fr_fr: Domaine de temps invalide.

source: Invalid system.
fr_fr: Système invalide.

source: A non square matrix!
fr_fr: Une matrice non carrée !

source: Invalid %c,%c matrices.
fr_fr: Matrices %c,%c invalides.

source: %s: internal error, info=%d.
fr_fr: %s : erreur interne, info=%d.

source: %s: intersiz is too small.
fr_fr: %s : intersiz est trop petit.

source: first
fr_fr: Premier

source: second
fr_fr: Deuxième

source: third
fr_fr: Troisième

source: fourth
fr_fr: Quatrième

source: %s argument
fr_fr: Paramètre %s

source: argument #%d
fr_fr: argument n°%d

source: %s and %s arguments
fr_fr: Les %s et %s paramètres

source: %s argument and argument #%d
fr_fr: %s argument et argument n°%d

source: arguments #%d and #%d
fr_fr: arguments n°%d et n°%d

source: should be square
fr_fr: devrait être carré

source: should be a vector
fr_fr: devrait être un vecteur

source: should be a row vector
fr_fr: devrait être un vecteur ligne

source: should be a column vector
fr_fr: devrait être un vecteur colonne

source: should be a scalar
fr_fr: devrait être un scalaire
