Repository: ScilabOrg/scilab
Catalog: scilab/modules/core/locales/*.po
Languages: fr_fr

source: %s: %s has wrong dimensions (%d,%d), expecting (%d,%d).
fr_fr: %s : %s a des dimensions erronées (%d,%d), (%d,%d) attendu.

source: %s: %s has wrong %s dimension (%d), expecting (%d).
fr_fr: %s : %s a une %s dimension erronée (%d), (%d) attendu.

source: %s: %s has wrong length %d, expecting (%d).
fr_fr: %s : %s a une longueur erronée %d, (%d) attendu.

source: %s: %s have incompatible dimensions (%dx%d) # (%dx%d)
fr_fr: %s : %s ont des dimensions incompatibles (%dx%d) # (%dx%d)

source: %s: %s have incompatible dimensions.
fr_fr: %s : %s ont des dimensions incompatibles.

source: %s: %s should be a list with %d-element being %s.
fr_fr: %s : %s devrait être une liste avec %d-élément étant %s.

source: square
fr_fr: carré

source: a vector
fr_fr: Un vecteur

source: a row vector
fr_fr: Un vecteur ligne

source: a column vector
fr_fr: Un vecteur colonne

source: a scalar
fr_fr: Un scalaire

source: %s: argument %d(%d) has wrong %s dimension (%d), expecting (%d).
fr_fr: %s : L'argument %d(%d) n'a pas la bonne dimension %s (%d), valeur attendue (%d).

source: GetDataFromName: variable %s not found.
fr_fr: GetDataFromName : variable %s non trouvée.

source: %s: Variable %s not found.
fr_fr: %s : Variable %s introuvable.

source: Undefined variable %s.
fr_fr: Variable indéfinie %s.

source: %s: argument must be a string.
fr_fr: %s: L'argument doit être une chaîne de caractères.

source: Unqueuing %s - No option.
fr_fr: Retire %s de la queue - Pas d'option.

source: Unqueuing %s - seq.
fr_fr: Retire %s de la queue - seq.

source: %s: Please install texmacs ATOMS module: atomsInstall('texmacs')
fr_fr: %s : Veuillez installer le module ATOMS texmacs : atomsInstall('texmacs')

source: Cannot find Windows temporary directory (1).
fr_fr: Impossible de trouver le répertoire temporaire de Windows (1).

source: Error
fr_fr: Erreur

source: Impossible to create : %s
fr_fr: Impossible de créer : %s

source: Warning: Could not resolve the realpath of %s.
fr_fr: Attention : Impossible de résoudre le chemin vers %s.

source: Error: Could not create %s: %s
fr_fr: Erreur : Impossible de créer %s: %s

source: Scilab Version Info.
fr_fr: Information sur la version de Scilab.

source: Call stack:
fr_fr: Pile d'appel :

source: End of stack
fr_fr: Fin de la pile

source: No available console ! Please use STD mode.
fr_fr: La console n'est pas disponible. Veuillez passer en mode STD.

source: Empty tab
fr_fr: Onglet vide

source: Scilab %s Console
fr_fr: Console Scilab %s

source: %s: Wrong size for input argument #%d: Integer expected.
fr_fr: %s : Dimension erronée de l'argument d'entrée n°%d : Un entier est attendu.

source: %s: Wrong type of input argument #%d: Integer expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Un entier attendu.

source: Startup execution:
fr_fr: Initialisation :

source: loading initial environment
fr_fr: Chargement de l'environnement de travail

source: Failed to execute %s:
fr_fr: Impossible d'exécuter %s :

source: &File
fr_fr: &Fichier

source: &Edit
fr_fr: &Édition

source: &Preferences
fr_fr: &Préférences

source: &Control
fr_fr: &Contrôle

source: &Toolboxes
fr_fr: Modules

source: Introduction: Getting started with Scilab
fr_fr: Introduction : Débuter avec Scilab

source: Scilab objects
fr_fr: Objets Scilab

source: Operations and numerical primitives
fr_fr: Opérations et primitives numériques

source: Online definition of function
fr_fr: Définition d'une fonction en ligne

source: Optimization and simulation
fr_fr: Optimisation et simulation

source: Systems: definition and analysis
fr_fr: Systèmes : définitions et analyse

source: Linear algebra
fr_fr: Algèbre linéaire

source: Call an external routine
fr_fr: Appeler une routine externe

source: %s: Could not find '%s': Please check that macros have been built.
fr_fr: %s : Impossible de trouver '%s' : Veuillez vérifier que les macros ont bien été compilées.

source: Checking: %s
fr_fr: Vérification : %s

source: %s: Please check: %s.
fr_fr: %s : Veuillez vérifier : %s.

source: %s: File doesn't exist: %s
fr_fr: %s : Le fichier n'existe pas : %s

source: %s: Wrong number of input argument(s): At least %d expected.
fr_fr: %s : Nombre erroné d'argument(s) d'entrée : Au moins %d attendu(s).

source: %s: Wrong type for input argument #%d: Double expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Un double attendu.

source: %s: %s is an uneditable hard coded function.
fr_fr: %s : %s est une fonction non modifiable programmée en dur.

source: %s: Unable to find Perl file: %s
fr_fr: %s : Impossible de trouver le fichier Perl : %s

source: %s: Wrong type for input argument #%d: Strings expected.
fr_fr: %s : Type erroné de l'argument d'entrée n°%d : Des chaînes de caractères attendues.

source: %s: No perl command specified.
fr_fr: %s : Commande perl non fournie.

source: %s: Unable to find Perl in '%s
fr_fr: %s : Impossible de trouver Perl dans '%s

source: %s: Unable to find Perl.
fr_fr: %s : Impossible de trouver Perl.

source: %s: System error: Command executed: %s
fr_fr: %s : Erreur système : Commande exécutée : %s.

source: %s: Wrong number of input arguments: At least %d expected.
fr_fr: %s : Nombre erroné d'arguments d'entrée : %d au moins attendus.

source: %s: Wrong value for input argument #%d: Defined variable expected.
fr_fr: %s : Valeur erronée de l'argument d'entrée n°%d : Une variable définie attendue.

source: Scilab Version:
fr_fr: Version de Scilab :

source: Operating System:
fr_fr: Système d'exploitation :

source: Java version:
fr_fr: Version Java :

source: Java runtime information:
fr_fr: Informations sur l'environnement d'exécution Java :

source: Java Virtual Machine information:
fr_fr: Informations sur la machine virtuelle Java :

source: Vendor specification:
fr_fr: Spécifications du fabricant :

source: %s called at line %s of %s
fr_fr: %s appelé à la ligne %s de %s

source: %s called at line %s of %s instruction.
fr_fr: %s appelé à la ligne %s de l'instruction %s.

source: %s called under %s
fr_fr: %s appelé sous %s

source: %s called at line %s of macro %s
fr_fr: %s appelé à la ligne %s de la macro %s

source: User variables are:
fr_fr: Vos variables sont :

source: Using %s elements out of %s
fr_fr: Utilisation des éléments %s de %s

source: by
fr_fr: par

source: Name
fr_fr: Nom

source: Size
fr_fr: Dimensions

source: Bytes
fr_fr: Octets
