Repository: ScilabOrg/scilab
Catalog: scilab/modules/scicos/locales_macros/*.po
Languages: ja_jp, pl_pl

source: %s.mo cannot be compiled
ja_jp: %s.mo を生成できませんでした。
pl_pl: %s.mo nie może być skompilowany

source: %s.mo compilation forced
ja_jp: %s.mo を強制的に生成しました。
pl_pl: %s.mo przymusowa kompilacja

source: %s.mo must be recompiled
ja_jp: %s.mo は生成されなくてはなりません。
pl_pl: %s.mo musi być skompilowane ponownie

source: Scilab is in no gui mode : Scicos is unavailable
ja_jp: Scilab が GUIモードではありません: Scicos は使用できません
pl_pl: Scilab jest w trybie bez graficznego interfejsu użytkownika : Brak Scicos

source: %s is not a valid directory
ja_jp: %s は有効なディレクトリではありません.
pl_pl: %s nie jest poprawną nazwą katalogu

source: %s is not a valid name, please change the title of the diagram.
ja_jp: %s は有効な名前ではありません, 図のタイトルを変更してください.
pl_pl: %s nie jest poprawną nazwą, proszę zmienić tytuł schematu.

source: %s: Cannot find any MO files in the following location: %s.
ja_jp: %s: MOファイルが以下の場所で見つかりませんでした: %s.
pl_pl: %s: Nie można znaleźć żadnych plików MO w następującej lokalizacji: %s.

source: %s: Diagram does not compile in pass %d.
ja_jp: %s: 図形をパス %d でコンパイルできません.
pl_pl: %s: Diagram nie kompiluje w kroku %d.

source: %s: Error: A scifunc block has not been defined.
ja_jp: %s: エラー: scifuncブロックは、定義されませんでした。
pl_pl: %s: Błąd: blok scifunc nie został zdefiniowany.

source: %s: Error: Modelica compiler (MODELICAC) is unavailable.
ja_jp: %s: エラー: Modelica(MODELICAC)コンパイラーは有効でありません。
pl_pl: %s: Błąd: kompilator Modelica (MODELICAC) jest niedostępny.

source: %s: First argument must be a Scicos diagram data structure
ja_jp: %s: 最初の引数は、Scicos 図形データ構造体でなくてはなりません
pl_pl: %s: Pierwszy parametr musi być strukturą danych schematu Scicos

source: %s: Input ports are not numbered properly.
ja_jp: %s: 入力ポートの番号付けが間違っています.
pl_pl: %s: Porty wejściowe nie są właściwie ponumerowane.

source: %s: Output ports are not numbered properly.
ja_jp: %s: 出力ポートの番号付けが間違っています.
pl_pl: %s: Porty wyjściowe nie są poprawnie ponumerowane.

source: %s: Wrong number of input arguments. Must be between %d and %d.
ja_jp: %s: 入力引数の数が不正です: %d と %d の間である必要があります。
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych. Musi być między %d i %d.

source: %s: Wrong number of input arguments: %d expected.
ja_jp: %s: 入力引数の数が間違っています: %d 個の引数を指定してください.
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano %d.

source: %s: Wrong number of output arguments: %d expected.
ja_jp: %s: 出力引数の数が間違っています: %d 個の引数を指定してください.
pl_pl: %s: Nieprawidłowa liczba argumentów wyjściowych: oczekiwano %d.

source: %s: Wrong size for input argument #%d: Single integer expected.
ja_jp: %s: 入力引数 #%d の大きさが間違っています: 整数を指定してください.
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego nr %d: oczekiwana pojedyncza liczba całkowita.

source: %s: Wrong size for input argument #%d: Single string expected.
ja_jp: %s: 入力引数 #%d の大きさが間違っています: 文字列を指定してください.
pl_pl: %s: Nieprawidłowy rozmiar dla argumentu wejściowego nr %d: oczekiwano pojedynczego łańcuchu znaków.

source: %s: Wrong size for input arguments #%d and #%d.
ja_jp: %s: 入力引数 #%d と #%d で不正なサイズです。
pl_pl: %s: Nieprawidłowy rozmiar argumentów wejściowych nr %d i nr %d.

source: %s: Wrong type for input argument #%d: Integer expected.
ja_jp: %s: 入力引数 #%d の型が間違っています: 整数を指定してください.
pl_pl: %s: Nieprawidłowy typ parametru wejściowego nr %d: Oczekiwano wartości całkowitej.

source: %s: Wrong type for input argument #%d: String expected.
ja_jp: %s: 入力引数 #%d の型が間違っています: 文字列を指定してください.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego nr %d: oczekiwano łańcuch.

source: &Edit
ja_jp: 編集(&E)
pl_pl: &Edycja

source: &File
ja_jp: ファイル(&F)
pl_pl: &Plik

source: &Tools
ja_jp: ツール(&T)
pl_pl: &Narzędzia

source: ''scicos'' is no more available, please use ''xcos'' instead.
ja_jp: ''scicos''は利用できません、代わりに''xcos'' を使ってください。
pl_pl: ''scicos'' nie jest już dostępny, proszę użyć ''xcos'' zamiast.

source: About Scicos
ja_jp: Scicosについて
pl_pl: O Scicos

source: Activate Scilab Window
ja_jp: Scilabウインドウをアクティブにする
pl_pl: Actywuj okno Scilab

source: Add a new color at the Scicos palette
ja_jp: Scicosパレットで新しい色を加えて下さい
pl_pl: Dodaj nowy kolor do palety Scicos

source: Add color
ja_jp: 色の追加
pl_pl: Dodaj kolor

source: Add new block
ja_jp: 新しいブロックの追加
pl_pl: Dodaj nowy blok

source: Align
ja_jp: 整列
pl_pl: Wyrównaj

source: An Atomic Superblock cannot contain sample clocks
ja_jp: Atomic スーパーブロックはサンプルクロックを有することができません.

source: An error occur when evaluating context:
ja_jp: コンテキストを評価する際にエラーが発生しました:

source: An unexpected error occurred while executing the menu %s:
ja_jp: メニューを実行中に予期しないエラーが発生しました %s:

source: Analyze Diagram
ja_jp: 図形を分析
pl_pl: Analizuj schemat

source: Available Parameters
ja_jp: 使用可能なパラメータ
pl_pl: Dostepne parametry

source: Background color
ja_jp: 背景色
pl_pl: Kolor tła

source: Background color ? :
ja_jp: 背景色 ? :
pl_pl: Kolor tła ? :

source: Block Documentation
ja_jp: ブロック資料
pl_pl: Dokumentacja bloku

source: Block ID font name
ja_jp: ブロックID フォント名
pl_pl: Nazwa czcionki dla ID bloku

source: Block ID font size
ja_jp: ブロックID フォントサイズ
pl_pl: Rozmiar czcionki dla ID bloku

source: BrowseTo
ja_jp: ブラウズする

source: Browser
ja_jp: ブラウズ
pl_pl: Przeglądarka

source: C Code Generation
ja_jp: Cコード生成
pl_pl: Generacja kodu C

source: Calc
ja_jp: Calc(計算)

source: Choose export format:
ja_jp: エクスポート・フォーマットを選択:
pl_pl: Wybierz format eksportu:

source: Click block to label
ja_jp: ブロックをクリックしてラベルへ
pl_pl: Kliknij na blok żeby dodać nazwę

source: Click block to resize
ja_jp: ブロックをクリックしてリサイズへ
pl_pl: Kliknij na blok żeby zmienić jego rozmiary

source: Click object to move, drag and click (left to fix, right to cancel)
ja_jp: オブジェクトをクリックして動作、ドラッグしてクリック(左ボタン:確定、右ボタン:キャンセル)

source: Click on a Super Block (without activation output) to obtain a coded block!
ja_jp: スーパ・ブロックをクリックして(活動化出力無しで)コード化されたブロックを取得します!

source: Click on a block to set or get its documentation
ja_jp: 文書を設定または取得するブロックをクリックしてください

source: Click on a port of object to be moved
ja_jp: ポートをクリックし, 移動するオブジェクトのポートをクリック

source: Click on a super block
ja_jp: スーパ・ブロックをクリックします
pl_pl: Kliknij na super blok

source: Click on an object to set or get identification
ja_jp: オブジェクトをクリックして識別をセットするかまたは取得します
pl_pl: Kliknij na obiekt, zeby ustalić lub zobaczyć jego identyfikator

source: Click on block to open graphic icon editor
ja_jp: ブロックをクリックしてグラフィック・アイコン編集を開きます
pl_pl: Kliknij na blok żeby otworzyć edytor ikonek

source: Click on block to be flipped
ja_jp: ブロックをクリックして返します
pl_pl: Kliknij na blok żeby go przewrócić

source: Click on block to be turned left
ja_jp: ブロックをクリックして左回転します
pl_pl: Kliknij na blok żeby go obrócić w prawo

source: Click on block to be turned right
ja_jp: ブロックをクリックして右回転します
pl_pl: Kliknij na blok żeby go obrócić w lewo

source: Click on block to edit its icon
ja_jp: ブロックをクリックしてアイコンを編集します
pl_pl: Kliknij na blok żeby rozpocząć edycję jego ikonkę

source: Click on object to get information on it
ja_jp: オブジェクトをクリックして関係する情報を取得します
pl_pl: Kliknij na blok żeby otrzymać informację o nim

source: Click on object to choose its color
ja_jp: オブジェクトをクリックして色を選択します
pl_pl: Kliknij na blok żeby ustawić jego kolor

source: Click on the object to duplicate, drag, click (left to copy, right to cancel)
ja_jp: 複製するオブジェクトをクリックして下さい、ドラッグしてクリック(左でコピー、右でキャンセル)

source: Click to open block or make a link
ja_jp: クリックしてブロックを開くか、またはリンクを作って下さい
pl_pl: Kliknij na blok żeby go otworzyć lub utworzyć lącznik

source: Click where you want object to be placed (right-click to cancel)
ja_jp: オブジェクトを置きたい場所でクリックします(右クリックで取り消し)

source: Close
ja_jp: 閉じる
pl_pl: Zamknij

source: Code Generation only works for a Superblock !
ja_jp: コード生成は、スーパー・ブロックのために働きます !
pl_pl: Generacja kodu działa tylko dla superbloku !

source: Code generation applies only to Super Blocks.
ja_jp: コード生成は、スーパー・ブロックにのみ適合します。
pl_pl: Generacje kodu stosuje się tylko w superblokach

source: Color
ja_jp: 色
pl_pl: Kolor

source: Compile
ja_jp: コンパイル
pl_pl: Skompiluj

source: Context
ja_jp: コンテキスト

source: Copy
ja_jp: コピー
pl_pl: Kopiuj

source: Create Atomic
ja_jp: アトミック生成

source: Create Mask
ja_jp: マスク生成
pl_pl: Utwórz maskę

source: CtrlSelect
ja_jp: コントロール選択

source: Customize Mask
ja_jp: マスクをカスタマイズ

source: Customize block GUI:
ja_jp: ブロックGUIをカスタマイズ:

source: Cut
ja_jp: 切り取り
pl_pl: Wytnij

source: Cut: Click on the object to cut
ja_jp: 切り取り: 対象のオブジェクトをクリックしてください
pl_pl: Wytnij: Kliknij na obiekt do wycięcia

source: Debug Level
ja_jp: デバッグ・レベル
pl_pl: Poziom odpluskwiania

source: Default link colors
ja_jp: リンク色初期値
pl_pl: Domyślne kolory łączników

source: Default window parameters
ja_jp: ウインドウ・パラメータ初期値
pl_pl: Domyślne parametry okna

source: Defined shortcuts
ja_jp: 定義されたショートカット
pl_pl: Domyślne skróty kławiszowe

source: Delete
ja_jp: 削除
pl_pl: Usuń

source: Delete: Click on the object to delete
ja_jp: 削除: 対象のオブジェクトをクリックしてください
pl_pl: Usuń: Kliknij na obiekt do usunięcia

source: Demos
ja_jp: デモ
pl_pl: Dema

source: Details
ja_jp: 詳細
pl_pl: Szczegóły

source: Diagram
ja_jp: 図形
pl_pl: Schemat

source: Done
ja_jp: 完了
pl_pl: Wykonano

source: Drag, click left for final or intermediate points or right to cancel
ja_jp: ドラッグ、左クリックは取り消す最終または中間の点、または右でキャンセル

source: Duplicate
ja_jp: 重複
pl_pl: Duplikuj

source: Edit
ja_jp: 編集
pl_pl: Edycja

source: Error
ja_jp: エラー
pl_pl: Błąd

source: Eval
ja_jp: Eval(評価)

source: Event links color? :
ja_jp: イベント・リンク 色? :
pl_pl: Kolor łączników zdarzeń? :

source: Exit
ja_jp: 出口
pl_pl: Wyjście

source: Export
ja_jp: エクスポート
pl_pl: Eksport

source: Export All
ja_jp: 全てエクスポート
pl_pl: Eksportuj wszystko

source: Export in file %s failed
ja_jp: ファイル %s エクスポートで失敗しました
pl_pl: Eksport do pliku %s nie powiódł się

source: File
ja_jp: ファイル
pl_pl: Plik

source: Fit diagram to figure
ja_jp: 適当な図形構造
pl_pl: Dopasuj schemat do okna graficznego

source: Flip
ja_jp: 反転
pl_pl: Odwróć

source: Following palette(s) ignored (associated file(s) no more exist):
ja_jp: 以下のパレットは無視されました(関連したファイルはもはや存在しません):
pl_pl: Następująca(e) paleta(y) są ignorowane (odpowiedni plik(i) nie istnieje(ą)):

source: Foreground color ? :
ja_jp: 前景色
pl_pl: Kolor pierwszewgo planu ? :

source: Format
ja_jp: フォーマット

source: Free
ja_jp: 解放

source: Get Info
ja_jp: 情報取得
pl_pl: Pobierz info

source: Help
ja_jp: ヘルプ
pl_pl: Pomoc

source: ID font definitions
ja_jp: IDフォント定義
pl_pl: Definicje czcionek ID

source: ID fonts
ja_jp: IDフォント
pl_pl: Czcionki ID

source: Icon
ja_jp: アイコン
pl_pl: Ikonka

source: Icon Editor
ja_jp: アイコン編集
pl_pl: Edytor ikonek

source: Identification
ja_jp: 識別
pl_pl: Identyfikacja

source: It is impossible to set ID for this type of object
ja_jp: このオブジェクトの型にIDを設定することができません
pl_pl: Ustawienie ID dla obiektu tego typu jest niemożliwe

source: Label
ja_jp: ラベル

source: Link
ja_jp: リンク
pl_pl: Łącznik

source: Link ID font name
ja_jp: リンクID フォント名
pl_pl: Nazwa czcionki ID łącznika

source: Link ID font size
ja_jp: リンクID フォントサイズ
pl_pl: Rozmiar czcionki ID łącznika

source: Link parameters
ja_jp: リンクパラメータ
pl_pl: parametry łącznika

source: Load as Palette
ja_jp: パレットとしてロード
pl_pl: Załaduj jako paletę

source: Mask
ja_jp: マスク
pl_pl: Maska

source: Mask can only be created for Super Blocks.
ja_jp: マスクは、スーパ・ブロックのために作ることができます。
pl_pl: Maska może być utworzona tylko dla superbloków

source: Modelica initialize
ja_jp: 原型の初期化
pl_pl: Inicjalizacja Modelica

source: Modify title and menu labels.
ja_jp: タイトルとメニュー・ラベルを修正して下さい。
pl_pl: Zmień tytuł i metki menu.

source: Move
ja_jp: 移動
pl_pl: Przesuń

source: MoveLink
ja_jp: リンク移動

source: Multiple selection cannot be used here
ja_jp: 複数の選択は、ここで使うことができません
pl_pl: Tu nie można używac wielokrotne zaznaczanie

source: Navigator window
ja_jp: ナビゲーター・ウインドウ

source: New
ja_jp: 新規
pl_pl: Nowy

source: No
ja_jp: いいえ
pl_pl: Nie

source: No selected block in the current Scicos window.
ja_jp: 現在のScicos ウインドウでブロックを選択しませんでした。
pl_pl: Żaden blok w oknie Scicos nie został zaznaczony

source: Only blocks can be selected for this operation.
ja_jp: ブロックだけがこの操作で選ぶことができます。
pl_pl: Tylko bloki mogą byc zaznaczone dla tej operacji.

source: Only one block can be selected in current window for this operation.
ja_jp: 単一のブロックは、現在のウインドウで選択ができます。
pl_pl: Tylko jeden blok może zostać wybrany w bieżącym oknie do tej operacji.

source: Open
ja_jp: 開く
pl_pl: Otwórz

source: Open a Scicos demonstration diagram
ja_jp: Scicos デモ図形 を開く
pl_pl: Otworż schemat demonstracyjny Scicos

source: Open a Scicos diagram
ja_jp: Scicos 図形 を開く
pl_pl: Otwórz schemat Scicos

source: Open/Set
ja_jp: 開く/設定

source: Pal editor
ja_jp: 仲間の編集

source: Palette
ja_jp: パレット
pl_pl: Paleta

source: Palettes
ja_jp: パレット
pl_pl: Palety

source: Palettes Tree
ja_jp: パレット・ツリー
pl_pl: Drzewko palet

source: Paste
ja_jp: 貼り付け
pl_pl: Wklej

source: Place in Diagram
ja_jp: 図形の場所

source: PlaceinBrowser
ja_jp: ブラウザの場所

source: PlaceinDiagram
ja_jp: 図形の場所

source: Please report
ja_jp: 報告してください

source: Popup
ja_jp: ポップアップ
pl_pl: Dymek

source: Press left mouse button, drag region and release (right button to cancel)
ja_jp: マウスの左ボタンを押し,リージョンをドラッグし,離してください (右ボタンでキャンセル)

source: Problem saving a backup; I cannot activate Scilab
ja_jp: バックアップ保存の問題; Scilabを有効にできません
pl_pl: Problem z zapisem backupa; nie mogę aktywować Scilab

source: Problem while building library %s
ja_jp: ライブラリ %s の構築中に問題がありました。
pl_pl: Problem przy budowie biblioteki %s

source: Properties
ja_jp: プロパティ
pl_pl: Właściwości

source: Purge
ja_jp: 浄化
pl_pl: Wyczyść

source: Region to Palette
ja_jp: パレットへの領域
pl_pl: Region do palety

source: Region to Super Block
ja_jp: スーパー・ブロックへの領域
pl_pl: Region do superblocku

source: Regular links color ? :
ja_jp: 正規のリンク色 ? :
pl_pl: Podstawowy kolor łączników ? :

source: Remove Atomic
ja_jp: 原子除去
pl_pl: Usuń Atomic

source: Remove Mask
ja_jp: マスク除去
pl_pl: Usuń maskę

source: Rename
ja_jp: 名前変更
pl_pl: Zmień nazwę

source: Replot
ja_jp: 再プロット
pl_pl: Przerysuj

source: Requested action: %s is not available
ja_jp: アクションの要求: %s は有効ではありません。
pl_pl: Wymagane działanie: brak %s

source: Resize
ja_jp: リサイズ
pl_pl: Zmień rozmiar

source: Resize is allowed only for Blocks or Links.
ja_jp: リサイズは、ブロックまたはリンクのためだけに許されます。
pl_pl: Zmiana rozmiaru jest dopuszczalna tylko dla bloków i łączników.

source: Rotate Left
ja_jp: 左循環
pl_pl: Obróć w lewo

source: Rotate Right
ja_jp: 右循環
pl_pl: Obróć w prawo

source: Run
ja_jp: 実行
pl_pl: Uruchom

source: Save
ja_jp: 保存
pl_pl: Zapisz

source: Save As
ja_jp: 名前を付けて保存
pl_pl: Zapisz Jako

source: Save Block GUI
ja_jp: ブロックGUI保存
pl_pl: Zapisz GUI bloku

source: Save as Interf Func
ja_jp: 干渉関数として保存

source: Save as Palette
ja_jp: パレットとして保存
pl_pl: Zapisz jako paletę

source: Scicos Documentation
ja_jp: Scicos ドキュメント
pl_pl: Dokumentacja Scicos

source: Scicos version %s
ja_jp: Scicos バージョン %s
pl_pl: Wersja Scicos %s

source: Scilab Graphics of %s
ja_jp: %s のScilabグラフィック

source: Select a block.
ja_jp: ブロック選択
pl_pl: Zaznacz block.

source: Select a directory path
ja_jp: ディレクトリPATH選択
pl_pl: Wybierz ścieżkę do katalogu

source: SelectAll
ja_jp: 全て選択
pl_pl: ZaznaczWszystko

source: SelectLink
ja_jp: リンク選択
pl_pl: ZaznaczŁącznik

source: SelectRegion
ja_jp: 領域選択
pl_pl: ZaznaczObszar

source: Set Block identification
ja_jp: ブロック・識別設定
pl_pl: Ustaw identyfikator bloku

source: Set Block sizes
ja_jp: ブロック・サイズ設定
pl_pl: Ustaw rozmiary bloku

source: Set Diagram Info
ja_jp: 図形情報の設定
pl_pl: Ustaw info schematu

source: Set grid
ja_jp: グリッド設定
pl_pl: Ustaw siatkę

source: Set link Identification
ja_jp: リンク・識別設定
pl_pl: Ustaw identyfikator łącznika

source: Set link edition mode
ja_jp: リンク・編集モード設定
pl_pl: Ustaw tryb edycji łącznika

source: Setup
ja_jp: 設定
pl_pl: Ustawienia

source: Shortcuts
ja_jp: ショートカット
pl_pl: Skróty klawiszowe

source: Show Block Shadow
ja_jp: ブロック影表示
pl_pl: Włącz cień dla bloków

source: Simulate
ja_jp: シミュレーション
pl_pl: Symuluj

source: Smart
ja_jp: スマート

source: Smart Move
ja_jp: スマート動作

source: Smart move does not work yet with multiple selection
ja_jp: スマート動作は複数の選択でもう作業できません

source: Sorry file name not defined in
ja_jp: すみません、ファイル名は定義されていません
pl_pl: Przepraszamy, nazwa pliku nie jest zdefiniowana w

source: Sorry: Only C or FORTRAN languages are supported
ja_jp: すみません: C か FORTRAN言語のみがサポートされています
pl_pl: Przepraszamy, mozna uzywać tylko C lub FORTRAN

source: Stop
ja_jp: 停止
pl_pl: Zatrzymaj

source: The current icon depends on block parameter
ja_jp: 現在のアイコンは、ブロック・パラメーターに依存します
pl_pl: Bieżąca ikona zależy od parametrów bloku

source: The key %s is already in use for %s
ja_jp: キー %1$s は、すでに %2$s のため使われています。
pl_pl: Klawisz %s już jest używany dla %s

source: The key %s is not a valid letter
ja_jp: キー %s は、妥当な文ではありません

source: The parameter(s) %s must be defined in the
ja_jp: パラメーター%s が定義されなくてはいけません
pl_pl: Parametr(y) %s muszą być zdefiniowane w

source: Thickness
ja_jp: 厚さ
pl_pl: Grubość

source: This block is not masked.
ja_jp: このブロックはマスクされていません。

source: This window is not an active palette
ja_jp: このウインドウは、有効なパレットではありません
pl_pl: To okno nie jest aktywną paletą

source: This window is not an active scicos window
ja_jp: このウインドウは、有効なscicosウインドウではありません
pl_pl: To okno nie jest aktywnym okne Scicos

source: Title of the GUI
ja_jp: GUIのタイトル
pl_pl: Tytuł GUI

source: To avoid this message, please update the %s.scicos_pal file.
ja_jp: メッセージを避けるために、どうぞ %s を更新して下さい。scicos_pal ファイル
pl_pl: Dla uniknięcia tego komunikatu proszę uzupełnić plik %s.scicos_pal.

source: To reactivate Scicos, click on a diagram or type scicos();
ja_jp: Scicosを復活させるため、図形または型scicos()をクリックして下さい;
pl_pl: Dla reaktywacji Scicos kliknij na schemat lub użyj polecenia scicos();

source: Toggle grid
ja_jp: トグル・グリッド
pl_pl: Włacz/wyłacz siatkę

source: Tools
ja_jp: ツール
pl_pl: Narzędzia

source: Type
ja_jp: 型
pl_pl: Typ

source: Type not recognized
ja_jp: 認められない型
pl_pl: Typ nie rozpoznany

source: Undo
ja_jp: 元に戻す
pl_pl: Cofnij

source: Up To Main Diagram
ja_jp: 主な図形まで

source: Use 3D aspect?
ja_jp: 3Dを使っていますか?

source: View
ja_jp: ビュー
pl_pl: Widok

source: Warning %d menus have identical name %s
ja_jp: 警告 %d メニューは、同一の名前 %s を持っています
pl_pl: Ostrzeżenie: %d menu ma identyczną nazwę %s

source: Yes
ja_jp: はい
pl_pl: Tak

source: Your diagram is not saved. Do not quit Scilab or
ja_jp: あなたの図形は保存されません。また、Scilabを終わらせない
pl_pl: Two schemat nie został zapisany. Nie wychodź ze Scilab albo

source: Zoom in
ja_jp: ズーム・イン
pl_pl: Powiększ

source: Zoom out
ja_jp: ズーム・アウト
pl_pl: Pomniejsz

source: current choice is
ja_jp: 現在の選択
pl_pl: bieżacy wybór to

source: height
ja_jp: 高さ
pl_pl: wysokość

source: scs_show active...
ja_jp: scs_show 有効...
pl_pl: scs_show jest aktywny...

source: width
ja_jp: 幅
pl_pl: szerokość
