Repository: ScilabOrg/scilab
Catalog: scilab/modules/fileio/locales/*/fileio.po
Languages: pl_pl, pt_br

source: %s : Memory allocation error.
pl_pl: %s: Błąd alokacji pamięci.

source: %s: %s format not recognized.
pl_pl: %s: Format %s nie rozpoznany.
pt_br: %s: Formato %s não rechonhecido.

source: %s: An error occurred in %s: errno=%s
pl_pl: %s: Wystąpił błąd w %s: errno=%s
pt_br: %s: Ocorreu um erro em %s: errno=%s

source: %s: An error occurred.
pl_pl: %s: Wystąpił błąd.

source: %s: An error occurred: %s
pl_pl: %s: Wystąpił błąd: %s
pt_br: %s: Ocorreu um erro: %s

source: %s: An error occurred: field %d is too long (< %d) for %%c directive.
pl_pl: %s: Wystąpił błąd: pole %d jest zbyt długie (< %d) dla dyrektywy %%c.
pt_br: %s: Ocorreu um erro: O campo %d é muito longo (< %d) para a diretiva %%c.

source: %s: An error occurred: field %d is too long (< %d) for %%s directive.
pl_pl: %s: Wystąpił błąd: pole %d jest zbyt długie (< %d) dla dyrektywy %%s.
pt_br: %s: Ocorreu um erro: O campo %d é muito longo (< %d) para a diretiva %%s.

source: %s: An error occurred: field %d is too long (> %d) for %%[ directive.
pl_pl: %s:Wystąpił błąd: Pole %d jest zbyt długie (> %d) dla dyrektywy %%[.
pt_br: %s: Ocorreu um erro: O campo %d é muito longo (> %d) para a diretiva %%[.

source: %s: An error occurred: format is too long (> %d).
pl_pl: %s: Wystąpił błąd: format jest zbyt długi (> %d).
pt_br: %s: Ocorreu um erro: O formato é muito longo (> %d).

source: %s: An error occurred: too many (> %d) conversion required.
pl_pl: %s: Wystąpił błąd: wymaganych jest zbyt wiele przekształceń (> %d).
pt_br: %s: Ocorreu um erro: muitos conversões requeridas (> %d).

source: %s: Cannot close file whose descriptor is %d: File is not active.
pl_pl: %s: Niemożna zamknąć pliku, którego deskryptor to %d: Plik nie jest aktywny.
pt_br: %s: Não se consegue fechar o arquivo cujo descritor é %d: O arquivo não está ativo.

source: %s: Cannot close file whose descriptor is %d: No file to close.
pl_pl: %s: Niemożna zamknąć pliku, którego deskryptor to %d: Nie ma pliku do zamknięcia.
pt_br: %s: Não se consegue fecharo arquivo cujo descritor é %d: Não há arquivo a ser fechado.

source: %s: Cannot go to directory %s
pl_pl: %s: Niemożna przejść do katalogu %s
pt_br: %s: Não se consegue acessar o diretório %s

source: %s: Cannot go to directory.
pl_pl: %s: Niemożna przejść do katalogu.

source: %s: Cannot open file %s.
pl_pl: %s: Niemożna otworzyć pliku %s.
pt_br: %s: Não se consegue abrir o arquivo %s.

source: %s: Cannot open file '%s'.
pl_pl: %s: Niemożna otworzyć pliku '%s'.
pt_br: %s: Não se consegue abrir o arquivo '%s'.

source: %s: Cannot read data in file '%s'.
pl_pl: %s: Niemożna odczytać danych z pliku '%s'.
pt_br: %s: Não se consegue ler dados no arquivo '%s'.

source: %s: Cannot read file whose descriptor is %d: File is not active.
pl_pl: %s: Niemożna odczytać pliku, którego deskryptor to%d: Plik nie jest aktywny.

source: %s: Could not extend the number of files simultaneously open in Scilab.
pl_pl: %s: Niemożna zwiększyć ilości plików równocześnie otwartych w programie Scilab.
pt_br: %s: Não foi possível estender o número de arquivos simultaneamente abertos no Scilab.

source: %s: Data mismatch.
pl_pl: %s: Niezgodne dane.
pt_br: %s: Não há correspondência de dados.

source: %s: Error while opening, reading or writing '%s'.
pl_pl: %s: Błąd przy otwieraniu, odczytywaniu lub zapisywaniu '%s'.
pt_br: %s: Erro durante abertura, leitura ou escrita de '%s'.

source: %s: Error while opening, reading or writing.
pl_pl: %s: Błąd przy otwieraniu, odczytywaniu lub zapisywaniu.
pt_br: %s: Erro durante abertura, leitura ou escrita.

source: %s: Error while trying to retrieve the name of the current directory.
pl_pl: %s: Błąd przy próbie zwrócenia nazwy bieżącego katalogu.
pt_br: %s: Erro ao se tentar recuperar o nome do diretório corrente.

source: %s: Incorrect format.
pl_pl: %s: Nieprawidłowy format.

source: %s: Invalid conversion.
pl_pl: %s: Niewłaściwe przekształcenie.

source: %s: No File opened in Scilab.
pl_pl: %s: Żaden plik nie jest otwarty w programie Scilab.
pt_br: %s: Nenhum arquivo aberto no Scilab.

source: %s: No input file associated to logical unit %d.
pl_pl: %s: Nie ma pliku wejściowego związanego z układem logicznym %d.
pt_br: %s: Nenhum arquivo de entrada associado à unidade lógica %d.

source: %s: No input file.
pl_pl: %s: Brak pliku wejściowego.
pt_br: %s: Não há arquivo de entrada.

source: %s: No more memory.
pl_pl: %s: Brak pamięci.
pt_br: %s: Memória esgotada.

source: %s: No such file %s.
pl_pl: %s: Niema takiego pliku: %s.

source: %s: Options ignored.
pl_pl: %s: Opcje zignorowane.
pt_br: %s: Opções ignoradas.

source: %s: Specified format cannot include any '\n'
pl_pl: %s: Określony format nie może zawierać żadnych '\n'
pt_br: %s: O formato especificado não inclui nenhum '\n'

source: %s: The file %s is not opened in scilab.
pl_pl: %s: Plik %s nie jest otwarty w programie Scilab.

source: %s: Too many directives in scanf.
pl_pl: %s: Zbyt wiele dyrektyw w scanf.
pt_br: %s: Muitas diretivas em scanf.

source: %s: Warning : only extend the limit for the number of scilab's files opened simultaneously.
pl_pl: %s: Ostrzeżenie : tylko zwiększ limit ilości jednocześnie otwartych plików w programie Scilab.
pt_br: %s: Aviso: apenas estenda o limite para o número de arquivos do Scilab abertos simultaneamente.

source: %s: Warning: Directory '%s' already exists.
pl_pl: %s: Ostrzeżenie: Katalog '%s' już istnieje.
pt_br: %s: Aviso: O diretório'%s' já existe.

source: %s: Warning: Specified maximum number of files (%d) > Absolute maximum number of files allowed (%d).
pl_pl: %s: Ostrzeżenie: Określona maksymalna liczba plików (%d) > absolutnej maksymalnej liczby dozwolonych plików (%d).
pt_br: %s: Aviso: Número máximo de arquivos especificado (%d) > Número máximo absoluto de arquivos permitidos (%d).

source: %s: Wrong file descriptor: %d.
pl_pl: %s: Zły deskryptor pliku: %d.
pt_br: %s: Descritor de arquivo errado: %d.

source: %s: Wrong file mode: READ only.
pl_pl: %s: Zły tryb pliku: tylko ODCZYT.
pt_br: %s: Modo de arquivo errado: READ apenas.

source: %s: Wrong number of input argument(s).
pl_pl: %s: Zła liczba parametru(-ów) wejściowego(-ych).
pt_br: %s: Quantidade errada de argumentos de entrada.

source: %s: Wrong number of input arguments: %d expected.
pl_pl: %s: Zła liczba parametrów wejściowych: Oczekiwano %d.
pt_br: %s: Quantidade errada de argumentos de entrada. Esperava-se %d.

source: %s: Wrong number of input arguments: At least %d expected.
pl_pl: %s: Zła liczba parametrów wejściowych: Oczekiwano przynajmniej %d.
pt_br: %s: Número errado de argumentos de entrada: Esperava-se pelo menos %d.

source: %s: Wrong number of output argument(s).
pl_pl: %s: Zła liczba parametrów(-u) wejściowych(-ego).
pt_br: %s: Quantidade errada de argumentos de saída.

source: %s: Wrong number of output arguments: %d expected.
pl_pl: %s: Zła liczba parametrów wyjściowych: Oczekiwano %d.

source: %s: Wrong size for input argument #%d ('%s'): Non-empty string expected.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d ('%s'): Oczekiwano niepustego ciągu znaków.
pt_br: %s: Tamanho errado para o argumento de entrada #%d ('%s'): Esperava-se um string não-vazio.

source: %s: Wrong size for input argument #%d: A 1-by-n or m-by-1 array expected.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano tablicy 1-na-n lub m-na-1.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um array 1-por-n ou m-por-1.

source: %s: Wrong size for input argument #%d: A String expected.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano ciągu znaków.

source: %s: Wrong size for input argument #%d: A boolean expected.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano wartości logicznej.

source: %s: Wrong size for input argument #%d: A file descriptor expected.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano deskryptora pliku.

source: %s: Wrong size for input argument #%d: A filename expected.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano nazwy pliku.

source: %s: Wrong size for input argument #%d: A integer expected.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano wartości całkowitej.

source: %s: Wrong size for input argument #%d: A m-by-1 array expected.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano tablicy m-na-1.

source: %s: Wrong size for input argument #%d: A string expected.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano ciągu znaków.

source: %s: Wrong size for input argument #%d: Must be less than %d characters.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Musi zawierać mniej niż %d znaków.

source: %s: Wrong size for input argument #%d: Non-empty string expected.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano niepustego ciągu znaków.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se string não-vazio.

source: %s: Wrong size for input argument #%d: Scalar expected.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano skalara.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um escalar.

source: %s: Wrong size for input argument: Scalar expected.
pl_pl: %s: Zły rozmiar parametru wejściowego: Oczekiwano skalara.
pt_br: %s: Tamanho errado para o argumento de entrada: Esperava-se um escalar.

source: %s: Wrong type for input argument #%d: A String expected.
pl_pl: %s: Zły typ parametru wejściowego #%d: Oczekiwano ciągu znaków.

source: %s: Wrong type for input argument #%d: A boolean expected.
pl_pl: %s: Zły typ parametru wejściowego #%d: Oczekiwano wartości logicznej.

source: %s: Wrong type for input argument #%d: A file descriptor expected.
pl_pl: %s: Zły typ parametru wejściowego #%d: Oczekiwano deskryptora plików.

source: %s: Wrong type for input argument #%d: A filename or file descriptor expected.
pl_pl: %s: Zły typ parametru wejściowego #%d: Oczekiwano nazwy pliku lub deskryptora pliku.

source: %s: Wrong type for input argument #%d: A integer expected.
pl_pl: %s: Zły typ parametru wejściowego #%d: Oczekiwano wartości całkowitej.

source: %s: Wrong type for input argument #%d: A integer or string expected.
pl_pl: %s: Zły typ parametru wejściowego #%d: Oczekiwano wartości całkowitej lub ciągu znaków.

source: %s: Wrong type for input argument #%d: A string expected.
pl_pl: %s: Zły typ parametru wejściowego #%d: Oczekiwano ciągu znaków.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um string.

source: %s: Wrong type for input argument #%d: A string.
pl_pl: %s: Zły typ parametru wejściowego #%d: Ciąg znaków.

source: %s: Wrong type for input argument #%d: Matrix of floating point numbers expected.
pl_pl: %s: Zły typ parametru wejściowego #%d: Oczekiwano macierzy licz zmiennoprzecinkowych.
pt_br: %s: Valores errados para o argumento de entrada #%d: Esperava-se uma matriz de pontos flutuantes.

source: %s: Wrong type for input argument #%d: Real values expected.
pl_pl: %s: Zły typ parametru wejściowego #%d: Oczekiwano wartości rzeczywistych.
pt_br: %s: Tipo errado para o argumentot de entrada #%d: Esperava-se valores reais.

source: %s: Wrong type for input argument #%d: String array expected.
pl_pl: %s: Zły typ parametru wejściowego #%d: Oczekiwano tablicy ciągów znaków.

source: %s: Wrong type for input argument #%d: String expected.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano ciągu znaków.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um string.

source: %s: Wrong type for input argument: A string expected.
pl_pl: %s: Zły typ parametru wejściowego: Oczekiwano ciągu znaków.
pt_br: %s: Tipo errado para o argumento de entrada: Esperava-se um string.

source: %s: Wrong type for input argument: Matrix expected.
pl_pl: %s: Zły typ parametru wejściowego: Oczekiwano macierzy.
pt_br: %s: Tipo errado para o argumento de entrada: Esperava-se uma matriz.

source: %s: Wrong type for input argument: String expected.
pl_pl: %s: Zły typ parametru wejściowego: Oczekiwano ciągu znaków.
pt_br: %s: Tipo errado para o argumento de entrada: Esperava-se um string.

source: %s: Wrong type for input arguments: Strings expected.
pl_pl: %s: Zły typ parametrów wejściowych: Oczekiwano ciągów znaków.
pt_br: %sTipo errado para argumentos de entrada: Esperava-se strings.

source: %s: Wrong value for input argument #%d (%s): '%s' or '%s' or '%s' expected.
pl_pl: %s: Zła wartość parametru wejściowego #%d (%s): Oczekiwano '%s' lub '%s' lub '%s'.
pt_br: %s: Valor errado para o argumento de entrada #%d (%s): Esperava-se '%s' oru'%s' ou '%s'.

source: %s: Wrong value for input argument #%d ('%s'): Format not recognized.
pl_pl: %s: Zła wartość parametru wejściowego #%d ('%s'): Nie rozpoznano formatu.
pt_br: %s: Valor errado para o argumento de entrada #%d ('%s'): O formato não é reconhecido.

source: %s: Wrong value for input argument #%d.
pl_pl: %s: Zła wartość parametru wejściowego #%d.

source: %s: Wrong value for input argument #%d: '%s' is an invalid path.
pl_pl: %s: Zła wartość parametru wejściowego #%d: Niewłaściwa ścieżka '%s'
pt_br: %s: Valor errado para o argumento de entrada #%d: '%s' é um endereço inválido.

source: %s: Wrong value for input argument #%d: '%s' or '%s' or '%s' expected.
pl_pl: %s: Zła wartość parametru wejściowego #%d: Oczekiwano '%s' lub '%s' lub '%s'.
pt_br: %s: Valor errado para o argumento de entrada #%d: esperava-se '%s' ou '%s' ou '%s'.

source: %s: Wrong value for input argument #%d: '%s', '%s' or '%s' expected.
pl_pl: %s: Zła wartość parametru wejściowego #%d: Oczekiwano '%s', '%s' lub '%s'.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se '%s', '%s' ou '%s'.

source: %s: Wrong value for input argument #%d: ''w'' or ''u'' string expected.
pl_pl: %s: Zła wartość parametru wejściowego #%d: Oczekiwano ciągu znaków ''w'' lub ''u''.

source: %s: Wrong value for input argument #%d: A valid file descriptor expected.
pl_pl: %s: Zła wartość parametru wejściowego #%d: Oczekiwano prawidłowego deskryptora pliku.

source: %s: Wrong value for input argument #%d: A valid filename or directory expected.
pl_pl: %s: Zła wartość parametru wejściowego #%d: Oczekiwano prawidłowej nazwy pliku.

source: %s: Wrong value for input argument #%d: Format not recognized.
pl_pl: %s: Zła wartość parametru wejściowego #%d: Nie rozpoznano formatu.
pt_br: %s: Valor errado para o argumento de entrada #%d: O formato não é reconhecido.

source: %s: Wrong value for input argument #%d: Must be ''%s''.
pl_pl: %s: Zła wartość parametru wejściowego #%d: Musi być ''%s''.
pt_br: %s: Valor errado para o argumento de entrada #%d: Deve ser ''%s''.

source: %s: Wrong value for input argument: no empty string expected.
pl_pl: %s: Zła wartość parametru wejściowego: oczekiwano niepustego ciągu znaków.

source: %s: Wrong value(s) for input argument(s).
pl_pl: %s: Zła(-e) wartość(-ci) parametru(-ów) wejściowego(-ych).

source: %s: Wrong variable type (%s) found in ''%s''. File may be wrong or corrupted.
pl_pl: %s: Zły typ (%s) zmiennej znaleziony w ''%s''. Plik może być błędny lub uszkodzony.
pt_br: %s: Tipo de variável errado (%s) encontrado em ''%s''. O arquivo pode ser errado ou estar corrompido.

source: %s: end of input reached before final conversion.
pl_pl: %s: koniec wejścia osiągnięty przed końcowym przekształceniem.

source: %s: format is of 0 length.
pl_pl: %s: format jest 0-owej długości.
pt_br: %s: O formato possui comprimento 0.

source: %s: invalid filename.
pl_pl: %s: Niewłaściwa nazwa pliku.

source: %s: invalid status.
pl_pl: %s: nieprawidłowy status.

source: %s: unknown format %s.
pl_pl: %s: nieznany format %s.
pt_br: %s: Formato desconhecido %s.

source: Bad conversion.
pl_pl: Złe przekształcenie.
pt_br: Conversão ruim.

source: Can't get current directory.
pl_pl: Niemożna odczytać bieżącego katalogu.

source: Can't go to directory %s.
pl_pl: Niemożna przejść do katalogu %s.

source: Invalid buffer.
pl_pl: Nieprawidłowy bufor.

source: No input file
pl_pl: Brak pliku wejściowego
pt_br: Não há arquivo de entrada

source: Not enough entries.
pl_pl: Za mało wpisów.
pt_br: Não há entradas suficientes.

source: Unknown error.
pl_pl: Nieznany błąd.

source: Warning: Could not open directory %s: %s
pl_pl: Ostrzeżenie: Niemożna otworzyć katalogu %s: %s

source: Warning: Could not remove directory %s: %s
pl_pl: Ostrzeżenie: Niemożna usunąć katalogu %s: %s
pt_br: Aviso: Não foi possível remover o diretório %s: %s

source: Warning: Could not remove file %s: %s
pl_pl: Ostrzeżenie: Niemożna usunąć pliku %s: %s
pt_br: Aviso: Não foi possível remover o arquivo %s: %s

source: Warning: Error while opening %s: %s
pl_pl: Ostrzeżenie: Błąd przy otwieraniu %s: %s
pt_br: Aviso: Erro durante a abertura de %s: %s

source: Warning: file '%s' already opened in Scilab.
pl_pl: Ostrzeżenie: plik '%s' jest już otwarty w programie Scilab.
pt_br: Aviso: O arquivo '%s' já está aberto no Scilab.

source: unclosed [ directive.
pl_pl: niezamknięta [ dyrektywa.
pt_br: diretiva [ aberta.
