Repository: ScilabOrg/scilab
Catalog: scilab/modules/sparse/locales_macros/*.po
Languages: fr_fr

source: Iteration #%s/%s residual : %s
fr_fr: Itération #%s/%s résidu: %s

source: New residual = %s < tol = %s => break
fr_fr: Nouveau résidu = %s < tol = %s => arrêt

source: Type of preconditionning #1 : %d
fr_fr: Type de préconditionnement n° 1 : %d

source: Type of preconditionning #2 : %d
fr_fr: Type de préconditionnement n° 2 : %d

source: %s: Convergence error.
fr_fr: %s: Erreur de convergence.

source: %s: Did not converge.
fr_fr: %s: Ne converge pas

source: %s: Wrong number of input argument: At least %d expected.
fr_fr: %s: Mauvais nombre d'argument d'entrée: Au moins %d attendu.

source: %s: Wrong number of input arguments: %d or %d expected.
fr_fr: %s: Mauvais nombre d'arguments d'entrée: %d ou %d attendus.

source: %s: Wrong number of input arguments: %d to %d expected.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : %d à %d attendus.

source: %s: Wrong number of input arguments: At least %d expected.
fr_fr: %s : Nombre d'arguments d'entrée incorrect : %d au moins sont attendus.

source: %s: Wrong size for input argument #%d: Column vector expected.
fr_fr: %s : Taille incorrecte pour l'argument d'entrée #%d : Vecteur de colonne attendu.

source: %s: Wrong size for input argument #%d: Same size as input argument #%d expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° #%d: Même dimension que l'argument d'entrée n° #%d attendue.

source: %s: Wrong size for input argument #%d: Scalar expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Scalaire attendu.

source: %s: Wrong size for input argument #%d: Square matrix expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Matrice carrée attendue.

source: %s: Wrong type for input argument #%d.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d.

source: %s: Wrong type for input argument #%d: A string expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Une chaîne de caractères est attendue.

source: %s: Wrong type for input argument #%d: Column vector expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Vecteur colonne attendu.

source: %s: Wrong type for input argument #%d: Scalar expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un scalaire attendu.

source: %s: Wrong type for input argument #%d: Square matrix expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Matrice carrée attendue.

source: %s: Wrong type for input argument #%d: Transpose of the function %s expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° #%d: Transpose de la fonction %s attendue.

source: %s: Wrong value for input argument #%d: ''%s'' or ''%s'' expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° %d: ''%s'' ou ''%s'' attendu.

source: %s: Wrong value for input argument #%d: Column vector expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° #%d: Vecteur colonne attendu.

source: %s: Wrong value for input argument #%d: Transpose of the function %s expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° #%d: Transpose de la fonction %s attendue.

source: %s: Wrong value for input argument #%d: Vector expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° #%d: Vecteur attendu.

source: Algorithm fails
fr_fr: Echec de l'algorithme

source: Algorithm pass
fr_fr: Succès de l'algorithme

source: Final residual = %s > tol =%s
fr_fr: Résidu final = %s > tol =%s

source: Norm of right-hand side : %s
fr_fr: Norme du membre de droite: %s

source: Special processing where the right-hand side is zero.
fr_fr: Traitement spécial là où le membre de droite vaut zéro.
