Repository: ScilabOrg/scilab
Catalog: scilab/modules/special_functions/locales/*/special_functions.po
Languages: ja_jp, pl_pl

source: %s: Wrong type for input argument #%d: Real expected.
ja_jp: %s: 入力引数 #%d で不正な型: 実数が想定されます。
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwany typ real.

source: %s: Wrong type for input argument #%d or #%d: No complex input argument expected.
ja_jp: %s: 入力引数 #%d または #%d で不正な型: 入り組んでない入力引数を想定します。
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d lub #%d: Oczekiwany argument wejściowy który nie jest liczbą zespoloną.

source: %s: Wrong value for input arguments: Must be > %d.
ja_jp: %s: 入力引数で不正な値: > %d の必要があります。
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego: musi być >%d.

source: %s: Wrong type for first input argument.
ja_jp: %s: 最初の入力引数で不正な型です。
pl_pl: %s: Nieprawidłowy typ pierwszego argumentu wejściowego.

source: %s: Wrong type for input argument #%d.
ja_jp: %s: 入力引数 #%d で不正な型です。
pl_pl: %s: Nieprawidłowy typ dla argumentu wejściowego #%d.

source: %s: Only one of arg1 and arg2 may be a vector.
ja_jp: %s: arg１とarg２の唯一のものは、ベクトルかもしれません。
pl_pl: %s: Tylko jeden z arg1 i arg2 może być wektorem.

source: %s: Wrong type for input argument #%d: Real matrix expected.
ja_jp: %s: 入力引数 #%d で不正な型: 実行列を想定します。
pl_pl: %s: Niewłaściwy typ argumentu wejściowego #%d: oczekiwana macierz wartości real.

source: %s: Wrong value for input argument #%d: Matrix with elements in (%d,%d) expected.
ja_jp: %s: 入力引数 #%d で不正な値: 行列要素で、(%d,%d) を想定します。
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: oczekiwana macierz elementów z (%d,%d).

source: %s: overflow or underflow of an extended range number
ja_jp: %s: 拡張された範囲番号のオーバーフロー、またはアンダーフロー
pl_pl: %s: Przepełnienie lub niedomiar liczb w rozszerzonym zakresie

source: %s: error number %d
ja_jp: %s: エラー番号 %d
pl_pl: %s: Numer błędu %d
