Repository: ScilabOrg/scilab
Catalog: scilab/modules/jvm/locales/*/jvm.po
Languages: fr_fr, ja_jp

source: Could not load JVM dynamic library (libjava).
fr_fr: Ne peux pas charger la librarie dynamique JVM (libjava).
ja_jp: JVMダイナミックライブラリ(libjava)をロードできません。

source: Error: Cannot return Scilab Java environment (JNIEnv_SCILAB).
fr_fr: Erreur: Ne peux pas retourner l'environnement Java Scilab (JNIEnv_SCILAB).
ja_jp: エラー: Scilab Java環境(jvm_SCILAB)から戻れません。

source: Error: Cannot return Scilab Java environment (jvm_SCILAB): check if the JVM has been loaded by Scilab before calling this function.
fr_fr: Erreur: Ne peux pas retourner l'environnement Scilab Java (jvm_SCILAB): vérifier si la JVM a été chargé par Scilab avant d'appeler cette fonction.
ja_jp: エラー: Scilab Java環境(jvm_SCILAB)から戻れません: JVMがこのファンクションを呼ぶ前にScilabによってロードされたかどうか確かめて下さい。

source: Impossible to read %s.
fr_fr: Impossible de lire %s.
ja_jp: %s を読めません。

source: Incorrect version JNI (needs at least JDK 1.4).
fr_fr: La version JNI est incorrecte (besoin d'au moins JDK 1.4).
ja_jp: 不正確なバージョンJNI(JDK １.４ 以上が必要です)

source: JVM error in AttachCurrentThread: Could not attach to the current thread.
fr_fr: Erreur JVM dans AttachCurrentThread: Ne peux pas attacher le thread courant.
ja_jp: AttachCurrentThreadのJVMエラー: 現在のスレッドに取り付けられません。

source: Scilab cannot create Scilab Java Main-Class (we have not been able to find the main Scilab class. Check if the Scilab and thirdparty packages are available).
fr_fr: Scilab ne peut pas créer la classe principale Java Scilab (nous n'avons pas été capable de trouver la classe Scilab principale. Vérifier si les paquets Scilab et thirdparty sont accessibles).
ja_jp: Scilab Java メイン・クラスを生成できません(私達は、主なScilabクラスを見つけることができません。Scilabとサードパーティパッケージが利用できるかどうか確かめて下さい)

source: Scilab cannot open JVM library.
fr_fr: Scilab ne peut pas ouvrir la librairie JVM.
ja_jp: Scilabは JVMライブラリを開けません。

source: Weird error. Calling from Java but haven't been able to find the already existing JVM.
fr_fr: Erreur étrange. Appel de Java, mais impossible de trouver une JVM existante.
ja_jp: 奇妙なエラー、Javaからの呼び出し、しかし、JVMを見つけることができません。

source: %s: Could not add URL to system classloader : %s.
fr_fr: %s : Ne peux pas ajouter l'URL au classloader du système : %s.
ja_jp: %s: システム classloader にURLを追加できませんでした : %s

source: %s: Could not add path to java.library.path: %s.
fr_fr: %s: Ne peut pas ajouter un chemin à java.library.path: %s.
ja_jp: %s: java.library.pathにpathを追加できませんでした。: %s

source: %s: Wrong type for input argument #%d or #%d: String expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d ou %d : Chaîne de caractères attendue.
ja_jp: %s: 入力引数 #%d または #%d: 文字列を想定します。

source: %s: Wrong type for input argument #%d: String expected.
fr_fr: %s : Mauvais type pour l'argument n° %d : Chaîne de caractères attendue.
ja_jp: %s: 入力引数 #%d で不正な型: 文字列を想定します。

source: Could not access to the Main Scilab Class:
fr_fr: Ne peut pas accéder à la Classe Principale de Scilab:
ja_jp: メインScilabクラスにアクセスできません:

source: Could not access to the constructor of the Main Scilab Class:
fr_fr: Ne peut pas accéder au constructeur de la Classe Principale de Scilab:
ja_jp: メインScilabクラスのコンストラクタにアクセスすることができませんでした:

source: Could not create a Scilab main class. Error:
fr_fr: Ne peut pas créer une Classe Principale de Scilab. Erreur:
ja_jp: Scilabメインクラスを作り出すことができないエラー:

source: Error
fr_fr: Erreur
ja_jp: エラー

source: Error : Not a valid classpath file %s (encoding not 'utf-8') Encoding '%s' found
fr_fr: Erreur : Fichier classpath %s invalide (encodage pas 'utf-8') Encodage '%s' trouvé
ja_jp: エラー: classpathファイル %s が適切ではありません(エンコーディングが'utf-8'ではない) エンコーディング '%s' が見つかりました

source: Error : Not a valid path file %s (encoding not 'utf-8') Encoding '%s' found
fr_fr: Erreur : Chemin %s invalide (encodage pas 'utf-8') Encodage '%s' trouvé
ja_jp: エラー: pathファイル %s が適切ではありません(エンコーディングが'utf-8'ではない) エンコーディング '%s' が見つかりました

source: Error in the creation of the Java VM: %s
fr_fr: Erreur lors de la création de la Machine Virtuelle Java : %s
ja_jp: Java VMの生成エラー: %s

source: Error: %s
fr_fr: Erreur : %s
ja_jp: エラー: %s

source: Error: Could not parse file %s.
fr_fr: Erreur : Impossible d'analyser (parser) le fichier %s.
ja_jp: エラー: ファイル %s の解析ができません。

source: Error: Not a valid configuration file %s (encoding not '%s') Encoding '%s' found.
fr_fr: Erreur: Fichier de configuration %s invalide (l'encodage n'est pas '%s') Encodage '%s' trouvé.
ja_jp: エラー: 構成ファイル %s が適切ではありません(エンコーディングが '%s' ではない) エンコーディング '%s' が見つかりました

source: Error: could not parse file %s
fr_fr: Erreur : Impossible d'analyser (parser) le fichier %s
ja_jp: エラー: ファイル %s の解析ができません

source: If you are using a binary version of Scilab, please report a bug http://bugzilla.scilab.org/.
fr_fr: Si vous utilisez une version binaire de Scilab, merci de reporter ce probleme sur http://bugzilla.scilab.org/.
ja_jp: もしあなたがScilabのバイナリー・バージョンを使っていれば、どうぞバグをhttp://bugzilla.scilab.org/.に報告して下さい。

source: If you are using a self-built version of Scilab, update the script bin/scilab to provide the path to the JVM.
fr_fr: Si vous avez construit Scilab par vous-meme, veuillez mettre a jour le script bin/scilab pour indiquer le chemin vers la JVM.
ja_jp: もしあなたがScilabのself-buildバージョンを使っていれば、bin/scilab へスクリプトを更新してJVMへパスを通して下さい。

source: JNI version error
fr_fr: Erreur de version JNI
ja_jp: JNI バージョンエラー

source: JNI: invalid arguments
fr_fr: JNI: Arguments invalides
ja_jp: JNI: 引数不正

source: JNI: not enough memory
fr_fr: JNI: Pas assez de mémoire
ja_jp: JNI: メモリが足りません

source: JVM interface disabled in -nogui or -nwni modes.
fr_fr: L'interface JVM est désactivée en mode -nogui ou -nwni.
ja_jp: JVM インターフェース無効 -nogui または -nwni モード

source: Scilab Console
fr_fr: Console Scilab
ja_jp: Scilabコンソール

source: Scilab Java module not installed.
fr_fr: Le module Java de Scilab n'est pas installé.
ja_jp: Scilab Java モジュールはインストールされていません。

source: Some problems during the loading of the Java libraries occured. This could lead to inconsistent behaviours. Please check SCI/etc/classpath.xml.
fr_fr: Des problèmes sont apparus pendant le chargement des librairies Java. Cela peut amener un comportement inconsistant de Scilab. Vérifier le fichier SCI/etc/classpath.xml.
ja_jp: Javaライブラリのロードでいくつかの問題が発生しました。 これは、一貫性がない挙動をするかもしれません。 どうぞ SCI/etc/classpath.xml を確認してください。

source: The problem might be related to SELinux. Try to deactivate it.
fr_fr: Le probleme doit venir de SELinux. Essayez de le désactiver.
ja_jp: 問題は、SELinuxに関連するでしょう。それを無効にするよう試みて下さい。

source: Thread detached from the VM
fr_fr: Thread détaché de la machine virtuelle
ja_jp: スレッドはVMから離されました

source: Undefined error code in the JNI. Weird problem
fr_fr: Code d'erreur indéfini dans la JNI. Problème mystérieux
ja_jp: JNIで定義されていないのエラーコード。奇妙な問題

source: Unknown JNI error
fr_fr: Erreur JNI inconnue
ja_jp: 未知の JNI エラー

source: VM already created
fr_fr: VM déjà créée
ja_jp: VMはすでに生成されています

source: Warning: Could not find Java package '%s'.
fr_fr: Attention: Ne peut pas trouver le package Java '%s'.
ja_jp: 警告: Javaパッケージ '%s' が見つかりません。

source: Warning: could not find classpath declaration file %s.
fr_fr: Attention: ne peux pas trouver le fichier de déclaration classpath %s.
ja_jp: 警告: classpath定義ファイル %s が見つかりません。

source: Wrong format for %s.
fr_fr: Mauvais format pour %s.
ja_jp: %s でフォーマットが不正です。
