Repository: ScilabOrg/scilab
Catalog: scilab/modules/gui/locales/*/gui.po
Languages: fr_fr

source: Scilab '%s' module not installed.
fr_fr: Le module '%s' de Scilab n'est pas installé.

source: Scilab 5.0 and future versions are released under the terms of the CeCILL license.
fr_fr: Scilab 5.0 et les futures versions sont diffusées sous les termes de la licence CeCILL.

source: Scilab Choices Request
fr_fr: Demande de Choix Scilab

source: Scilab Choose Message
fr_fr: Message de Choix Scilab

source: Scilab Contributors...
fr_fr: Contributeurs de Scilab

source: Scilab Demonstrations
fr_fr: Démonstrations Scilab

source: Scilab Graphics
fr_fr: Graphiques Scilab

source: Scilab Input Value Request
fr_fr: Requête de valeur d'entrée Scilab

source: Scilab Message
fr_fr: Message Scilab

source: Scilab Multiple Values Request
fr_fr: Demande de Plusieurs Valeurs Scilab

source: Scilab SCE files
fr_fr: .sce fichiers Scilab

source: Scilab SCI files
fr_fr: .sci fichiers Scilab

source: Scilab binary files
fr_fr: fichier Scilab binaire

source: Select All
fr_fr: Sélectionner Tout

source: Select a directory
fr_fr: Sélectionnez un répertoire

source: Select a file name
fr_fr: Sélectionnez un nom de fichier

source: Select a file to execute
fr_fr: Sélectionnez un fichier à exécuter

source: Select a file to load
fr_fr: Selectionnez un fichier à charger

source: Select a file to write
fr_fr: Sélectionner un fichier à écrire

source: Selected colors
fr_fr: Couleurs sélectionnées

source: Selected colors are: %s.
fr_fr: Les couleurs sélectionnées sont: %s.

source: Selected menu
fr_fr: Menu sélectionné

source: Show/Hide &Toolbar
fr_fr: Afficher/Masquer la barre d'ou&tils

source: Slider demo
fr_fr: Démo Slider

source: Slider value:
fr_fr: Valeur du slider:

source: Some Scilab modules are released under the GPLv2 license.
fr_fr: Certains modules de Scilab sont distribués sous licence GPLv2.

source: Sub-menu 1
fr_fr: Sous-menu 1

source: Sub-menu 2
fr_fr: Sous-menu 2

source: Sub-menu 2-1
fr_fr: Sous-menu 2-1

source: Sub-menu 2-2
fr_fr: Sous-menu 2-2

source: The Scilab Consortium (DIGITEO)
fr_fr: Scilab Consortium (DIGITEO)

source: Tree Overview
fr_fr: Aperçu de l''arbre

source: Uicontrols demo
fr_fr: Démo Uicontrol

source: Unrecognized extension '
fr_fr: Extension non reconnue '

source: Untitled-export
fr_fr: Sans titre - exporte

source: Warning: '%s' 'Value' property should be equal to either '%s' or '%s' property value.
fr_fr: Attention : '%s' la propriété 'Value' doit être égale à la valeur de la propriété '%s' ou '%s'.

source: Windows BMP image
fr_fr: Image Windows BMP

source: Wrong size for '%s' property: '%s', '%s' or '%s' expected.
fr_fr: Mauvaise dimension pour la propriété '%s' : '%s', '%s' ou '%s' attendu.

source: Wrong size for '%s' property: '%s', '%s', '%s' or '%s' expected.
fr_fr: Mauvaise dimension pour la propriété '%s' : '%s', '%s', '%s' ou '%s' attendu.

source: Wrong size for '%s' property: '%s', '%s', '%s', '%s' or '%s' expected.
fr_fr: Mauvaise dimension pour la propriété '%s' : '%s', '%s', '%s', '%s' ou '%s' attendu.

source: Wrong size for '%s' property: '%s', '%s', '%s', '%s', '%s' or '%s' expected.
fr_fr: Mauvaise dimension pour la propriété '%s' : '%s', '%s', '%s', '%s', '%s' ou '%s' attendu.

source: Wrong size for '%s' property: '%s', '%s', or '%s' expected.
fr_fr: Mauvaise dimension pour la propriété '%s' : '%s', '%s', ou '%s' attendu.

source: Wrong size for '%s' property: 1 x 3 real vector or a 'R|G|B' string expected.
fr_fr: Mauvaise dimension pour la propriété '%s' : un vecteur réel de taille 1 x 3 ou une chaîne de caractères 'R|G|B' attendu.

source: Wrong size for '%s' property: A 1 x %d real row vector expected.
fr_fr: Mauvaise dimension pour la propriété '%s' : Un vecteur réel de taille 1 x %d attendu.

source: Wrong size for '%s' property: A graphic handle expected.
fr_fr: Mauvaise dimension pour la propriété '%s' : Un handle graphique attendu.

source: Wrong size for '%s' property: A real expected.
fr_fr: Mauvaise dimension pour la propriété '%s' : Un réel attendu.

source: Wrong size for '%s' property: A real row vector expected.
fr_fr: Mauvaise dimension pour la propriété '%s' : Un vecteur ligne de réels attendu.

source: Wrong size for '%s' property: A string expected.
fr_fr: Mauvaise dimension pour la propriété '%s' : Une chaîne de caractères attendue.

source: Wrong size for '%s' property: A string or a 1 x %d real row vector expected.
fr_fr: Mauvaise dimension pour la propriété '%s' : Une chaîne de caractères ou un vecteur réel de taille 1 x %d attendu.

source: Wrong size for '%s' property: A string or a vector of strings expected.
fr_fr: Mauvaise dimension pour la propriété '%s' : Une chaîne de caractères ou un vecteur de chaîne de caractères attendu.

source: Wrong size for '%s' property: a 2-item list expected.
fr_fr: Mauvaise dimension pour la propriété '%s' : une liste à deux éléments attendue.

source: Wrong type for '%s' property: '%s', '%s' or '%s' expected.
fr_fr: Mauvais type pour la propriété '%s' : '%s', '%s' ou '%s' attendu.

source: Wrong type for '%s' property: '%s', '%s', '%s' or '%s' expected.
fr_fr: Mauvais type pour la propriété '%s' : '%s', '%s', '%s' ou '%s' attendu.

source: Wrong type for '%s' property: '%s', '%s', '%s', '%s' or '%s' expected.
fr_fr: Mauvais type pour la propriété '%s' : '%s', '%s', '%s', '%s' ou '%s' attendu.

source: Wrong type for '%s' property: '%s', '%s', '%s', '%s', '%s' or '%s' expected.
fr_fr: Mauvais type pour la propriété '%s' : '%s', '%s', '%s', '%s', '%s' ou '%s' attendu.

source: Wrong type for '%s' property: '%s', '%s', or '%s' expected.
fr_fr: Mauvais type pour la propriété '%s' : '%s', '%s', ou '%s' attendu.

source: Wrong type for '%s' property: 1 x 3 real vector or a 'R|G|B' string expected.
fr_fr: Mauvais type pour la propriété '%s' : un vecteur réel de taille 1 x 3 ou une chaîne de caractères 'R|G|B' attendu.

source: Wrong type for '%s' property: A 1 x %d real row vector expected.
fr_fr: Mauvais type pour la propriété '%s' : Un vecteur réel de taille 1 x %d attendu.

source: Wrong type for '%s' property: A real expected.
fr_fr: Mauvais type pour la propriété '%s' : Un réel attendu.

source: Wrong type for '%s' property: A real row vector or a string expected.
fr_fr: Mauvais type pour la propriété '%s' : Un vecteur ligne de réels ou une chaîne de caractères attendu.

source: Wrong type for '%s' property: A string expected.
fr_fr: Mauvais type pour la propriété '%s' : Une chaîne de caractères attendue.

source: Wrong type for '%s' property: A string or a 1 x %d real row vector expected.
fr_fr: Mauvais type pour la propriété '%s' : Une chaîne de caractères ou un vecteur réel de taille 1 x %d attendu.

source: Wrong value for '%s' property: '%s' or '%s' expected.
fr_fr: Mauvaise valeur pour la propriété '%s' : '%s' ou '%s' attendu.

source: Wrong value for '%s' property: '%s', '%s' or '%s' expected.
fr_fr: Mauvaise valeur pour la propriété '%s' : '%s', '%s' ou '%s' attendu.

source: Wrong value for '%s' property: '%s', '%s', '%s' or '%s' expected.
fr_fr: Mauvaise valeur pour la propriété '%s' : '%s', '%s', '%s' ou '%s' attendu.

source: Wrong value for '%s' property: '%s', '%s', '%s', '%s' or '%s' expected.
fr_fr: Mauvaise valeur pour la propriété '%s' : '%s', '%s', '%s', '%s' ou '%s' attendu.

source: Wrong value for '%s' property: '%s', '%s', '%s', '%s', '%s' or '%s' expected.
fr_fr: Mauvaise valeur pour la propriété '%s' : '%s', '%s', '%s', '%s', '%s' ou '%s' attendu.

source: Wrong value for '%s' property: '%s', '%s', or '%s' expected.
fr_fr: Mauvaise valeur pour la propriété '%s' : '%s', '%s', ou '%s' attendu.

source: Wrong value for '%s' property: 'light', 'normal', 'demi' or 'bold' expected.
fr_fr: Mauvaise valeur pour la propriété '%s' : 'light', 'normal', 'demi' ou 'bold' attendu.

source: Wrong value for '%s' property: 1 x 3 real vector or a 'R|G|B' string expected.
fr_fr: Mauvaise valeur pour la propriété '%s' : un vecteur réel de taille 1 x 3 ou une chaîne de caractères 'R|G|B' attendu.

source: Wrong value for '%s' property: A '%s' or '%s' handle expected.
fr_fr: Mauvaise valeur pour la propriété '%s' : Un '%s' ou un handle de type '%s' attendu.

source: Wrong value for '%s' property: A String containing a numeric value expected.
fr_fr: Valeur erronée pour la propriété '%s': une chaine de caractères contenant une avleur numérique est attendue.

source: Wrong value for '%s' property: A real expected.
fr_fr: Mauvaise valeur pour la propriété '%s' : Un réel attendu.

source: Wrong value for '%s' property: A string expected.
fr_fr: Mauvaise valeur pour la propriété '%s' : Une chaîne de caractères attendue.

source: Wrong value for '%s' property: A string or a 1 x %d real row vector expected.
fr_fr: Mauvaise valeur pour la propriété '%s' : Une chaîne de caractères ou un vecteur réel de taille x %d attendu.

source: Xcos files
fr_fr: fichier Xcos

source: Yes
fr_fr: Oui

source: You clicked on menu ''%s''.
fr_fr: Vous avez cliqué sur le menu ''%s''.

source: You selected ''%s''.
fr_fr: Vous avez sélectionné ''%s''.

source: Zoom Area
fr_fr: Zone de Zoom

source: blue
fr_fr: bleu

source: checked
fr_fr: coché

source: createPopupItems: found an empty cascading menu.
fr_fr: createPopupItems : un menu déroulant vide a été trouvé.

source: disp("WARNING: Despite of our previous warning, you chose to use Scilab with advanced graphics capabilities. Type ""help usecanvas"" for more information.")
fr_fr: disp("Attention: Malgré le precedent avertissement, vous avez choisi d''utiliser Scilab en mode graphique avancé. Voir ""help usecanvas"" pour plus d''informations.")

source: disp("WARNING: Due to your configuration limitations, Scilab switched in a mode where mixing uicontrols and graphics is not available. Type ""help usecanvas"" for more information.")
fr_fr: disp("ATTENTION : A cause des limitations de votre configuration, Scilab est passé dans un mode dans lequel mélanger des uicontrols et des graphiques n''est pas possible. Tapez ""help usecanvas"" pour plus d''information.")

source: disp("WARNING: Due to your video card drivers limitations, that are not able to manage OpenGL, Scilab will not be able to draw any graphics. Please update your driver.")
fr_fr: disp("ATTENTION : A cause des limitations des pilotes de votre carte graphique, qui ne sont pas capable de gérer OpenGL, Scilab ne pourra pas tracer de graphiques. Veuillez mettre vos pilotes à jour.")

source: green
fr_fr: vert

source: red
fr_fr: rouge

source: unchecked
fr_fr: non coché

source: yellow
fr_fr: jaune
