Repository: ScilabOrg/scilab
Catalog: scilab/modules/gui/locales/*/gui.po
Languages: fr_fr

source: %s: #%d matching nodes.
fr_fr: %s: #%d noeuds correspondants.

source: %s: #%d matching parent nodes.
fr_fr: %s: n° %d noeuds parent correspondants.

source: %s: An error occurred: %s.
fr_fr: %s : Une erreur est apparue : %s.

source: %s: An exception occurred: %s %s
fr_fr: %s: Une exception est apparue: %s %s

source: %s: Could not create 'Uicontrol' handle.
fr_fr: %s : Ne peux pas créer un handle de type 'Uicontrol'.

source: %s: Could not create uicontrol of type %s.
fr_fr: %s: Ne peux pas créer un uicontrol de type %s.

source: %s: Could not destroy this object.
fr_fr: %s : Impossible de détruire cet objet.

source: %s: Could not set property '%s'.
fr_fr: %s : Ne peux pas affecter la propriété '%s'.

source: %s: Figure number must be given when not in '%s' mode.
fr_fr: %s : Le numéro de figure doit être donné quand on n'est pas dans le mode '%s'.

source: %s: Function not available in NWNI mode.
fr_fr: %s : Fonction non disponible en mode NWNI.

source: %s: Invalid node.
fr_fr: %s: Noeud invalide.

source: %s: Invalid parent node.
fr_fr: %s: Noeud parent invalide.

source: %s: Invalid position ''%s''.
fr_fr: %s: Position invalide ''%s''.

source: %s: No matching node.
fr_fr: %s: Pas de noeud correspondant.

source: %s: No more memory.
fr_fr: %s : Plus de mémoire disponible.

source: %s: No results founded for property ''%s'' and value ''%s''.
fr_fr: %s: Pas de résultats trouvés pour la propriété ''%s'' et la valeur ''%s''.

source: %s: No results founded.
fr_fr: %s: Pas de résultats trouvés.

source: %s: Only available under 'STANDARD' mode.
fr_fr: %s : Disponible seulement dans le mode 'STANDARD'.

source: %s: The file %s does not exist.
fr_fr: %s : Le fichier %s n'existe pas.

source: %s: Type %s is not implemented.
fr_fr: %s : Le type %s n'est pas encore implémenté.

source: %s: Unknown property: %s for '%s' handles.
fr_fr: %s : Propriété inconnue : %s pour les handles de type '%s'.

source: %s: Wrong input argument #%d: '%s' or '%s' expected
fr_fr: %s : Mauvais argument d'entrée n°%d : '%s' ou '%s' attendu

source: %s: Wrong input arguments: %s or %s expected.
fr_fr: %s : Mauvais arguments d'entrée : %s ou %s attendu.

source: %s: Wrong input arguments: %s, %s or %s expected.
fr_fr: %s : Mauvais arguments d'entrée : %s, %s ou %s attendu.

source: %s: Wrong input arguments: '%s' expected.
fr_fr: %s : Mauvais arguments d'entrée : '%s' attendu.

source: %s: Wrong input arguments: '%s' or '%s' expected.
fr_fr: %s : Mauvais arguments d'entrée : '%s' ou '%s' attendu.

source: %s: Wrong input arguments: '%s', '%s' or '%s' expected.
fr_fr: %s : Mauvais arguments d'entrée : '%s', '%s' ou '%s' attendu.

source: %s: Wrong number of input argument(s): At least %d expected.
fr_fr: %s : Mauvais nombre d'argument(s) en entrée : Au moins %d attendus.

source: %s: Wrong number of input arguments: %d expected.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : %d attendu.

source: %s: Wrong number of input arguments: %d or %d expected.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : %d ou %d attendus.

source: %s: Wrong number of input arguments: %d to %d expected.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : %d à %d attendus.

source: %s: Wrong number of output arguments: %d or %d expected.
fr_fr: %s : Mauvais nombre d'arguments de sortie : %d ou %d attendus.

source: %s: Wrong size for %s: A real expected.
fr_fr: %s : Mauvaise dimension pour %s : Un réel attendu.

source: %s: Wrong size for %s: A row vector of strings expected.
fr_fr: %s : Mauvaise dimension pour %s : Un vecteur ligne de chaîne de caractères attendu.

source: %s: Wrong size for input argument #%d: %d x %d matrix of strings expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Une matrice de chaîne de caractères de taille %d x %d attendue.

source: %s: Wrong size for input argument #%d: A '%s' handle expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Un handle de type '%s' attendu.

source: %s: Wrong size for input argument #%d: A '%s' or a '%s' handle expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Un '%s' ou un handle de type '%s' attendu.

source: %s: Wrong size for input argument #%d: A ''Figure'' handle or a real expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Un handle de type "Figure" ou un réel attendu.

source: %s: Wrong size for input argument #%d: A 1 x %d real row vector expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Un 1 x %d vecteur ligne réel attendu.

source: %s: Wrong size for input argument #%d: A Real Scalar or a 'Figure' handle expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Un scalaire réel ou un handle de type 'Figure' attendu.

source: %s: Wrong size for input argument #%d: A boolean expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Un booléen attendu.

source: %s: Wrong size for input argument #%d: A boolean matrix expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Une matrice de booléens attendue.

source: %s: Wrong size for input argument #%d: A graphic handle expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Un handle graphique attendu.

source: %s: Wrong size for input argument #%d: A real expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n° %d : Un réel attendu.

source: %s: Wrong size for input argument #%d: A string expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Une chaîne de caractères attendue.

source: %s: Wrong size for input argument #%d: A string expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Une chaîne de caractères attendue.

source: %s: Wrong size for input argument #%d: A string matrix expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Une matrice de chaîne de caractères attendue.

source: %s: Wrong size for input argument #%d: It must have same dimensions that argument #%d.
fr_fr: %s: Mauvaise taille pour l'argument d'entrée %d: Il doit avoir les mêmes dimensions que l'argument %d.

source: %s: Wrong size for input argument #%d: Matrix of strings expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Une matrice de chaîne de caractères attendue.

source: %s: Wrong size for input argument #%d: String expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Une chaîne de caractères attendue.

source: %s: Wrong size for input argument #%d: Vector of strings expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Un vecteur de chaîne de caractères attendu.

source: %s: Wrong type for %s: A list expected.
fr_fr: %s : Mauvais type pour %s : Une liste attendue.

source: %s: Wrong type for %s: A real expected.
fr_fr: %s : Mauvais type pour %s : Un réel attendu.

source: %s: Wrong type for %s: A row vector of strings expected.
fr_fr: %s : Mauvais type pour %s : Un vecteur ligne de chaîne de caractères attendu.

source: %s: Wrong type for %s: A string expected.
fr_fr: %s : Mauvais type pour %s : Une chaîne de caractères attendue.

source: %s: Wrong type for ''%s'' property: A string expected.
fr_fr: %s : Mauvais type pour la propriété ''%s'' : Une chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d or #%d: String expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d ou %d : Chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: A '%s' handle expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un handle de type '%s' attendu.

source: %s: Wrong type for input argument #%d: A '%s' or '%s' handle expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un handle de type '%s' ou '%s' attendu.

source: %s: Wrong type for input argument #%d: A '%s' or a '%s' handle expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un '%s' ou un handle de type '%s' attendu.

source: %s: Wrong type for input argument #%d: A '%s', '%s' or '%s' handle expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un handle de type '%s', '%s' ou '%s' attendu.

source: %s: Wrong type for input argument #%d: A 1 x %d real row vector expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un 1 x %d vecteur ligne réel attendu.

source: %s: Wrong type for input argument #%d: A Real Scalar or a 'Figure' handle expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un scalaire réel ou un handle de type 'Figure' attendu.

source: %s: Wrong type for input argument #%d: A boolean expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n° %d : Un booléen attendu.

source: %s: Wrong type for input argument #%d: A graphic handle expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un handle graphique attendu.

source: %s: Wrong type for input argument #%d: A graphic handle or a real expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un handle graphique ou un réel attendu.

source: %s: Wrong type for input argument #%d: A graphic handle or a string expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un handle graphique ou une chaîne de caractères attendu.

source: %s: Wrong type for input argument #%d: A list expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Une liste attendue.

source: %s: Wrong type for input argument #%d: A real expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un réel est attendu.

source: %s: Wrong type for input argument #%d: A real or Figure handle expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un réel ou un handle de type 'Figure' attendu.

source: %s: Wrong type for input argument #%d: A real or a Figure handle expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un réel ou un handle de type 'Figure' attendu.

source: %s: Wrong type for input argument #%d: A real or a string expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un réel ou une chaîne de caractères attendu.

source: %s: Wrong type for input argument #%d: A string expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Une chaîne de caractères est attendue.

source: %s: Wrong type for input argument #%d: A string matrix expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Une matrice de chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: A string or a real expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Une chaîne de caractères ou un réel attendu.

source: %s: Wrong type for input argument #%d: A string or a string vector expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Une chaîne de caractères ou un vecteur de chaîne de caractères attendu.

source: %s: Wrong type for input argument #%d: A string vector expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un vecteur de chaîne de caractères attendu.

source: %s: Wrong type for input argument #%d: A two-item list expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Une liste à deux éléments attendue.

source: %s: Wrong type for input argument #%d: Boolean expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Booléen attendu.

source: %s: Wrong type for input argument #%d: Matrix of strings expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Une matrice de chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: Non-negative integer expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un entier non-négatif attendu.

source: %s: Wrong type for input argument #%d: Non-negative integers expected
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Des entiers non-négatifs attendus

source: %s: Wrong type for input argument #%d: Real or complex vector expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un vecteur réel ou complexe attendu.

source: %s: Wrong type for input argument #%d: String expected.
fr_fr: %s : Mauvais type pour l'argument n° %d : Chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: String or Tree expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Chaîne de caractères ou arbre attendu.

source: %s: Wrong type for input argument #%d: Tree expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Arbre attendu.

source: %s: Wrong type for input argument #%d: Tree or String expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Arbre ou chaîne de caractères attendu.

source: %s: Wrong type for input argument #%d: Vector of strings expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Un vecteur de chaîne de caractères attendu.

source: %s: Wrong type for input argument #%d: must be ''label'', ''icon'' or ''callback''.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: doit être ''label'', ''icon'' ou ''callback''.

source: %s: Wrong type for input arguments from #%d: Tree expected.
fr_fr: %s: Mauvais type pour les arguments d'entrée du n° %d: Arbre attendu.

source: %s: Wrong type for parent: Figure or uimenu expected.
fr_fr: %s : Mauvais type pour parent : Une figure ou un uimenu attendu.

source: %s: Wrong value for '%s' property: points, normalized, inches, centimeters or pixels expected.
fr_fr: %s : Mauvaise valeur pour la propriété '%s' : points, normalisé, pouces, centimètres ou pixels attendu.

source: %s: Wrong value for ''%s'' property: %d, %d or %d expected.
fr_fr: %s : Mauvaise valeur pour la propriété ''%s'' : %d, %d ou %d attendu.

source: %s: Wrong value for input argument #%d: '%s' or '%s' expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : '%s' ou '%s' attendu.

source: %s: Wrong value for input argument #%d: '%s', '%s' or '%s' expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : '%s', '%s' ou '%s' attendu.

source: %s: Wrong value for input argument #%d: ''%s'' or ''%s'' expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : ''%s'' ou ''%s'' attendu.

source: %s: Wrong value for input argument #%d: ''%s'', ''%s'' or ''%s'' expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : ''%s'', ''%s'' ou ''%s'' attendu.

source: %s: Wrong value for input argument #%d: 'Graphic Window Number %d' does not exist.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : 'La fenêtre graphique numéro %d' n'existe pas.

source: %s: Wrong value for input argument #%d: A valid '%s' handle expected.
fr_fr: %s: Mauvaise valeur pour l'argument %d: Un handle valide '%s' attendu.

source: %s: Wrong value for input argument #%d: Must be > %d expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Doit être > %d.

source: %s: Wrong value for input argument #%d: Must be >= %d expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Doit être >= %d attendu.

source: %s: Wrong value for input argument #%d: Non-negative integers expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Des entiers non-négatifs attendus.

source: %s: Wrong value for input argument #%d: this handle does not exist.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : ce handle n'existe pas.

source: %s: can not add a menu in console in this mode: %s.
fr_fr: %s: ne peux pas ajouter de menu dans la console dans ce mode: %s.

source: %s: can not add a menu in this mode: %s.
fr_fr: %s: ne peux pas ajouter de menu dans ce mode: %s.

source: %s: function not available in NWNI mode.
fr_fr: %s : fonction non disponible en mode NWNI.

source: &Abort
fr_fr: &Abandonner

source: &About Scilab...
fr_fr: &A propos de Scilab

source: &Axes properties
fr_fr: Propriétés des axes

source: &Bug And Request database
fr_fr: Gestionnaire de &Bugs

source: &Change current directory...
fr_fr: &Changer le répertoire courant....

source: &Clear figure
fr_fr: &Effacer la figure

source: &Close
fr_fr: &Fermer

source: &Colors
fr_fr: &Couleurs

source: &Control
fr_fr: &Contrôle

source: &Copy
fr_fr: &Copier

source: &Copy to clipboard
fr_fr: &Copier dans le presse-papier

source: &Display current directory
fr_fr: &Afficher le répertoire courant

source: &Edit
fr_fr: &Edition

source: &Empty clipboard
fr_fr: &Vider le presse-papier

source: &Execute...
fr_fr: &Exécuter...

source: &Export to...
fr_fr: &Exporter vers...

source: &FIG
fr_fr: &GIF

source: &Figure properties
fr_fr: &Propriétés de la figure

source: &File
fr_fr: &Fichier

source: &Font...
fr_fr: &Police...

source: &Interrupt
fr_fr: &Interrompre

source: &Load environment...
fr_fr: &Charger un environnement...

source: &Load...
fr_fr: &Charger...

source: &Mailing lists
fr_fr: &Listes de diffusion

source: &Matlab to Scilab translator
fr_fr: Convertisseur &Matlab vers Scilab

source: &New figure...
fr_fr: &Nouvelle figure...

source: &Open a file...
fr_fr: &Ouvrir un fichier...

source: &Paste
fr_fr: Co&ller

source: &Preferences
fr_fr: &Préférences

source: &Print...
fr_fr: &Imprimer...

source: &Quit
fr_fr: &Quitter

source: &Redraw figure
fr_fr: &Redessiner la figure

source: &Resume
fr_fr: &Reprendre

source: &Save environment...
fr_fr: &Enregistrer l'environnement...

source: &Save...
fr_fr: &Enregistrer...

source: &Scilab Help
fr_fr: Aide &Scilab

source: &Select all
fr_fr: &Sélectionner tout

source: &Select as current figure
fr_fr: &Sélectionner comme figure courante

source: &Start entity picker
fr_fr: Démarrer le &Sélectionneur d'entité

source: &Tools
fr_fr: &Outils

source: &UnZoom
fr_fr: &Dézoomer

source: &Vectorial export
fr_fr: Export &Vectoriel

source: &Web links
fr_fr: &Liens Internet

source: &Zoom
fr_fr: &Zoomer

source: '. Please specify a valid file format.
fr_fr: '. Spécifiez un format de fichier valide SVP.

source: <Enter color name here>
fr_fr: <Entrer le nom de la couleur ici>

source: About Scilab...
fr_fr: A propos de Scilab...

source: Acknowledgements
fr_fr: Remerciements

source: Add color in listbox
fr_fr: Ajouter une couleur dans listbox

source: All %s files
fr_fr: Tous les fichiers %s

source: All Scilab files
fr_fr: Tous les fichiers Scilab

source: All files
fr_fr: Tous les fichiers

source: An error occured:
fr_fr: Une erreur s'est produite :

source: Answer given for %s has incorrect type %s.
fr_fr: La réponse donnée pour %s a un type incorrect %s.

source: Answer given for %s has invalid dimension: waiting for dimension %s.
fr_fr: La réponse donnée pour %s n'a pas la bonne dimension : dimension attendue %s.

source: Answer given for %s is incorrect see error message in scilab window.
fr_fr: La réponse donnée pour %s est incorrecte, voir le message d'erreur dans la fenêtre scilab.

source: Attributes
fr_fr: Caractéristiques

source: Authors: Scilab Consortium / INRIA / ENPC / Contributors
fr_fr: Auteurs : Consortium Scilab / INRIA / ENPC / Contributeurs

source: Back
fr_fr: Précédent

source: Bold
fr_fr: Gras

source: C&lose
fr_fr: &Fermer

source: C&ut
fr_fr: Co&uper

source: Cancel
fr_fr: Annuler

source: CeCILL License
fr_fr: Licence CeCILL

source: Change Current Directory
fr_fr: Changer le Répertoire Courant

source: Choose Font...
fr_fr: Choisir la police...

source: Clear &History
fr_fr: Effacer l'&Historique

source: Clear C&onsole
fr_fr: Effacer la c&onsole

source: Clear Console
fr_fr: Effacer la console

source: Clear History
fr_fr: Vider l'Historique

source: Close
fr_fr: Fermer

source: Colors list edition
fr_fr: Edition de la liste de couleurs

source: Console &Background...
fr_fr: &Arrière-plan de la console ...

source: Console &Font...
fr_fr: &Police de la console ...

source: Console Background...
fr_fr: Arrière plan de la console

source: Console Font...
fr_fr: Police de la console...

source: Control Plot3d
fr_fr: Contrôles Plot3d

source: Copy
fr_fr: Copier

source: Cut
fr_fr: Couper

source: Display selection
fr_fr: Afficher la sélection

source: Do you really want to quit Scilab?
fr_fr: Voulez-vous réellement quitter Scilab ?

source: Edit in the Scilab Text Editor
fr_fr: Editer avec l'éditeur de Scilab

source: Environment loaded.
fr_fr: Environnement chargé.

source: Environment saved.
fr_fr: Environnement sauvegardé.

source: Error
fr_fr: Erreur

source: Error on export
fr_fr: Erreur pendant l'exportation

source: Error. A signal has been caught.
fr_fr: Erreur. Un signal a été intercepté.

source: Execute into Scilab
fr_fr: Executer dans Scilab

source: Execution done.
fr_fr: Exécution terminée.

source: Exit figure
fr_fr: Sortir de la figure

source: Export
fr_fr: Exporter

source: FIG image
fr_fr: Image FIG

source: Figure loaded.
fr_fr: Figure chargée.

source: Figure saved.
fr_fr: Figure enregistrée.

source: File
fr_fr: Fichier

source: File already exist
fr_fr: Le fichier existe déjà

source: File already exists
fr_fr: Le fichier existe déjà

source: Font
fr_fr: Police de caractères

source: Font Chooser
fr_fr: Sélecteur de police

source: Forward
fr_fr: Suivant

source: GIF image
fr_fr: Image GIF

source: GUI
fr_fr: Interface graphique

source: Help Browser
fr_fr: Navigateur d'aide

source: Help about '
fr_fr: Aide sur ...

source: Help about a selected text
fr_fr: Aide sur le texte sélectionné

source: Help on a selected keyword
fr_fr: Aide sur le mot selectionné

source: Impossible to get current look and feel
fr_fr: Impossible de lire le thème courant

source: Italic
fr_fr: Italique

source: JPEG image
fr_fr: Image JPEG

source: Launch plot2d
fr_fr: Lancer plot2d

source: Launch plot3d
fr_fr: Lancer plot3d

source: Left click to start selection of the zooming area. Right click to cancel.
fr_fr: Clic gauche pour commencer la sélection de la zone de zoom. Clic droit pour annuler.

source: Left click to terminate selection. Right click to cancel.
fr_fr: Clic gauche pour terminer la sélection. Clic droit pour annuler.

source: Loading help browser...
fr_fr: Chargement du navigateur d'aide...

source: M&odule manager - ATOMS
fr_fr: Gestionnaire de M&odule - ATOMS

source: Menu ''%s'' is %s.
fr_fr: Menu ''%s'' est %s.

source: Module manager - ATOMS
fr_fr: Gestionnaire de module - ATOMS

source: Monospaced
fr_fr: Monospacé

source: No
fr_fr: Non

source: No '%s' property for this object.
fr_fr: Pas de propriété '%s' pour cet objet.

source: No '%s' property for uicontrols of style: %s.
fr_fr: Pas de propriété '%s' pour les uicontrols de style : %s.

source: No color selected.
fr_fr: Aucune couleur sélectionnée.

source: No print service found.
fr_fr: Aucun service d'impression n'a été trouvé.

source: No text selected
fr_fr: Aucun texte selectionné

source: Open a file
fr_fr: Ouvrir un fichier

source: Original View
fr_fr: Vue originale

source: P&age setup...
fr_fr: Mise en p&age...

source: PDF image
fr_fr: Image PDF

source: PNG image
fr_fr: Image PNG

source: PPM image
fr_fr: image PPM

source: Paste
fr_fr: Coller

source: Please enter a color name first.
fr_fr: Entrer un nom de couleur d'abord SVP

source: Please specify a file format
fr_fr: Spécifiez un format de fichier SVP

source: Popupmenu selection
fr_fr: Sélection popupmenu

source: Preview
fr_fr: Aperçu

source: Print...
fr_fr: Imprimer...

source: Quit Scilab
fr_fr: Quitter Scilab

source: Quit demonstration
fr_fr: Quitter la démonstration

source: Replace existing file?
fr_fr: Replacer le fichier existant ?

source: Rotate
fr_fr: Rotation

source: S&top entity picker
fr_fr: Arrê&ter le sélectionneur d'entité

source: SVG image
fr_fr: Image SVG

source: Save and execute
fr_fr: Enregistrer et lancer

source: Scicos files
fr_fr: Fichiers xcos

source: Scilab &ATOMS Web Site
fr_fr: Portail web &ATOMS

source: Scilab &Demonstrations
fr_fr: &Démonstrations de Scilab

source: Scilab &Help
fr_fr: Aide de &Scilab

source: Scilab &Web Site
fr_fr: Site &Web Scilab

source: Scilab '%s' module disabled in -nogui or -nwni mode.
fr_fr: Le module Scilab '%s' est désactivé en mode -nogui ou -nwni.
