Repository: ScilabOrg/scilab
Catalog: scilab/modules/development_tools/locales_macros/*.po
Languages: fr_fr

source: %s is not an installed module
fr_fr: %s n''est pas un module installé

source: %s is not an installed module or toolbox
fr_fr: %s n''est pas une toolbox ou un module installé

source: %s: Wrong first input argument: File with .dia suffix expected.
fr_fr: %s : Mauvais premier argument: Fichier avec un suffixe .dia attendu.

source: %s: Wrong size for input argument.
fr_fr: %s : Mauvaise dimension pour l''argument d''entrée.

source: No variable %s_ref in reference file
fr_fr: Pas de variable %s_ref dans le fichier de référence

source: Test Failed. See : diff -wu %s
fr_fr: Echec du test. Voir : diff -wu %s

source: Test Failed. See : fc /L /N %s
fr_fr: Echec du test. Voir : fc /L /N %s

source: Test failed ERROR DETECTED while executing %s
fr_fr: Echec du test ERREUR DETECTEE pendant l''execution de %s

source: Test passed
fr_fr: Succès du test

source: The ref file (%s) doesn''t exist
fr_fr: Le fichier ref (%s) n''existe pas

source: The test %s is not available from the %s module
fr_fr: Le test %s n''est pas disponible dans le module %s

source: error : Input argument sizes are not valid
fr_fr: erreur : les dimensions de l''argument d''entrée ne sont pas valides
