Repository: ScilabOrg/scilab
Catalog: scilab/modules/interpolation/locales/*/interpolation.po
Languages: fr_fr, ja_jp, pl_pl

source: %s: %s must be a real %d-dim hypermatrix.
ja_jp: %s: %s は、実 %d-次 次元配列でなければなりません。
pl_pl: %s: %s musi być liczbą rzeczywista %d-dim hipermacierz.

source: %s: Duplicate nodes or all nodes colinears (ier = %d).
ja_jp: %s: 重複した節、または、全ての直線節(ier = %d)
pl_pl: %s: Powielone węzły lub wszystkie węzły są współliniowe (ier = %d).

source: %s: For a clamped spline, you must give the endpoint slopes.
ja_jp: %s: スプライン制限のために、端点勾配を与えなくてはなりません。
pl_pl: %s: Dla zaciśniętego splotu, musisz podać końcowe zbocza.

source: %s: Grid abscissae of dim %d not in strict increasing order.
ja_jp: %s: %d 次のグリッド横軸は、厳密な増加順序ではありません。
pl_pl: %s: Siatka osi odciętych %d nie w ścisłej kolejności rosnącej.

source: %s: Not enought points for the fit.
ja_jp: %s: 適合のための十分な地点ではありません。

source: %s: Problem with 'flag' = %d
fr_fr: %s: Problème avec 'flag' = %d
ja_jp: %s: 'flag' = %d の問題
pl_pl: %s: Problem z 'flag' = %d

source: %s: Size incompatibility between grid points and grid values in dimension %d.
fr_fr: %s: Incompatibilité de dimension entre les points de la grille et les valeurs de la grille sur la dimension %d.
ja_jp: %s: 次元 %d グリッド値 とグリッド点との間でサイズに互換性がありません。
pl_pl: %s: Rozmiar niekompatybilny pomiędzy punktami i wartościami sieci w wymiarze %d.

source: %s: Size incompatibility between grid points and values in dimension %d or %d.
ja_jp: %s: 次元 %d 値 と %d のグリッド点との間でサイズに互換性がありません。
pl_pl: %s: Rozmiar niekompatybilny pomiędzy punktami i wartościami sieci w wymiarze %d or %d.

source: %s: Size incompatibility between grid points and values in dimension %d.
fr_fr: %s: Incompatibilité de dimension entre les points et les valeurs de la grille sur la dimension %d.
ja_jp: %s: 次元 %d 値 とグリッド点との間でサイズに互換性がありません。
pl_pl: %s: Rozmiar niekompatybilny pomiędzy punktami i wartościami sieci w wymiarze %d.

source: %s: Warning: Rank deficiency of the least square matrix.
ja_jp: %s: 警告: 最小の正方行列の階数落ちです。
pl_pl: %s: Ostrzeżenie: Brak rangi najmniejszych macierzy kwadratowych.

source: %s: Wrong number of input argument(s).
fr_fr: %s : Mauvais nombre d'argument(s) en entrée.
ja_jp: %s: 入力引数(s)で不正な数です。
pl_pl: %s: Zły liczba parametru(-ów) wejściowego(-ych).

source: %s: Wrong number of input arguments: Must be between %d and %d.
ja_jp: %s: 入力引数の不正な数: %d と %d の間でなくてはなりません。
pl_pl: %s: Zła liczba parametrów wejściowych: Musi być pomiędzy %d i %d.

source: %s: Wrong size for input argument #%d.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d.
ja_jp: %s: 入力引数 #%d で不正なサイズです。
pl_pl: %s: Zły rozmiar parametru wejściowego #%d.

source: %s: Wrong size for input argument #%d: A real 3-dimension hypermatrix expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Une hypermatrice réelle à 3 dimensions attendue.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 実３次元配列を想定します。
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano rzeczywistej 3-wymiarowej hipermacierzy.

source: %s: Wrong size for input argument #%d: Endpoint slopes.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 端点勾配
pl_pl: %s: Zły rozmiar argumentu wejściowego #%d: punkt końcowy stoku.

source: %s: Wrong size for input argument #%d: Must be %s.
ja_jp: %s: 入力引数 #%d で不正なサイズ: %s でなければなりません。
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Musi być %s.

source: %s: Wrong size for input argument #%d: Two rows expected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 二つの行を想定します。
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano dwóch rzędów.

source: %s: Wrong size for input argument #%d: Vector expected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: ベクトルを想定します。
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano wektora.

source: %s: Wrong size for input argument #%d: Vector or matrix expected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: ベクトル、または、行列を想定します。
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano wektora lub macierzy.

source: %s: Wrong size for input arguments #%d and #%d: Same size expected.
ja_jp: %s: 入力引数 #%d と #%d で不正なサイズ: 同じサイズを想定します。
pl_pl: %s: Zły rozmiar parametrów wejściowych #%d i #%d: Oczekiwano tego samego rozmiaru.

source: %s: Wrong size for input arguments #%d and #%d: Same sizes expected.
ja_jp: %s: 入力引数 #%d と #%d で不正なサイズ: 小さいサイズを想定します。
pl_pl: %s: Zły rozmiar parametrów wejściowych #%d i #%d: Oczekiwano tego samego rozmiaru.

source: %s: Wrong size for input arguments #%d and #%d: Vector of same size expected.
ja_jp: %s: 入力引数 #%d と #%d で不正なサイズ: 小さいサイズ、またはベクトルを想定します。
pl_pl: %s: Zły rozmiar parametrów wejściowych #%d i #%d: Oczekiwano wektorów tego samego rozmiaru.

source: %s: Wrong size for input arguments #%d, #%d and #%d: Same sizes expected.
ja_jp: %s: 入力引数 #%d, #%d と #%d で不正なサイズ: 小さなサイズを想定します。
pl_pl: %s: Zły rozmiar parametrów wejściowych #%d, #%d i #%d: Oczekiwano tego samego rozmiaru.

source: %s: Wrong size for input arguments #%d, #%d or #%d.
ja_jp: %s: 入力引数 #%d, #%d または #%d. で不正なサイズです。
pl_pl: %s: Zły rozmiar parametrów wejściowych #%d, #%d i #%d.

source: %s: Wrong size for input arguments: x, y and z grids must have at least %d points.
ja_jp: %s: 入力引数で不正なサイズ: x, y と z グリッド は最も小さな %d 点を持っていなくてはなりません。
pl_pl: %s: Zły rozmiar argumentu wejściowego: x, y i z siatki muszą być co najmniej %d punktów.

source: %s: Wrong type for input argument #%d: %s tlist expected.
ja_jp: %s: 入力引数 #%d で不正な型: %s tlist を想定します。
pl_pl: %s: Nieprawidłowy typ dla argumentu wejściowego #%d: %s oczekiwana tlist.

source: %s: Wrong type for input argument #%d: Array of reals expected.
ja_jp: %s: 入力引数 #%d で不正な型: 実の配列を想定します。
pl_pl: %s: Zły typ parametru wejściowego #%d: Oczekiwano tablicy liczb rzeczywistych.

source: %s: Wrong value for input argument #%d: ''%s'' or ''%s'' or ''%s'' expected.
ja_jp: %s: 入力引数 #%d で不正な値: ''%s'' または ''%s'' また ''%s'' を想定します。
pl_pl: %s: Zła wartość argumentu wejściowego #%d: Oczekiwano ''%s'' lub ''%s'' lub ''%s'' .

source: %s: Wrong value for input argument #%d: ''%s'' or real expected.
ja_jp: %s: 入力引数 #%d で不正な値: ''%s'' または、実を想定します。
pl_pl: %s: Zła wartość parametru wejściowego #%d: Oczekiwano ''%s'' lub liczby rzeczywistej .

source: %s: Wrong value for input argument #%d: Not (strictly) increasing or +-inf detected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: (厳密に)増加ではありません、または +-inf を見つけました。
pl_pl: %s: Zła wartość parametru wejściowego #%d: Wykryto wartość nie (tylko) rosnącą lub +-inf.

source: %s: Wrong value for input argument #%d: Reals expected but some NaN found.
ja_jp: %s: 入力引数 #%d で不正な値: 予想された実、しかし、いくつかのNaNが見つかりました。
pl_pl: %s: Zła wartość parametru wejściowego #%d: Oczekiwano rzeczywistych ale znaleziono kilka nie-liczb.

source: %s: Wrong value for input argument #%d: Vector with %d components expected.
ja_jp: %s: 入力引数 #%d で不正な値: %d 構成要素のベクトルを想定します。
pl_pl: %s: Zła wartość parametru wejściowego #%d: Oczekiwano wektora z %d składowymi.

source: %s: Wrong value for input arguments #%d and #%d: Same sizes expected.
ja_jp: %s: 入力引数 #%d と #%d で不正な値: 小さいサイズを想定します。
pl_pl: %s: Zły rozmiar parametrów wejściowych #%d i #%d: Oczekiwano tego samego rozmiaru.

source: %s: Wrong value for periodic spline %s: Must be equal to %s.
ja_jp: %s: 周期スプライン %s で不正な値: %s に等しくなければなりません。
pl_pl: %s: Zła wartość dla okresowego splotu %s: Musi być równa %s.

source: %s: Wrong values for input argument #%d.
fr_fr: %s: Mauvaises valeurs pour l'argument d'entrée n° %d.
ja_jp: %s: 入力引数 #%d で不正な値です。
pl_pl: %s: Złe wartości parametrów wejściowych #%d.

source: %s: Wrong values for input argument #%d: Unknown '%s' type.
ja_jp: %s: 入力引数 #%d で不正な値: 未知の '%s' 型です。
pl_pl: %s: Złe wartości parametrów wejściowych #%d: Nieznany typ '%s'.

source: %s: Wrong values for input argument #%d: Unsupported '%s' type.
ja_jp: %s: 入力引数 #%d で不正な値: '%s' 型はサポートされません。
pl_pl: %s: Złe wartości parametrów wejściowych #%d: Nieobsługiwany typ '%s'.

source: %s: x and/or y are not in strict increasing order (or +-inf detected)
fr_fr: %s: x et/ou y ne sont pas rangés dans un ordre strictement croissant (ou +-inf détecté)
ja_jp: %s: x あるいは y は、厳密な増加順序を持っていません(または、+-infを見つけました)
pl_pl: %s: x i/lub y nie są w tylko rosnącym porządku (lub wykryto +-inf)

source: %s: xyz must be a (n,3) real matrix with n >= 10
fr_fr: %s: xyz doit être une (n,3) matrice réelle avec n >= 10
ja_jp: %s: xyz は (n,3) , 実行列は、n => 10 です。
pl_pl: %s: xyz musi być macierzą liczb rzeczywistych (n,3) przy n >= 10

source: Wrong type for input argument #%d: Real hypermatrix expected.
ja_jp: 入力引数 #%d で不正な型: 実多次元配列を想定します。
pl_pl: Nieprawidłowy typ dla argumentu wejściowego #%d: Oczekiwano rzeczywistej hipermacierzy.

source: Wrong type for input argument #%d: String expected.
ja_jp: 入力引数 #%d で不正な型: 文字列を想定します。
pl_pl: Zły typ parametru wejściowego #%d: Oczekiwano ciągu.

source: %s: Not enough points for the fit.
pl_pl: %s: Za mało punktów do dopasowania.

source: %s: Wrong size for input arguments.
fr_fr: %s: Mauvaise dimension pour les arguments d'entrée.

source: %s: Wrong values for input argument #%d: Unsupported 'spline' type.
fr_fr: %s: Mauvaise valeurs pour l'argument d'entrée n° %d: Type 'spline' non supporté.

source: %s: Incompatible input arguments '#%d', '#%d' and '#%d': Same sizes expected.
fr_fr: %s: Arguments d'entrée incompatibles '#%d', '#%d' et '#%d': Même dimension attendue.

source: %s: Wrong type for input argument #%d: tensbs3d tlist expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: tlist tensbs3d attendue.

source: %s: Wrong values for input argument #%d: Unsupported 'outmode' type.
fr_fr: %s: Mauvaise valeurs pour l'argument d'entrée n° %d: Type 'outmode' non supporté.

source: %s: duplicate nodes or all nodes colinears (ier = %d).
fr_fr: %s: noeuds dupliqués ou tous les noeuds colinéaires (ier = %d).

source: %s: Incompatible input arguments '#%d' and '#%d': Same sizes expected.
fr_fr: %s: Arguments d'entrée incompatibles '#%d' et '#%d': Même dimension attendue.

source: %s: Wrong values for input argument #%d: Unknown 'outmode' type.
fr_fr: %s: Mauvaise valeurs pour l'argument d'entrée n° %d: Type 'outmode' inconnu.

source: %s: the x, y and z grids must have at least 3 points
fr_fr: %s: les grilles x, y et z doivent avoir au moins 3 points

source: %s: Input argument #%d must be a vector with 3 components.
fr_fr: %s: Argument d'entrée n° %d doit être un vecteur avec 3 composantes.

source: %s: Incompatible input arguments '#%d and '#%d': Same sizes expected.
fr_fr: %s: Arguments d'entrée n° %d et n° %d incompatiblesd: Même tailles attendues.

source: %s: bad input for arg 3
fr_fr: %s: mauvaise entrée pour l'argument 3

source: %s: bad input for x
fr_fr: %s: mauvaise entrée pour x

source: %s: elements of argument %d not (strictly) increasing or +-inf detected.
fr_fr: %s: éléments de l'argument %d non (strictement) croissants ou +-inf détectés.

source: %s warning: rank deficiency of the least square matrix.
fr_fr: %s attention: défaut de rang pour la matrice des moindres carrés.

source: %s: Wrong type for input argument #%d: cshep2d tlist expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: tlist cshep2d attendue.

source: %s: Wrong size for input arguments: Vector of same size expected.
fr_fr: %s: Mauvaise dimension pour les arguments d'entrée: Vecteur de même dimension attendu.

source: %s: Wrong size for input argument #%d: Must be >= %d.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Doit être >= %d.

source: %s: elements of argument #%d not (strictly) increasing or +-inf detected
fr_fr: %s: éléments de l'argument n° %d ne sont pas dans une ordre (strictement) croissant ou +-inf détecté

source: %s: Wrong values for input argument #%d: Unknown 'spline' type.
fr_fr: %s: Mauvaise valeurs pour l'argument d'entrée n° %d: Type 'spline' inconnu.

source: %s: Wrong value for periodic spline y(1): Must be equal to y(n).
fr_fr: %s: Mauvaise valeur pour la spline périodique y(1): Doit être égal à y(n).

source: %s: U must be a real %d-dim hypermatrix.
fr_fr: %s: U doit être une hypermatrice réelle à %d dimensions.

source: %s: Size incompatibility between grid points and values in dim %d or %d.
fr_fr: %s: Incompatibilité de dimension entre les points et les valeurs de la grille sur la dimension %d our %d.

source: Argument %d is not a real hypermatrix.
fr_fr: Argument %d n'est pas une hypermatrice réelle.

source: Argument %d is not a string.
fr_fr: Argument %d n'est pas une chaîne de caractères.
