Repository: ScilabOrg/scilab
Catalog: scilab/modules/scicos/locales/*/scicos.po
Languages: de_de, zh_tw

source: %s.mo cannot be compiled
de_de: %s.mo kann nicht kompiliert werden
zh_tw: %s.mo 無法編譯

source: %s.mo compilation forced
de_de: %s.mo Kompilation erzwungen
zh_tw: %s. 強制 mo 編譯

source: %s.mo must be recompiled
de_de: %s.mo muß kompiliert werden
zh_tw: %s. mo 必須重新編譯

source: %s: An error occurred during the compilation of the Modelica block.
de_de: %s: Ein Fehler ist während der Kompilation des Modelica Blocks aufgetreten.
zh_tw: %s: 在進行 Modelica 方塊的編譯時發生一個錯誤.

source: %s: Cannot find any MO files in the following location: %s.
de_de: %s: kann keine MO Dateien an dem folgenden Ort finden: %s.
zh_tw: %s: 在下列位置中:%s 找不到任何 MO 檔案.

source: %s: Diagram does not compile in pass %d.
de_de: %s: Diagramm kompiliert in Durchlauf %d nicht.
zh_tw: %s: 方塊圖在第 %d 段時無法編譯.

source: %s: Diagram does not compile in pass %d. '),
de_de: %s: Diagramm kompiliert im Durchlauf %d nicht.

source: %s: Error : the following command line failed to execute: %s.
de_de: %s: Fehler: die folgende Kommando-Zeile konnte nicht ausgeführt werden: %s.
zh_tw: %s: 錯誤: 下面 %s 的命令列執行失敗.

source: %s: Error: A scifunc block has not been defined.
de_de: %s: Fehler: ein Scifunc Block wurde nicht definiert.
zh_tw: %s: 錯誤: scifunc 方塊尚未被定義.

source: %s: Error: Modelica compiler (MODELICAC) is unavailable.
de_de: %s: Fehler: Modelica Kompiler (MODELICAC) nicht verfügbar.
zh_tw: %s: 錯誤: Modelica 編譯器 (MODELICAC) 是無效的.

source: %s: Input ports are not numbered properly.
de_de: %s: Eingangsports sind nicht korrekt durchnummeriert.
zh_tw: %s: 輸入埠號並不是數值.

source: %s: Output ports are not numbered properly.
de_de: %s: Ausgangsports sind nicht korrekt durchnummeriert.
zh_tw: %s: 輸出埠號並不是數值.

source: %s: Wrong number of input arguments. Must be between %d and %d.
de_de: %s: falsche Anzahl an Eingangsargumenten. Muß zwischen %d und %d liegen.
zh_tw: %s: 輸入參數的個數錯誤: 必須是介於 %d 和 %d 之間.

source: %s: Wrong number of input arguments: %d expected.
de_de: %s: falsche Anzahl für Eingangsargumente: %d erwartet.

source: %s: Wrong number of output arguments: %d expected.
de_de: %s: falsche Anzahl von Eingangsargumenten: %d erwartet.

source: %s: Wrong size for input argument #%d: Single integer expected.
de_de: %s: falsche Größe für Eingangsargument #%d: einzelner Integer erwartet.

source: %s: Wrong size for input argument #%d: Single string expected.
de_de: %s: falsche Größe für Eingangsargument #%d: einzelne Zeichenkette erwartet.

source: %s: Wrong size for input arguments #%d and #%d.
de_de: %s: falsche Größe für Eingangsargument #%d und #%d.
zh_tw: %s: 第 %d 和 %d 的輸入參數尺寸不對.

source: %s: Wrong type for input argument #%d: Integer expected.
de_de: %s: falscher Typ für Eingangsargument #%d: Integer erwartet.

source: %s: Wrong type for input argument #%d: String expected.
de_de: %s: falscher Typ für Eingangsargument #%d: Variable erwartet.

source: &Edit
de_de: &Editieren
zh_tw: 編輯(&E)

source: &File
de_de: &Datei

source: &Tools
de_de: &Zusatzprogramme
zh_tw: 工具(&T)

source: ''scicos'' is no more available, please use ''xcos'' instead.
de_de: 'scicos' ist nicht mehr verfügbar, bitte verwenden Sie 'xcos' anstattdessen.

source: A compatible C compiler required.
de_de: ein kompatibler C Kompiler benötigt.

source: Only one block can be selected in current window for this operation.
de_de: Nur ein Block kann im aktuellen Fenster für diese Operation ausgewählt werden.
zh_tw: 針對目前視窗中的操作步驟只能選擇一個方塊.

source: Problem while building library %s
de_de: Problem beim Erzeugen der Bibliothek %s
zh_tw: 在編譯 %s 函式庫時發生問題

source: Sorry compiling problem
de_de: Entschuldigung, Kompiler Problem.

source: The current icon depends on block parameter
de_de: Das aktuelle Symbol hängt vom Block-Parameter ab
zh_tw: 目前的圖示取決於方塊參數中.
