Repository: ScilabOrg/scilab
Catalog: scilab/modules/differential_equations/locales/*/differential_equations.po
Languages: pl_pl

source: %s: %s: Wrong number of input argument(s): %d to %d expected.
pl_pl: %s: %s: Zła liczba parametrów(-u) wejściowych: oczekiwano od %d do %d.

source: %s: Invalid option %s: real matrix expected.
pl_pl: %s: Nieprawidłowa opcja %s: oczekiwana macierz typu real.

source: %s: Wrong number of input argument(s): %d or %d expected.
pl_pl: %s: Zła liczba parametrów(-u) wejściowych: oczekiwano %d lub %d.

source: %s: Wrong number of input argument(s): %d to %d expected.
pl_pl: %s: Zła liczba parametrów(-u) wejściowych: oczekiwano od %d do %d.

source: %s: Wrong number of input argument(s): At least %d expected.
pl_pl: %s: Zła liczba parametrów(-u) wejściowych(-ego): Oczekiwano przynajmniej %d.

source: %s: Wrong number of output argument(s): %d or %d expected.
pl_pl: %s: Zła liczba parametrów(-u) wyjściowych: oczekiwano %d lub %d.

source: %s: Wrong size for input argument #%d: A real expected.
pl_pl: %s: Nieprawidłowy rozmiar parametru wejściowego #%d: Oczekiwano wartości rzeczywistej.

source: %s: Wrong type for input argument #%d: A real expected.
pl_pl: %s: Nieprawidłowy typ parametru wejściowego #%d: Oczekiwano wartości rzeczywistej.

source: %s: Wrong value for input argument #%d: syntax error in given expression
pl_pl: %s: Nieprawidłowa wartość parametru wejściowego #%d: błąd w składni wyrazu.

source: 0 : functional iterations (no jacobian used (''adams'' or ''stiff'' only))
pl_pl: 0 : powtórzenia funkcjonalne (bez użycia jakobianu ("adams'' lub ''sztywny'' tylko))

source: 1 : normal computation at specified times
pl_pl: 1 : normalne obliczenia w określonym czasie

source: 1 : user-supplied full jacobian
pl_pl: 1: przez użytkownika pełnego jakobianu

source: 2 : computation at mesh points (given in first row of output of ode)
pl_pl: 2 : obliczenia w punktach siatki (podane w pierwszym wierszu wyjścia ode)

source: 2 : internally generated full jacobian
pl_pl: 2 : wewnętrzne utworzenie pełnego jakobianu

source: 3 : internally generated diagonal jacobian (''adams'' or ''stiff'' only)
pl_pl: 3: wewnętrzne utworzenie pełnego jakobianu ("adams" lub "sztywny" tylko)

source: 3 : one step at one internal mesh point and return
pl_pl: 3 : krok po kroku co jeden wewnętrzny punkt siatki i powrót

source: 4 : normal computation without overshooting tcrit
pl_pl: 4: w normie obliczń bez przekroczenia punktu krytycznego

source: 4 : user-supplied banded jacobian (see ml,mu)
pl_pl: 4 : zablokowany przez użytkownika w przedziałach jakobianu (see ml, mu)

source: 5 : internally generated banded jacobian (see ml,mu)
pl_pl: 5 : wewnętrzne wytworzenie blokady jakobiana (see ml,mu)

source: 5 : one step, without passing tcrit, and return
pl_pl: jeden punkt bez przechodzenia punktu krytycznego i powrót

source: Blackhole
pl_pl: czarna dziura

source: Default values are given in square brackets
pl_pl: Wartości domyślne są podane w nawiasach kwadratowych

source: Defining %ODEOPTIONS variable
pl_pl: Definiowanie zmiennej %ODEOPTIONS

source: Differential equations code generated by Maple
pl_pl: Kod równań różniczkowych generowany przez Maple

source: If jactype = 4 or 5 ml and mu are the lower and upper half-bandwidths
pl_pl: Jeżeli jactype = 4 lub 5 ml i mu są wyżej i niżej w połowie szerokości pasma

source: If jactype = 4 the jacobian function must return
pl_pl: Jeśli jactype = 4 funkcja jakobianu musi wrócić

source: If the function is called without argument, default values are used
pl_pl: Jeśli funkcja jest wywołana bez wartości, zostaną użyte wartości domyślne

source: Lokta-Volterra vector field
pl_pl: Pole wektora Lokta-Volterra

source: Lorentz differential equation
pl_pl: równanie różniczkowe Lorentza

source: Lorenz differential equation
pl_pl: równanie różniczkowe Lorentza

source: Meaning of itask and tcrit:
pl_pl: Rozumienie itask i tcrit:

source: Meaning of jactype:
pl_pl: Rozumienie jactype:

source: Meaning of ml,mu:
pl_pl: Rozumienie z ml,mu:

source: ODE 1D vector field
pl_pl: pole wektora ODE 1D

source: Simulation
pl_pl: Symulacja

source: Simulation of mechanical system with holonomic constraints
pl_pl: symulacja mechaniczna systemu z ograniczeniami systemu holonomic

source: Sphere
pl_pl: Sfera

source: Van der Pol vector field
pl_pl: pole wektora Van der Pol

source: a matrix J which is ml+mu+1 x ny (where ny=dim of y in ydot=f(t,y))
pl_pl: macierz J którą jest ml+mu+1 x ny (gdzie ny=dim of y in ydot=f(t,y))

source: bike simulation, stable trajectory
pl_pl: Symulacja roweru, trajektorja stabilna

source: bike simulation, unstable trajectory
pl_pl: Symulacja roweru, trajektorja niestabilna

source: chemical process (implicit)
pl_pl: procesy chemiczne (pośrednio)

source: column 2 is made of mu-1 zeros followed by df1/dx2, df2/dx2,etc
pl_pl: kolumna 2 jest zbudowana z mu-1 zer po df1/dx2, df2/dx2,itp

source: df1/dy1, df2/dy1, df3/dy1,... (1+ml possibly non-zero entries)
pl_pl: df1/dy1, df2/dy1, df3/dy1,... (1+ml ewentualnie wpisy od zera)

source: of the banded jacobian: the band is the i,j''s with i-ml <= j <= ny-1
pl_pl: Jakobian zespołu: zespołem jest i, j z i-ml <= j <= ny-1

source: spherical pendulum simulation
pl_pl: sferyczne symulacje wahadła

source: such that column 1 of J is made of mu zeros followed by
pl_pl: takie że kolumna 1 z J zrobiona jest z mu po zerach
