Repository: ScilabOrg/scilab
Catalog: scilab/modules/dynamic_link/locales/*/dynamic_link.po
Languages: fr_fr, pl_pl

source: %s: Command: %s
fr_fr: %s: Commande: %s
pl_pl: %s: Komenda: %s

source: %s: Copy %s to TMPDIR
fr_fr: %s : Copie %s vers TMPDIR
pl_pl: %s: Kopiuj %s do TMPDIR

source: %s: Copy compilation files (Makefile*, libtool...) to TMPDIR
fr_fr: %s : Copie les fichiers de compilation (Makefile*, libtool...) vers TMPDIR
pl_pl: %s: Kopiuj pliki kompilacyjne (Makefile*, libtool...) do TMPDIR

source: %s: Did not copy %s: Source and target directories are the same (%s).
fr_fr: %s: Ne copie pas %s: Les répertoires source et cible sont identiques (%s).
pl_pl: %s: Nie skopiowano %s: Katalog docelowy i źródłowy są takie same (%s).

source: %s: File %s ignored.
fr_fr: %s : Fichier %s ignoré.
pl_pl: %s: Plik %s zignorowany.

source: %s: Modification of the Makefile in TMPDIR.
fr_fr: %s : Modification du Makefile dans TMPDIR.
pl_pl: %s: Modyfikacja pliku Makefile w TMPDIR.

source: %s: Need to run the compiler detection (configure).
fr_fr: %s: Nécessite l'exécution de la détection du compilateur (configure).
pl_pl: %s: Trzeba uruchomić detekcję kompilatora (konfiguracja).

source: %s: Substitute the reference by the actual file.
fr_fr: %s: Substitue la référence par le fichier actuel.
pl_pl: %s: Zastąp odniesienie przez rzeczywisty plik.

source: %s: Use the previous detection of compiler.
fr_fr: %s: Utilise la précédente détection du compilateur.
pl_pl: %s: Użyj poprzedniego wykrycia kompilatora.

source: %s: configure : Generate Makefile.
fr_fr: %s : configure : Génère le Makefile.
pl_pl: %s: konfiguracja : Generowanie Makefile.

source: Building shared library (be patient)
fr_fr: Construit une bibliothèque partagée (soyez patient)
pl_pl: Budowanie dzielonej biblioteki (zachowaj cierpliwość)

source: Command: %s
fr_fr: Commande: %s
pl_pl: Polecenie: %s

source: Compilation of
fr_fr: Compilation de
pl_pl: Kompilacja

source: Generate a Makefile
fr_fr: Génère un Makefile
pl_pl: Wygeneruj Makefile

source: Generate a Makefile: %s
fr_fr: Génère un Makefile: %s
pl_pl: Wygeneruj Makefile: %s

source: Generate a cleaner file
fr_fr: Génère un fichier cleaner
pl_pl: Wygeneruj czystszy plik

source: Generate a gateway file
fr_fr: Génère un fichier gateway
pl_pl: Wygeneruj plik bramu

source: Generate a loader file
fr_fr: Génère un fichier loader
pl_pl: Wygeneruj plik ładujący

source: Output: %s
fr_fr: Sortie: %s
pl_pl: Wyjście: %s

source: Running the Makefile
fr_fr: Exécute le Makefile
pl_pl: Uruchamianie Makefile

source: Running the makefile
fr_fr: Exécute le makefile
pl_pl: Uruchamianie makefile

source: %s : Wrong type for input argument #%d: %s
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : %s
pl_pl: %s : Zły typ parametru wejściowego #%d: %s

source: %s : Wrong value for argument #%d: %s
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : %s
pl_pl: %s : Zła wartość parametru #%d: %s

source: %s : second argument must be a unique id of a shared library.
fr_fr: %s : le second argument doit être un id unique d'une bibliothèque partagée.
pl_pl: %s : drugi parametr musi być unikalnym id dzielonej biblioteki.

source: %s Wrong value for input argument #%d: '%s' or '%s' expected.
fr_fr: %s Mauvaise valeur pour l'argument d'entrée n°%d : '%s' ou '%s' attendu.
pl_pl: %s Zła wartość parametru wejściowego #%d: Oczekiwano '%s' lub '%s'.

source: %s is not an entry point.
fr_fr: %s n'est pas un point d'entrée.
pl_pl: %s nie jest punktem wejściowym.

source: %s: A Fortran or C compiler is required.
fr_fr: %s : Un compilateur fortran ou C est requis.
pl_pl: %s: Kompilator C lub Fortran'a nie jest wymagany.

source: %s: Already loaded from library %s
fr_fr: %s : Déjà chargé à partir de la bibliothèque %s
pl_pl: %s: Już załadowano z biblioteki %s

source: %s: An error occurred during the compilation:
fr_fr: %s: Une erreur a été detectée lors de la compilation
pl_pl: %s: Wystąpił błąd podczas kompilacji:

source: %s: An error occurred during the detection of the compiler(s). Set ilib_verbose(2) for more information.
fr_fr: %s: Une erreur s'est produite durant la détection du compilateur. Mettre ilib_verbose(2) pour plus d'informations.

source: %s: An error occurred: %s
fr_fr: %s : Une erreur s'est produite : %s
pl_pl: %s: Wystąpił błąd: %s

source: %s: Build command: %s
fr_fr: %s: Commande de compilation: %s
pl_pl: %s: Polecenie Build: %s

source: %s: Cannot open file %s.
fr_fr: %s : Ne peut pas ouvrir le fichier %s.
pl_pl: %s: Nie można otworzyć pliku %s.

source: %s: Cannot open shared files. Max entry %d reached.
fr_fr: %s : Ne peut pas ouvrir les fichiers partagés. Nombre maximum d'entrée %d atteint.
pl_pl: %s: Niemożna otworzyć wspólnych plików. Osiągnięto maksymalna liczbę %d wejść.

source: %s: Error while executing %s.
fr_fr: %s: Erreur lors de l'exécution %s.

source: %s: Error while modifying the reference Makefile:
fr_fr: %s: Erreur lors de la modification du Makefile reference:
pl_pl: %s: Błąd podczas modyfikowania odwołania Makefile:

source: %s: Feature not available under Microsoft Windows.
fr_fr: %s : Fonction non disponible sous Microsoft Windows.
pl_pl: %s: Funkcja nie jest dostępna w systemie Microsoft Windows.

source: %s: Shared lib %s does not exist.
fr_fr: %s : Bibliothèque partagée %s n'existe pas.
pl_pl: %s: Wspólna biblioteka %s nie istnieje.

source: %s: The command was:
fr_fr: %s : La commande était :
pl_pl: %s: Tym poleceniem było:

source: %s: The file %s does not exist.
fr_fr: %s : Le fichier %s n'existe pas.
pl_pl: %s: Plik %s nie istnieje.

source: %s: The shared archive was not loaded: %s
fr_fr: %s : La bibliothèque partagée n'a pas été chargée: %s
pl_pl: %s: Wspólne archiwum nie zostało załadowane : %s

source: %s: This feature has been implemented for Windows.
fr_fr: %s : Cette fonction a été implémentée pour Windows.
pl_pl: %s: Ta funkcja została zrealizowana dla systemu Windows.

source: %s: This feature required Microsoft visual studio C compiler.
fr_fr: %s : Cette fonction requiert le compilateur C Microsoft visual studio.
pl_pl: %s: Ta funkcja wymaga kompilatora Microsoft visual studio C.

source: %s: Warning: No error code returned by the compilation but the error output is not empty:
fr_fr: %s : Attention : Pas de code d'erreur retourné par la compilation, mais il y a des erreurs en sortie :
pl_pl: %s: Ostrzeżenie: Nie zwrócono kodu błędu przez kompilator ale wyjście błędu nie jest puste:

source: %s: Warning: Scilab has not been able to find where the Scilab sources are. Please submit a bug report on http://bugzilla.scilab.org/
fr_fr: %s: Attention: Scilab n'a pas été capble de trouver où sont les sources de Scilab. Soumettez un rapport de bug à l'adresse http://bugzilla.scilab.org/
pl_pl: %s: Ostrzeżenie: Program Scilab nie był w stanie odnaleźć gdzie znajdują się źródła programu Scilab. Proszę zgłosić raport błędu na stronie http://bugzilla.scilab.org/

source: %s: Wrong number of input argument(s).
fr_fr: %s : Mauvais nombre d'argument(s) d'entrée.
pl_pl: %s: Zły liczba parametru(-ów) wejściowego(-ych).

source: %s: Wrong number of input argument(s): %d,%d or %d expected.
fr_fr: %s: Mauvais nombre d'argument(s) d'entrée: %d,%d ou %d attendu.
pl_pl: %s: Zła liczba parametru(-ów) wejściowego(-ych): Oczekiwano %d,%d lub %d.

source: %s: Wrong number of input argument(s): at least %d expected.
fr_fr: %s: Mauvais nombre d'arguments d'entré(s): au moins %d d'attendu(s).

source: %s: Wrong number of input arguments: %d expected.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : %d attendu.

source: %s: Wrong size for input argument #%d.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d.

source: %s: Wrong size for input argument #%d: %d expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : %d attendu.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano %d.

source: %s: Wrong size for input argument #%d: A matrix of strings < 999 expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Une matrice de chaînes de caractères < 999 attendue.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano macierzy ciągów znaków < 999.

source: %s: Wrong size for input argument #%d: A scalar expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Un scalaire attendu.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano skalara.

source: %s: Wrong size for input argument #%d: A string expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Une chaîne de caractères attendue.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano ciągu znaków.

source: %s: Wrong size for input argument #%d: String vector < %d expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Un vecteur de chaînes de caractères < %d attendu.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano wektora ciągu znaków < %d.

source: %s: Wrong size for input argument #%d: String vector expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Vecteur de chaîne de caractères attendu.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano wektora ciągu znaków.

source: %s: Wrong type for input argument #%d: A int expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Un int attendu.
pl_pl: %s: Zły typ parametru wejściowego #%d: Oczekiwano wartości całkowitej.

source: %s: Wrong type for input argument #%d: A matrix of strings expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Une matrice de chaînes de caractères attendue.
pl_pl: %s: Zły typ parametru wejściowego #%d: Oczekiwano macierzy ciągów znaków.

source: %s: Wrong type for input argument #%d: A string expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Une chaîne de caractères est attendue.
pl_pl: %s: Zły typ parametru wejściowego #%d: Oczekiwano ciągu znaków.

source: %s: Wrong type for input argument #%d: Integer expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Entier attendu.
pl_pl: %s: Zły typ parametru wejściowego #%d: Oczekiwano wartości całkowitej .

source: %s: Wrong type for input argument #%d: String matrix expected.
fr_fr: %s : Type inapproprié pour l'argument d'entrée #%d : Matrice de chaînes de caractères attendue.

source: %s: Wrong type for input argument. Strings expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée. Chaînes de caractères attendues.
pl_pl: %s: Zły typ parametru wejściowego. Oczekiwano ciągów znaków.

source: %s: Wrong type for input argument. Strings vector expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée. Vecteur de chaîne de caractères attendu.
pl_pl: %s: Zły typ parametru wejściowego. Oczekiwano wektora ciągów znaków.

source: %s: Wrong type for input arguments: Strings expected.
fr_fr: %s : Mauvais type pour les arguments d'entrée : Chaîne de caractères attendue.
pl_pl: %s: Zły typ parametrów wejściowych: Oczekiwano ciągów znaków.

source: %s: Wrong value for input argument #%d: '''' or ''[]'' expected.
fr_fr: %s: Valeur inappropriée pour l'argument d'entrée #%d: '''' or ''[]'' attendu.

source: %s: Wrong value for input argument #%d: A int expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Un int attendu.
pl_pl: %s: Zła wartość parametru wejściowego #%d: Oczekiwano wartości całkowitej.

source: %s: Wrong value for input argument #%d: Must be in the set {%s}.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Doit être dans l'ensemble {%s}.
pl_pl: %s: Zła wartość parametru wejściowego #%d: Musi być w ustawieniu {%s}.

source: %s: problem with one of the entry point.
fr_fr: %s : problème avec un des points d'entrée.
pl_pl: %s: problem z jednym z punktów wejściowych.

source: A Fortran or C compiler is required.
fr_fr: Un compilateur Fortran ou C est nécessaire.
pl_pl: Wymagany jest kompilator jezyka C lub Frotran.

source: An error occurred: %s
fr_fr: Une erreur est survenue : %s
pl_pl: Wystąpił błąd: %s

source: Cannot open shared files max entry %d reached.
fr_fr: Ne peut pas ouvrir les fichiers partagés maximum d'entrées %d atteint.
pl_pl: Niemożna otworzyć wspólnych plików, osiągnięto maksymalną liczbę %d wejść.

source: Dynamic link
fr_fr: Lien dynamique
pl_pl: Dynamiczny link

source: Entry name %s.
fr_fr: Nom de l'entrée %s.
pl_pl: Nazwa wejściowa %s.

source: Entry point %s in shared library %d.
fr_fr: Point d'entrée %s dans la bibliothèque dynamique %d.
pl_pl: Punkt wejściowy %s we wspólnej bibliotece %d.

source: Error: Not a valid internal routine number %d.
fr_fr: Erreur: %d n'est pas un numéro de routine interne valide.
pl_pl: Błąd: Niewłaściwa rutynowa wewnętrzna liczba %d.

source: F2C cannot build fortran 90
fr_fr: F2C ne peut pas compiler de fortran 90
pl_pl: F2C niemoże zbudować fortran 90

source: Interface %s not linked.
fr_fr: Interface %s non liée.
pl_pl: Interfejs %s nie podłączony.

source: Link done.
fr_fr: Edition de liens effectuée.
pl_pl: Połączenie wykonane.

source: Link failed for dynamic library '%s'.
fr_fr: Echec de l'édition de liens pour la bibliothèque partagée '%s'.
pl_pl: Połączenie nieudane dla dynamicznej biblioteki '%s'.

source: Linking %s.
fr_fr: Edition de liens %s.
pl_pl: Łączenie %s.

source: Number of entry points %d. Shared libraries :
fr_fr: Nombre de points d'entrée %d. Bibliothèques partagées :
pl_pl: Liczba punktów wejściowych: %d. Wspólne biblioteki :

source: Output: %s
fr_fr: Sortie: %s
pl_pl: Wyjście: %s

source: Shared archive loaded.
fr_fr: Bibliothèque partagée chargée.
pl_pl: Załadowano wspólne archiwum.

source: Unique dynamic library name expected.
fr_fr: Un nom unique de bibliothèque partagée attendu.
pl_pl: Oczekiwano unikalnej nazwy dynamicznej biblioteki

source: Unique id of a shared library expected.
fr_fr: Id unique d'une bibliothèque partagée attendu.
pl_pl: Oczekiwano unikalnego identyfikatora wspólnej biblioteki.

source: ] : %d libraries.
fr_fr: ] : %d bibliothèques.
pl_pl: ] : %d biblioteki.

source: ] : %d library.
fr_fr: ] : %d bibliothèque.
pl_pl: ] : %d biblioteka.

source: %s: Wrong type for input argument #%d: String array expected.
pl_pl: %s: Zły typ parametru wejściowego #%d: Oczekiwano tablicy ciągów znaków.

source: %s: Wrong type for input argument #%d: String expected.
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano ciągu znaków.
