Repository: ScilabOrg/scilab
Catalog: scilab/modules/fftw/locales/*/fftw.po
Languages: ja_jp, pl_pl, ru_ru

source: FFTW Library %s not found.
ja_jp: FFTW ライブラリ %s が見つかりません。
pl_pl: Biblioteki FFTW %s nie odnaleziono.
ru_ru: Библиотека FFTW %s не найдена.

source: FFTW Library not found.
ja_jp: FFTW ライブラリ が見つかりません。
pl_pl: Biblioteki FFTW nie odnaleziono.
ru_ru: Библиотека FFTW не найдена.

source: %s: Wrong number of input arguments: %d not expected.
ja_jp: %s: 入力引数で不正な番号: %d でないと想定します。
pl_pl: %s: Niewłaściwa liczba argumentów wejściowych:%d nie oczekiwana.
ru_ru: %s: Неверное количество входных аргументов: Ожидалось %d.

source: %s: Wrong type for input argument #%d: A Real or Complex expected.
ja_jp: %s: 入力引数 #%d で不正な型: 実数、または複素数を想定します。
pl_pl: %s: Zły typ argumentu wejściowego #%d: Oczekiwany typ rzeczywisty lub zespolony.
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидалось вещественное или комплексное число.

source: %s: Wrong values for input argument #%d.
ja_jp: %s: 入力引数 #%d で不正な値です。
pl_pl: %s: Nieprawidłowa wartość dla argumentu wejściowego #%d.
ru_ru: %s: Неверные значения входного аргумента #%d.

source: %s: Wrong type for input argument #%d: N-dimensionnal array expected.
ja_jp: %s: 入力引数 #%d で不正な型: n次元配列 を想定します。
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидался N-размерный массив.

source: %s: Wrong size for input argument #%d.
ja_jp: %s: 入力引数 #%d で不正なサイズです。
pl_pl: %s: Niewłaściwy rozmiar argumentu wejściowy #% d.
ru_ru: %s: Неверный размер входного аргумента #%d.

source: %s: Wrong type for input argument #%d: int matrix expected.
ja_jp: %s: 入力引数 #%d で不正な型: 整数行列を想定します。
pl_pl: %s: Zły typ argumentu wejściowego #%d: Oczekiwana macierz typu int.
ru_ru: %s: Неверный тип входного аргумента №%d: Ожидалась целочисленная матрица.

source: %s: Incompatible input arguments '#%d and '#%d': Same sizes expected.
ja_jp: %s: 入力引数 '#%d と '#%d' とで互換性がありません: 同じサイズを想定します。
pl_pl: %s: Niezgodny argumenty wejściowe '#%d oraz '#%d': Oczekiwany ten sam rozmiar.
ru_ru: %s: Несовместимые входные аргументы '#%d и '#%d': Они должны иметь одинаковый размер.

source: %s: No more memory.
ja_jp: %s: これ以上メモリがありません。
pl_pl: %s: Brak pamieci.
ru_ru: %s: Не осталось доступной памяти.

source: %s: Wrong values for input argument #%d: Non-negative integers expected.
ja_jp: %s: 入力引数 #%d で不正な値: 負でない整数を想定します。
pl_pl: %s: Nieprawidłowe wartości argumentu wejściowego #%d: Oczekiwana nieujemna wartość integer.
ru_ru: %s: Неверные значения входного аргумента #%d: Ожидались неотрицательные целые числа.

source: %s: Wrong values for input argument #%d: FFTW flag expected.
ja_jp: %s: 入力引数 #%d で不正な値: FFTWフラグを想定します。
pl_pl: %s: Błędne wartości argumentu wejściowegot #%d: Oczekiwano flagi FFTW.
ru_ru: %s: Неверные значения входного аргумента #%d: Ожидался флаг FFTW.

source: %s: Wrong type for input argument #%d.
ja_jp: %s: 入力引数 #%d で不正な型です。
pl_pl: %s: Nieprawidłowy typ dla argumentu wejściowego #%d.
ru_ru: %s: Неверный тип входного аргумента #%d.

source: %s: Wrong type for input argument #%d: A string expected.
ja_jp: %s: 入力引数 #%d で不正な型: 文字列を想定します。
pl_pl: %s: Nieprawidłowy typ dla argumentu wejściowego #%d: Oczekiwany łańcuch znaków.
ru_ru: %s: Неверный тип входного аргумента #%d: Ожидалась строка.

source: %s: An error occurred: %s
ja_jp: %s: エラーが起こりました: %s.
pl_pl: %s: Wystąpił błąd: %s
ru_ru: %s: Произошла ошибка: %s

source: FFTW can't read wisdom.
ja_jp: FFTW wisdom を読めません。
pl_pl: Biblioteka FFTW nie może odczytać struktury.
ru_ru: FFTW не может прочитать файл оптимизации (см. fftw-wisdom).

source: Scilab FFTW module not installed.
ja_jp: Scilab FFTW モジュールはインストールされていません。
pl_pl: Nie zainstalowano w Scilab modułu FFTW.
ru_ru: Модуль Scilab FFTW не установлен.

source: %s: Wrong type for input argument #%d: N-dimensional array expected.
pl_pl: %s: Zły typ argumentu wejściowego #%d: Oczekiwany wektor N-wymiarowy.
