Repository: ScilabOrg/scilab
Catalog: scilab/modules/pvm/locales/*.po
Languages: es_es, pl_pl, pt_br

source: %s: An error occurred: %s
es_es: %s: A ocurrido un error: %s
pl_pl: %s: Wystąpił błąd: %s
pt_br: %s: Ocorreu um erro: %s

source: %s: Error while creating processes: %s.
es_es: %s: Error mientras se creaban los procesos: %s.
pl_pl: %s: Błąd podczas tworzenia procesów: %s.
pt_br: %s: Erro ao se criar processos: %s.

source: %s: No more memory.
es_es: %s: No hay mas memoria.
pl_pl: %s: Brak pamięci.
pt_br: %s: Memória esgotada.

source: %s: No such file or directory.
es_es: %s: No hay tal archivo o directorio.
pl_pl: %s: Nie ma takiego pliku lub katalogu.
pt_br: %s: Não há tal arquivo ou diretório.

source: %s: Unknown or not yet implemented type.
es_es: %s: Tipo desconocido o no implementado.
pl_pl: %s: Nieznany lub jeszcze nie zaimplementowany typ.
pt_br: %s: Tipo desconhecido ou ainda não implementado.

source: %s: Wrong first input argument: '%s' or '%s' expected.
es_es: %s: Primer argumento de entrada incorrecto: Se esperaba '%s' o '%s'.
pl_pl: %s: Nieprawidłowy pierwszy argument wejściowy: oczekiwany jest '%s' lub '%s'.
pt_br: %s: Primeiro argumento de entrada errado: Esperava-se '%s' ou '%s'.

source: %s: workspace (stacksize) is too small.
es_es: %s: espacio de trabajo (stacksize) demasiado pequeño.
pl_pl: %s: przestrzeń robocza (rozmiar stosu) zbyt mała.
pt_br: %s: espaço de trabalho (tamanho da pilha - stacksize) muito pequeno.

source: (group,instance) already exists
es_es: (grupo, instancia) ya existe
pl_pl: (Grupa, przykład) już istnieje
pt_br: (grupo, instância) já existe

source: Already doing operation
es_es: Ya está haciendo la operación
pl_pl: Operacja jest już wykonywana.
pt_br: Já está fazendo a operação

source: Already in group
es_es: Ya está en el grupo
pl_pl: Już w grupie
pt_br: Já está no grupo

source: Bad message id
es_es: Identificación de mensaje incorrecta
pl_pl: Złe id wiadomości
pt_br: ID de mensagem ruim

source: Bad parameter
es_es: Parámetro erróneo
pl_pl: Błędny parametr
pt_br: Parâmetro ruim

source: Barrier count mismatch
es_es: Inconsistencia en el contador de Barrera
pl_pl: Niedopasowana liczba barier
pt_br: Não correspondência da contagem de barreira

source: Can not decode received msg
es_es: No se puede decodificar el mensaje recibido
pl_pl: Nie można rozkodować otrzymanej wiadomości
pt_br: Não se consegue a mensagem recebida

source: Can not get memory
es_es: No se puede obtener memoria
pl_pl: Nie można pobrać pamięci
pt_br: Não se consegue obter memória

source: Daemon pvmd is not responding
es_es: El demonio pvmd no está respondiendo
pl_pl: Daemon pvmd nie odpowiada
pt_br: Daemon pvmd não está respondendo

source: Error MALLOC in pvm_error
es_es: Error MALLOC (asignación de memoria) en pvm_error
pl_pl: Błąd MALLOC w pvm_błąd
pt_br: Erro de MALLOC em pvm_error

source: Error pvm_halt - signal
pl_pl: Błąd pvm_zablokowanie - sygnału
pt_br: Erro em pvm_halt - sinal

source: Error pvm_reduce: Not scalar type
es_es: Error pvm_reduce: No es de tipo escalar
pl_pl: Błąd pvm_redfuce: nie jest typu skalarnego.
pt_br: Erro em pvm_reduce: Não é um escalar

source: Error pvm_reduce: Unknown reduction operation %s
es_es: Error pvm_reduce: operación de reducción %s desconocida
pl_pl: Błąd pvm_reduce: nieznana operacja redukcji %s
pt_br: Erro em pvm_reduce: operação de redução desconhecida: %s

source: Failed to exec new slave pvmd
es_es: Falló la ejecución del nuevo esclavo pvmd
pl_pl: Nie można wykonać nowego slave PVMD
pt_br: Falhou ao executar um novo pvmd escravo

source: Function not implemented
es_es: Función no implementada
pl_pl: Funkcja nie zostanie wykonana
pt_br: Função não implementada

source: Host already configured (Duplicate host)
es_es: Ya se configuró el host (Host duplicado)
pl_pl: Host już skonfigurowany (duplikat hosta)
pt_br: Host já configurado (host duplicado)

source: Host failed
es_es: Falló host
pl_pl: błąd użytkownika
pt_br: O host falhou

source: No current buffer
es_es: No hay buffer actual
pl_pl: Brak bieżącego bufora
pt_br: Não há buffer corrente

source: No group with that name
es_es: No hay grupo con ese nombre
pl_pl: Brak grupy z tą nazwą
pt_br: Não há grupo com tal nome

source: No parent task
es_es: No hay tarea padre
pl_pl: Brak zadania rodziców
pt_br: Sem tarefas pai

source: No such (group,instance)
es_es: No hay tal (grupo, instancia)
pl_pl: Nie ma takiego (grupy, przypadku)
pt_br: Não há tal (grupo, instância)

source: No such executable
es_es: No hay tal ejecutable
pl_pl: Nie ma takiego wykonywalnego pliku
pt_br: Não há tal executável

source: No such host
es_es: No hay tal host
pl_pl: Nie ma takiego hosta
pt_br: Não há tal host

source: No such instance in group
es_es: No hay tal instancia en el grupo
pl_pl: Nie ma takiego przypadku w grupie
pt_br: Não há tal exemplo no grupo

source: No such task
es_es: No hay tal tarea
pl_pl: Nie ma takiego zadania
pt_br: Não há tal tarefa

source: Not in group
es_es: No está en el grupo
pl_pl: Nie w grupie
pt_br: Não está no grupo

source: Null group name is illegal
es_es: El nombre del grupo Null es ilegal
pl_pl: Nazwa grupy: null jest nie dozwolona
pt_br: Nome do grupo nulo é ilegal

source: Out of resources
es_es: Recursos agotados
pl_pl: Brak zasobów
pt_br: Sem recursos

source: PVM exists
es_es: Existe PVM
pl_pl: PVM istnieje
pt_br: O PVM existe

source: PVM not found
es_es: No se encontró PVM
pl_pl: Nie odnaleziono PVM
pt_br: PVM não encontrado

source: PVM parallel Toolbox
pl_pl: PVM równoległe Toolbox
pt_br: Computações Paralelas com PVM

source: Pvmd system error
es_es: Error del sistema pvmd
pl_pl: Pvmd błąd systemu
pt_br: Erro de sistema Pvmd

source: Pvmd-pvmd protocol mismatch
es_es: Inconsistencia de protocolo pvmd-pvmd
pl_pl: Pvmd-pvmd niedopasowany protokół
pt_br: O protocolo Pvmd-pvmd protocol não corresponde.

source: Read past end of buffer
es_es: Leer último final del buffer
pl_pl: Czytanie po zakończeniu bufora
pt_br: Leu além do fim do buffer

source: Scilab PVM module not installed.
es_es: El módulo PVM de Scilab no está instalado.
pl_pl: Moduł PVM nie zainstalowany.
pt_br: O módulo Scilab PVM não está instalado.

source: The configuration file %s is used.
es_es: Se usa el archivo de configuración %s.
pl_pl: Plik konfiguracyjny %s jest używany.
pt_br: O arquivo de configuração %s é usado.

source: The standard configuration file $SCI%s will be used. With SCI=%s SCI will have to be set on remote hosts in order to spawn scilab
es_es: Se usará el archivo de configuración estándar $SCI%s. Con SCI=%s SCI deberá ser configurado en los hosts remotos para poder iniciar Scilab
pl_pl: Standardowa konfiguracja pliku $SCI%s zostanie użyta. Z SCI=%s SCI będzie musiała być ustawiona na zdalnym użytkowniku w poleceniu spawn scilab
pt_br: O arquivo de configuração padrão $SCI%s será usado. Com SCI=%s SCI terá que ser ajustado em hosts remotos Para se gerar o Scilab

source: The standard configuration file $SCI%s%s needs the environment variables %s, %s, %s to be set. PVM can not be started.
es_es: El archivo de configuración estándar $SCI%s%s necesita que las variables de entorno %s, %s, %s sean configuradas. No se puede iniciar PVM.
pl_pl: Standardowa konfiguracja pliku $SCI%s%s potrzebne środowisko zmiennych%s,%s,%s do rozwiązania. PVM nie można uruchomić.
pt_br: O arquivo de configuração padrão $SCI%s%s necessita das variáveis de ambiente %s, %s, %s para ser ajustado. PVM não pode ser iniciado.

source: Unknown Error
es_es: Error desconocido
pl_pl: Nieznany błąd
pt_br: Erro desconhecido

source: Warning: PVM_ROOT is not set.
es_es: Advertencia: PVM_ROOT no fue asignado.
pl_pl: Uwaga: PVM_ROOT nie jest ustawiony.
pt_br: Aviso: PVM_ROOT não foi ajustado.

source: Warning: PVM_ROOT is set to %s
es_es: Advertencia: PVM_ROOT es %s
pl_pl: Uwaga: PVM_ROOT jest ustawiony do %s
pt_br: Aviso: PVM_ROOT está ajustado como %s

source: Warning: The standard configuration file $SCI%s was not found. We supposed that PVM and scilab are in standard place on your net (Cf. man pvmd3)
es_es: Advertencia: El archivo de configuración estándar $SCI%s no fue encontrado. Suponemos que PVM y scilab están en un lugar estándar de su red (Cf. man pvmd3)
pl_pl: Ostrzeżenie: Standardowy plik konfiguracyjny $SCI%s nie został odnaleziony. Możemy przypuszczać że PVM i scilab są w standardowym miejscu w twojej sieci. (Cf. man pvmd3)
pt_br: Aviso: O arquivo de configuração padrão $SCI%s não foi encontrado. Supõe-se que o PVM e o Scilab estejam em lugares padrões em sua rede (Cf. man pvmd3)

source: but there exists no configuration file:
es_es: pero no existe archivo de configuración:
pl_pl: ale nie istnieje plik konfiguracyjny:
pt_br: mas não existe arquivo de configuração:
