Repository: ScilabOrg/scilab
Catalog: scilab/modules/signal_processing/locales/*/signal_processing.po
Languages: fr_fr, ja_jp, pl_pl, pt_br, ru_ru

source: %s: Arguments #%d and #%d must have the same sizes.
ja_jp: %s: 引数 #%d と #%d は小さいサイズを持たなくてはなりません。
pl_pl: %s: Argumenty #%d i #%d muszą mieć takie same rozmiary.
pt_br: %s: Os argumentos #%d e #%d devem ter os mesmos tamanhos.

source: %s: Incompatible input arguments #%d and #%d: Argument #%d expected to be less than argument #%d.
fr_fr: %s: Les arguments d'entrée #%d et #%d sont incompatibles: L'argument #%d doit être plus petit que l'argument #%d.
ja_jp: %1$s: 入力引数 #%2$d と #%3$d で互換性がありません: 引数 #%5$d よりも小さい引数 #%4$d を想定します。
pl_pl: %s: Sprzeczne argumenty wejściowe #%d i #%d: Oczekiwany argument #%d powinien być niższy niż argument #%d.
pt_br: %s: Argumentos de entrada incompatíveis #%d e #%d: Esperava-se que o argumento #%d fosse menor que o argumento #%d.

source: %s: Incompatible input arguments #%d and #%d: Same degree expected.
fr_fr: %s: Les arguments d'entrée #%d et #%d sont incompatibles: Ils avoir le même degré.
ja_jp: %s: 入力引数 #%d と #%d で互換性がありません: 多少小さくなくてはなりません。
pl_pl: %s: Sprzeczne argumenty wejściowe #%d i #%d: Oczekiwany taki sam stopień.
pt_br: %s: Os argumentos #%d e #%d estão incompatíveis: esperava-se o mesmo grau.

source: %s: Incompatible input arguments #%d and #%d: Same numbers of elements expected.
fr_fr: %s: Les arguments d'entrée #%d et #%d sont incompatibles: Ils avoir le même nombre d'élements.
ja_jp: %s: 入力引数 #%d と #%d で互換性がありません: 小さい数、または要素を想定します。
pl_pl: %s: Niekompatybilny argument wejściowy #%d oraz #%d: Oczekiwana at sama liczba elementów.
pt_br: %s: Argumentos de entrada incompatíveis #%d e #%d: Esperava-se o mesmo número de elementos.

source: %s: Incompatible input arguments #%d and #%d: Same sizes expected.
fr_fr: %s: Les arguments d'entrée #%d et #%d sont incompatibles: Ils doivent avoir les même tailles.
ja_jp: %s: 入力引数 #%d と #%d に互換性がありません: 小さいサイズを想定します。
pl_pl: %s: Niezgodne argumenty wejściowe #%d oraz #%d: Oczekiwany taki sam rozmiar.
pt_br: %s: Argumentos de entrada incompatíveis #%d e #%d: esperava-se as mesmas dimensões.
ru_ru: %s: Несовместимые аргументы #%d и #%d: Они должны иметь одинаковые размеры.

source: %s: Input argument #%d must be real.
fr_fr: %s: L'argument d'entrée #%d doit être réel.
ja_jp: %s: 入力引数 #%d は実でなくてはなりません。
pl_pl: %s: Parametr wejściowy #%d musi być wartością rzeczywistą.
pt_br: %s: O argumento de entrada #%d deve ser real.

source: %s: Too abrupt change near end of frequency range.
fr_fr: %s: Changement trop brusque au voisinage de la fin de la bande de fréquence.
ja_jp: %s: 周波数範囲の終端近くで突然の変化です。
pl_pl: %s: Zbyt gwałtowna zmiana w pobliżu końca zakresu częstotliwości.
pt_br: %s: Mudança muito abrupta perto do final do intervalo de frequência.

source: %s: Wrong number of input argument(s): %d expected.
fr_fr: %s: Mauvais nombre d'argument(s) d'entrée: %d attendu(s).
ja_jp: %s: 入力引数の数が不正です: %d を想定します。
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano %d.
pt_br: %s: Quantidade errada de argumento(s) de entrada: esperava-se %d.
ru_ru: %s: Неверное количество аргументов: Ожидалось %d.

source: %s: Wrong number of input arguments: %d or %d expected.
fr_fr: %s: Mauvais nombre d'arguments d'entrée: Il doit valoir %d ou %d.
ja_jp: %s: 入力引数の数が不正です: %d または、%d を想定します。
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano %d lub %d.
pt_br: %s: Quantidade errada de argumentos de entrada: esperava-se %d ou %d.

source: %s: Wrong number of input arguments: %d to %d expected.
fr_fr: %s: Mauvais nombre d'arguments d'entrée: Il doit être compris entre %d et %d.
ja_jp: %1$s: 入力引数の数が不正です: %3$d への %2$d を想定します。
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano od %d do %d.
pt_br: %s: Quantidade errada de argumentos de entrada: Esperava-se de %d a %d.
ru_ru: %s: Неверное количество аргументов: Ожидалось от %d до %d.

source: %s: Wrong size for input argument #%d: A %d elements array expected.
fr_fr: %s: Mauvaise taille pour l'argument d'entrée #%d: Un tableau %d élements est attendu.
ja_jp: %s: 入力引数 #%d で不正なサイズ: %d 要素配列を想定します。
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego #%d: Oczekiwane elementy tablicy %d.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um array de %d elementos.

source: %s: Wrong size for input argument #%d: A polynomial expected.
fr_fr: %s: Mauvaise taille pour l'argument d'entrée #%d: Un polynôme est attendu.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 多項式を想定します。
pl_pl: %s: Nieprawidłowy rozmiar parametru wejściowego #%d: oczekiwano wielomiany.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: esperava-se um polinômio.

source: %s: Wrong size for input argument #%d: A scalar expected.
fr_fr: %s: Mauvaise taille pour l'argument d'entrée #%d: Un scalaire est attendu.
ja_jp: %s: 入力引数 #%d で不正なサイズ: スカラーを想定します。
pl_pl: %s: Nieprawidłowy rozmiar dla argumentu wejściowego #%d: Oczekiwany skalar.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: esperava-se um escalar.

source: %s: Wrong size for input argument #%d: A single input, single output system expected.
fr_fr: %s: Mauvaise taille pour l'argument d'entrée #%d: Un système mono-entrée, mono-sortie est attendu.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 単一入力、単一出力を想定します。
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: pojedyncze wejście, system oczekuje pojedynczego wyjścia.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um sistema de entrada única e saída única.

source: %s: Wrong size for input argument #%d: A tall matrix expected.
fr_fr: %s: Mauvaise taille pour l'argument d'entrée #%d: Le nombre de lignes doit être >= au nombre de colonnes.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 大きい行列を想定します。
pl_pl: %s: Zły rozmiar parametru wejściowego #%d: Oczekiwano wysokiej macierzy.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se uma matriz alta.

source: %s: Wrong type for input argument #%d: Linear dynamical system or row vector of floats expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée #%d: Un système dynamique linéaire ou un vecteur de flottants est attendu.
ja_jp: %s: 入力引数 #%d で不正な型: 直線方程式、または、浮動行ベクトルを想定します。
pl_pl: %s: Zły typ parametru wejściowego #%d: Oczekiwano liniowego układu dynamicznego lub wektora typu float.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um sistema linear dinâmico ou vetor-linha de pontos flutuantes.

source: %s: Wrong type for input argument #%d: Array of floating point numbers expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée #%d: un tableau de nombre flottants est attendu.
ja_jp: %s: 入力引数 #%d で不正な型: 浮動小数点の配列を想定します。
pl_pl: %s: Nieprawidłowy typ parametru wejściowego #%d: Oczekiwana tablica liczb zmiennoprzecinkowych.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um array de pontos flutuantes.

source: %s: Wrong type for input argument #%d: rational fraction array expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée #%d: Un vecteur de fontions de transfert est attendu.
ja_jp: %s: 入力引数 #%d で不正な型: 有理分数配列を想定します。
pl_pl: %s: Nieprawidłowy typ parametru wejściowego #%d: Oczekiwana tablica liczb rzeczywistych.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um array de frações racionais.

source: %s: Wrong value for input argument #%d: Must be in the interval [%s, %s].
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée #%d: Il doit être dans l'intervalle [%s, %s].
ja_jp: %s: 入力引数 #%d で不正な値: [%s, %s] の間でなくてはなりません。
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: musi być w przedziale [%s, %s].
pt_br: %s: Valor errado para o argumento de entrada #%d: deve estar no intervalo [%s,%s].
ru_ru: %s: Неверное значение аргумента #%d: Должно быть в интервале [%s, %s].

source: %s: Wrong value for input argument #%d: Must be in the set {%s}.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée #%d: Elle doit être dans l'ensemble {%s}.
ja_jp: %s: 入力引数 #%d で不正な値: set {%s} しなくてはなりません。
pl_pl: %s: Nieprawidłowa wartość parametru wejściowego #%d: Musi być w ustawieniu {%s}.
pt_br: %s: Valor errado para o argumento de entrada #%d: deve pertencer ao conjunto {%s}.

source: %s: Wrong values for input argument #%d: Distance between Max and Min elements must be greater than %g.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée #%d: La distance entre le plus grand et le plus petit élement doit être plus grande que %g.
ja_jp: %s: 入力引数 #%d で不正な値: 最大から最小の要素は %g よりも大きくなくてはなりません。
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: Odległość elementów pomiędzy max i min musi być większa niż %g.
pt_br: %s: Valores errados para o argumento de entrada #%d: Distância entre os elementos Max e Min deve ser maior que %g.

source: %s: Wrong values for input argument #%d: Elements must be in increasing order.
fr_fr: %s: Mauvaises valeurs pour l'argument d'entrée #%d: Les élements doivent être en ordre croissant.
ja_jp: %s: 入力引数 #%d で不正な値: 要素は、増加順序を持たなくてはなりません。
pl_pl: %s: Nieprawidłowe wartości argumentu wejściowego #%d: Elementy muszą być w porządku rosnącym.
pt_br: %s: Valores errados para o argumento de entrada #%d: Elementos devem estar em ordem crescente.

source: %s: Wrong values for input argument #%d: Elements must be in the interval [%s, %s].
fr_fr: %s: Mauvaises valeurs pour l'argument d'entrée #%d: Les élements doivent être dans l'intervalle [%s, %s].
ja_jp: %s: 入力引数 #%d で不正な値: 要素は、[%s, %s] の間でなくてはなりません。
pl_pl: %s: Nieprawidłowe wartości argumentu wejściowego #%d: Elementy muszą być w przedziale [%s, %s].
pt_br: %s: Valores errados para o argumento de entrada #%d: Elementos devem estar no intervalo [%s, %s].

source: %s: Wrong values for input argument #%d: Elements must be positive.
fr_fr: %s: Mauvaises valeurs pour l'argument d'entrée #%d: Les élements doivent être positifs.
ja_jp: %s: 入力引数 #%d で不正な値: 要素は明確でなくてはいけません。
pl_pl: %s: Nieprawidłowe wartości argumentu wejściowego #%d: Elementy muszą być dodatnie.
pt_br: %s: Valores errados para o argumento de entrada #%d: os elementos têm que ser positivos.

source: %s: Wrong values for input argument #%d: Non-negative integers expected.
fr_fr: %s: Mauvaises valeurs pour l'argument d'entrée #%d: des entiers positifs ou nuls sont attendus.
ja_jp: %s: 入力引数 #%d で不正な値: 負数でない整数を想定します。
pl_pl: %s: Nieprawidłowe wartości argumentu wejściowego #%d: Oczekiwana nieujemna wartość integer.
pt_br: %s: Valores errados para o argumento de entrada #%d: esperava-se números inteiros não negativos.

source: %s: Wrong values for input argument #%d: Not sampled high enough.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée #%d: L'échantillonage n'est pas assez fin.
ja_jp: %s: 入力引数 #%d で不正な値: 十分に高いサンプルになりません。
pt_br: %s: Valores errados para o argumento de entrada #%d: Não foi amostrado o suficiente.

source: %s: Wrong values for input argument #%d: The first element must be %s and the last %s.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée #%d: Le premier élement doit être %s et le dernier %s.
ja_jp: %s: 入力引数 #%d で不正な値: 最初の要素は、 %s で 最後の %s でなくてはなりません。
pt_br: %s: Valores errados para o argumento de entrada #%d: O primeiro elemento deve ser %s e o último %s.

source: %s: Wrong values for input argument #%d: degree must be in the set {%s}.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée #%d: Le degré doit être dans l'ensemble {%s}.
ja_jp: %s: 入力引数 #%d で不正な値: set {%s} をしなくてはなりません。
pl_pl: %s: Nieprawidłowe wartości argumentu wejściowego #%d: Stopień musi być w zestawie {%s}.
pt_br: %s: Valores errados para o argumento de entrada #%d: o grau deve pertencer ao conjunto {%s}.

source: Arma identification
ja_jp: ARMA識別
pl_pl: identyfikacja Arma

source: Signal Processing
ja_jp: シグナル処理
pl_pl: Przetwarzanie sygnałów
pt_br: Processamento de sinal

source: Spectral power
ja_jp: パワースペクトル
pl_pl: Moc widma

source: Theoretical value
ja_jp: 理論値
pl_pl: Wartość teoretyczna

source: Using macro mese
ja_jp: MESEマクロを使う
pl_pl: Korzystanie z makro mese

source: estimates xf
ja_jp: 推定 xf
pl_pl: szacowanie xf

source: estimates xs
ja_jp: 推定 xs
pl_pl: szacowanie xs

source: frequency
ja_jp: 周波数
pl_pl: Częstotliwość

source: real state
ja_jp: 実状態
pl_pl: Rzeczywisty stan

source: spectral estimate
ja_jp: スペクトル推定法
pl_pl: szacowanie widma

source: %s: Wrong type for input argument #%d: Real expected.
ru_ru: %s: Неверный тип аргумента #%d: Ожидалось вещественное число.

source: %s: An error occurred: %s
ru_ru: %s: Произошла ошибка: %s

source: %s: Wrong values for input argument #%d
ru_ru: %s: Неверные значения аргумента #%d

source: %s: Wrong value for input argument #%d: Must be in the interval [%d, %d].
ru_ru: %s: Неверное значение аргумента #%d: Должно быть в интервале [%d, %d].

source: %s: Wrong number of input argument(s).
ru_ru: %s: Неверное количество аргументов.

source: %s: Wrong size for input argument #%d.
ru_ru: %s: Неверный размер аргумента #%d.

source: %s: Wrong values for input argument #%d: The first frequency must be 0 and the last 1.
ru_ru: %s: Неверные значения аргумента #%d: Первая частота должна быть 0 а последняя 1.

source: Unknown design type --- program termination.
ru_ru: Неизвестный тип модели --- программа завершается.

source: %s: Wrong value for input argument #%d: %s
ru_ru: %s: Неверное значение аргумента #%d: %s

source: %s: Wrong value for input argument #%d: Must be between %d and %d.
ru_ru: %s: Неверное значение аргумента #%d: Должно быть между %d и %d.

source: %s: Wrong type for input argument #%d: N-dimensionnal array expected.
ru_ru: %s: Неверный тип аргумента #%d: Ожидался N-размерный массив.

source: %s: Wrong type for input argument #%d: A string expected.
ru_ru: %s: Неверный тип аргумента #%d: Ожидалась строка.

source: %s: Wrong value for input argument #%d: Must be less than 0.5
ru_ru: %s: Неверное значение аргумента #%d: Должно быть менее 0.5

source: %s: Wrong value for input argument #%d: Must be [%d %d].
ru_ru: %s: Неверное значение аргумента #%d: Должно быть [%d %d].

source: %s: Wrong type for input argument(s).
ru_ru: %s: Неверны типы аргументов.

source: %s: Input argument #%d must be equal to 1 or 2.
ru_ru: %s: Аргумент #%d должен равняться 1 или 2.
