Repository: ScilabOrg/scilab
Catalog: scilab/modules/linear_algebra/locales/*/linear_algebra.po
Languages: pl_pl, pt_br

source: %s: Incompatible input arguments #%d and #%d: Same sizes expected.
pl_pl: %s: Niezgodne argumenty wejściowe #%d oraz #%d: Oczekiwany taki sam rozmiar.
pt_br: %s: Argumentos de entrada incompatíveis #%d e #%d: Esperava-se as mesmas dimensões.

source: %s: Non convergence in QR steps.
pl_pl: %s: Brak zbieżności iteracji QR.
pt_br: %s: Não convergencia das iterações QR.

source: %s: SVD and QR not implemented in sparse.
pl_pl: %s: SVD i QR nie zostanie zaimplementowane w rzadkich.
pt_br: %s: SVD e QR não implementados para matrizes esparsas.

source: %s: This feature has not been implemented.
pl_pl: %s: Funkcja ta nie została zrealizowana.
pt_br: %s: Este recurso não foi implementado.

source: %s: Wrong number of input argument(s): %d expected.
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano %d.
pt_br: %s: Quantidade errada de argumento(s) de entrada: Esperava-se %d.

source: %s: Wrong number of input arguments: %d or %d expected.
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano %d lub %d.

source: %s: Wrong size for input argument #%d: A column vector expected.
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego #%d: oczekiwany wektor kolumnowy.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um vetor coluna.

source: %s: Wrong size for input argument #%d: A scalar expected.
pl_pl: %s: Nieprawidłowy rozmiar dla argumentu wejściowego #%d: Oczekiwany skalar.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um escalar.

source: %s: Wrong size for input argument #%d: A square matrix expected.
pl_pl: %s: Nieprawidłowy rozmiar parametru wejściowego #%d: oczekiwana macierz kwadratowa.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se uma matriz quadrada.

source: %s: Wrong size for input argument #%d: Symmetric expected
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego #%d: Oczekiwano wielkości symetrycznej
pt_br: %s: Tamanho errado para o argumento de entrada #%d: esperava matriz simétrica.

source: %s: Wrong type for input argument #%d.
pl_pl: %s: Niewłaściwy typ argumentu wejściowego #%d.
pt_br: %s: Tipo errado para o argumento de entrada #%d.

source: %s: Wrong type for input argument #%d: Real matrix expected.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: Oczekiwana macierz typu real.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se uma matriz de números reais.

source: %s: Wrong type for input argument #%d: Real or Complex matrix expected.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: Oczekiwano wartości rzeczywistych lub macierzy liczb zespolonych.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se uma matriz de números reais ou complexos.

source: %s: Wrong value for input argument #%d: Must be in the set {%s}.
pl_pl: %s: Zła wartość parametru wejściowego #%d: Musi być w ustawieniu {%s}.
pt_br: %s: Valor errado para o argumento de entrada #%d: Deve pertencer ao conjunto {%s}.

source: %s: Wrong value for input argument #%d: Non-negative integer expected.
pl_pl: %s: Zła wartość parametru wejściowego #%d: oczekiwana nieujemna wartość integer.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se um número inteiro não negativo.

source: %s: Wrong value for input argument #%d: Not semi-definite positive
pl_pl: %s: Zła wartość parametru wejściowego #%d: częściowo nieokreślony pozytywnie
pt_br: %s: Valor errado para o argumento de entrda #%d: não é positivo semi-definido.

source: %s: Wrong value for input argument #%d: Requested rank is greater than matrix dimension.
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: Ranga wnioskowana jest większa niż wymiar macierzy.
pt_br: %s: Valor errado para o argumento de entrada #%d: posto requerido é maior que a dimensão da matriz.

source: %s: Wrong values for input argument #%d: Non-negative integers expected.
pl_pl: %s: Nieprawidłowe wartości argumentu wejściowego #%d: Oczekiwana nieujemna wartość integer.
pt_br: %s: Valores errados para o argumento de entrada #%d: Esperava-se números inteiros não negativos.

source: %s: Wrong values for input argument #%d: Non-negative scalar expected.
pl_pl: %s: Nieprawidłowe wartości argumentu wejściowego #%d: spodziewana wartość skalarna.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se um escalar não negativo.
