Repository: ScilabOrg/scilab
Catalog: scilab/modules/sparse/locales/*/sparse.po
Languages: pl_pl

source: Density = %2.2lf%%.
pl_pl: Gęstość = %2.2lf%%.

source: Largest diagonal element = %-1.4lg.
pl_pl: Element o największej przekątnej = %-1.4lg.

source: Largest element in matrix = %-1.4lg.
pl_pl: Największy element w macierzy = %-1.4lg.

source: Largest pivot element = %-1.4lg.
pl_pl: Największy element obrotowy = %-1.4lg.

source: Absolute Threshold = %e
pl_pl: Próg bezwzględny = %e

source: Average number of elements per row = %lf
pl_pl: Średnia liczba elementów w każdym wierszu = %lf

source: Average number of fill-ins per row = %lf%%
pl_pl: Średnia liczba wypełnień w każdym wierszu = %lf%%

source: Density = %lf%%
pl_pl: Gęstość = %lf%%

source: Fill-ins = %d
pl_pl: Wypełnienia = %d

source: Initial average number of elements per row = %lf
pl_pl: Średnia początkowa liczba elementów w każdym wierszu = %lf

source: Initial number of elements = %d
pl_pl: Początkowa liczba elementów = %d

source: Largest Element = %e
pl_pl: Największy element = %e

source: Relative Threshold = %e
pl_pl: Granica relatywa = %e

source: Smallest Element = %e
pl_pl: Najmniejszy element = %e

source: Total number of elements = %d
pl_pl: Całkowita liczba elementów = %d

source: Iteration #%s/%s residual : %s
pl_pl: Interacja #%s/%s pozostałe : %s

source: New residual = %s < tol = %s => break
pl_pl: Nowe pozostałe = %s < tol = %s => przerwa

source: Type of preconditionning #1 : %d
pl_pl: Rodzaj pre kondycjonalny #1 : %d

source: Type of preconditionning #2 : %d
pl_pl: Rodzaj pre kondycjonalny #2 : %d

source: %s: A zero was encountered on the diagonal the matrix.
pl_pl: %s: Napotkano zero na przekątnej macierzy.

source: %s: Convergence error.
pl_pl: %s: Błąd konwergencji.

source: %s: Did not converge.
pl_pl: %s: Nie zbiegają się.

source: %s: Wrong number of input argument: At least %d expected.
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: Oczekiwano przynajmniej %d.

source: %s: Wrong number of input arguments: %d to %d expected.
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano od %d do %d.

source: %s: Wrong number of input arguments: At least %d expected.
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: Oczekiwano przynajmniej %d.

source: %s: Wrong size for input argument #%d: Must be same size as input argument #%d
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego #%d: Argument wejściowy musi być tego samego rozmiaru #%d

source: %s: Wrong size for input argument #%d: Same size as input argument #%d expected.
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego #%d: Oczekiwany taki sam rozmiar jak argument wejściowy #%d.

source: %s: Wrong size for input argument #%d: Square matrix expected.
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego #%d: Oczekiwano macierzy kwadratowej.

source: %s: Wrong type for input argument #%d.
pl_pl: %s: Niewłaściwy typ argumentu wejściowego #%d.

source: %s: Wrong type for input argument #%d: Column vector expected.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: Oczekiwany jest wektor kolumnowy.

source: %s: Wrong type for input argument #%d: Same size as input argument #%d expected.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: Oczekiwany taki sam rozmiar jak argument wejściowy #%d.

source: %s: Wrong type for input argument #%d: Same size as the input argument #%d expected.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: Oczekiwany taki sam rozmiar jak argument wejściowy #%d.

source: %s: Wrong type for input argument #%d: Scalar expected.
pl_pl: %s: Niewłaściwy typ argumentu wejściowego #%d: oczekiwany skalar.

source: %s: Wrong type for input argument #%d: Square matrix expected.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: Oczekiwana jest macierz kwadratowa.

source: %s: Wrong type for input argument #%d: Transpose of the function %s expected.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: Oczekiwana funkcja transponowana %s.

source: %s: Wrong value for input argument #%d: Column vector expected.
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: Oczekiwany wektor kolumnowy.

source: %s: Wrong value for input argument #%d: Transpose of the function %s expected.
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: Oczekiwana funkcja transponowana %s.

source: %s: Wrong value for input argument #%d: Vector expected.
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: oczekiwany wektor.

source: Algorithm fails
pl_pl: Algorytm nieukończony

source: Algorithm pass
pl_pl: Algorytm przechodni

source: Arguments:
pl_pl: Argumenty:

source: Columns %1d to %1d.
pl_pl: Kolumny %1d to %1d.

source: Final residual = %s > tol =%s
pl_pl: Pozostałości finalne = %s > tol =%s

source: MATRIX SUMMARY
pl_pl: MACIERZ PODSUMOWANA

source: Matrix after factorization:
pl_pl: Macierz po rozkładzie na czynniki:

source: Matrix before factorization:
pl_pl: Macierz przed rozkładem na czynniki:

source: Matrix has been reordered.
pl_pl: Macierz została zmieniona.

source: Matrix has not been factored.
pl_pl: Macierz nie jest czynnikiem.

source: Matrix is complex.
pl_pl: Macierz jest złożona.

source: Matrix is real.
pl_pl: Macierz jest typu real.

source: Norm of right-hand side : %s
pl_pl: Norma z prawej strony ręki :%s

source: Number of fill-ins = %1d.
pl_pl: Liczby wypełnione-ins = %1d

source: Operation count for inner loop of factorization = %d.
pl_pl: Ilość operacji dla pętli wewnętrznej rozkładu na czynniki = %d.

source: Pivot found at %1d,%1d using
pl_pl: Pivot znaleziony w %1d,%1d użyty

source: Reordering, Step = %1d
pl_pl: Zmienna kolejność kroków = %1d

source: Size of matrix = %1u x %1u.
pl_pl: Rozmiar macierzy = %1u x %1u.

source: Smallest diagonal element = %-1.4lg.
pl_pl: Najmniejszy element diagonalny = %-1.4lg.

source: Smallest element in matrix = %-1.4lg.
pl_pl: Najmniejszy element w macierzy = %-1.4lg.

source: Smallest pivot element = %-1.4lg.
pl_pl: Najmniejszy element obrotowy = %-1.4lg.

source: Special processing where the right-hand side is zero.
pl_pl: Specjalny proces gdzie prawa strona jest równa zero.

source: Warning : The following matrix is factored in to LU form.
pl_pl: Ostrzeżenie : Następująca macierz jest odzwierciedleniem dla formy LU.

source: sparse: panic in file `%s' at line %d.
pl_pl: rzadkość: chaos w pliku `%s' w lini %d.

source: ||| Starting new matrix |||
pl_pl: ||| Rozpoczęto nową macierz |||
