Repository: ScilabOrg/scilab
Catalog: scilab/modules/string/locales/*/string.po
Languages: fr_fr, pl_pl, pt_br

source: %s : Memory allocation error.
fr_fr: %s : Erreur d'allocation mémoire.
pl_pl: %s : Błąd alokacji pamięci.

source: %s : No more memory.
fr_fr: %s : Pas assez de mémoire.
pl_pl: %s : Zabrakło pamięci.
pt_br: %s : Memória esgotada.

source: %s : Wrong size for input argument #%d.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n° %d.
pl_pl: %s : Zły rozmiar parametru wejściowego #%d.
pt_br: %s : Tamanho incorreto para o argumento de entrada #%d.

source: %s : Wrong size for input argument(s).
fr_fr: %s : Mauvaise dimension pour le(s) argument(s) d'entrée.
pl_pl: %s : Zły rozmiar argumentu(-ów) wejściowego(-ych).
pt_br: %s : Tamanho incorreto para os argumentos de entrada.

source: %s: Can not compile pattern.
fr_fr: %s: Ne peux pas compiler le motif.
pl_pl: %s: Nie można skompilować wzoru.
pt_br: %s: Não é possível compilar o padrão.

source: %s: Capturing subpatterns error.
fr_fr: %s: Capture d'une erreur concernant des sous-motifs.
pl_pl: %s: Błąd przechwytywania subwzorców.
pt_br: %s: Capturando erro de subpadrões.

source: %s: Contains explicit CR or LF match.
fr_fr: %s: Contient des correspondances explicites avec CR ou LF.
pl_pl: %s: Zawiera wyrażenie matematyczne CR lub LF.
pt_br: %s: Contém correspondência CR ou LF explícita.

source: %s: Current PCRE library does not support UTF-8.
pl_pl: %s: Biblioteka PCRE nie obsługuje UTF-8.
pt_br: %s: A biblioteca PCRE atual não oferece suporte a UTF-8.

source: %s: Delimiter must not be alphameric.
fr_fr: %s: Les délimiteurs ne doivent pas être alphanumériques.
pl_pl: %s: Ograniczniki nie powinny być alfanumeryczne.
pt_br: %s: O delimitador não deve ser alfabético.

source: %s: Duplicate name status changes.
fr_fr: %s : Changement de statut des noms dupliqués.
pl_pl: %s: Zduplikowana nazwa status zmieniony.
pt_br: %s: O nome de status duplicado muda.

source: %s: Elements of %dth argument must be in increasing order.
pl_pl: %s: Elementy argumentu numer %d muszą być w porządku rosnącym.

source: %s: Given expression has no value.
fr_fr: %s: L'expression donnée n'a pas de valeur.
pl_pl: %s: Podane wyrażenie nie posiada wartości.
pt_br: %s: Expressão fornecida não possui valor.

source: %s: Match limit not relevant for DFA matching: ignored.
fr_fr: %s: Limite de correspondance inutile pour la correspondance DFA: ignoré.
pl_pl: %s: Odpowiadający limit nie jest istotny dla dopasowanego DFA: ignorowany.
pt_br: %s: O limite de correspondência não é relevante para a correspondência DFA: ignorado.

source: %s: Matched text exceeds buffer limit.
fr_fr: %s: Le texte correspondant dépasse la taille limite du buffer.
pl_pl: %s: Odpowiadający tekst przekracza limit bufora.
pt_br: %s: O texto correspondido excede o limite de buffer.

source: %s: No more memory.
fr_fr: %s : Plus de mémoire disponible.
pl_pl: %s: Brak pamięci.
pt_br: %s: Memória esgotada.

source: %s: Partial matching not supported.
fr_fr: %s: Correspondance partielle non supportée.
pl_pl: %s: Częściowa zgodność nie jest wspierana.
pt_br: %s: Correspondência parcial não é suportada

source: %s: Returned count is too big for offset size.
fr_fr: %s: Le comptage retourné est trop grand pour la taille de l'offset.
pl_pl: %s: Zwrócona liczba jest zbyt duża dla wyrównania wielkości.
pt_br: %s: A contagem retornada é muito grande para o tamanho do offset.

source: %s: This feature has not been implemented: %s.
fr_fr: %s: Cette fonctionnalité n'a pas été implémentée: %s.
pl_pl: %s: Funkcja ta nie została zrealizowana: %s.
pt_br: %s: Este recurso não foi implementado: %s.

source: %s: This feature has not been implemented: Variable translation of type %s.
fr_fr: %s : Cette fonctionnalité n'a pas encore été implémentée : Traduction d'une variable du type %s.
pl_pl: %s: Funkcja ta nie została zrealizowana: Zmienna typu tłumaczenia %s.
pt_br: %s: Este recurso não foi implementado: Tradução de variável de tipo %s.

source: %s: Unknown error.
fr_fr: %s: Erreur inconnue.
pl_pl: %s: Nieznany błąd.
pt_br: %s: Erro desconhecido.

source: %s: Wrong number of input argument: %d expected.
fr_fr: %s: Mauvais nombre d'arguments d'entrée: %d attendus.
pl_pl: %s: Niewłaściwa liczba argumentów wejściowych: oczekiwano %d.
pt_br: %s: Número de argumentos de entrada incorreto: Esperava-se %d.

source: %s: Wrong number of output arguments: %d expected.
pl_pl: %s: Niewłaściwa liczba argumentów wyjściowych: oczekiwano %d.

source: %s: Wrong size for input argument #%d.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d.
pl_pl: %s: Niewłaściwy rozmiar dla argumentu wejściowego #%d.
pt_br: %s: Tamanho errado para o argumento de entrada #%d.

source: %s: Wrong size for input argument #%d: A character expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Un caractère attendu.
pl_pl: %s: Nieprawidłowy rozmiar dla argumentu wejściowego #%d: Oczekiwano znaku.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um caractere.

source: %s: Wrong size for input argument #%d: A character or vector of characters expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Un caractères ou un vecteur de caractères attendu.
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego #%d: oczekiwany znak lub wektor znaków.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Era esperado um caractere ou um vetor de caracteres.

source: %s: Wrong size for input argument #%d: A character string expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Une chaîne de caractères attendue.
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego #%d: oczekiwany ciąg znaków.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Era esperado um texto.

source: %s: Wrong size for input argument #%d: A scalar expected.
pl_pl: %s: Nieprawidłowy rozmiar dla argumentu wejściowego #%d: Oczekiwano skalaru.

source: %s: Wrong size for input argument #%d: A string expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Une chaîne de caractères attendue.
pl_pl: %s: Nieprawidłowy rozmiar dla argumentu wejściowego #%d: Oczekiwano łańcuchu znaków.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um string.

source: %s: Wrong size for input argument #%d: An integer expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Un entier attendu.
pl_pl: %s: Nieprawidłowy rozmiar dla argumentu wejściowego #%d: Oczekiwano liczby całkowitej.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se um número inteiro.

source: %s: Wrong size for input argument #%d: Non-empty matrix expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Une matrice non vide attendue.
pl_pl: %s: Nieprawidłowy rozmiar dla argumentu wejściowego #%d: Oczekiwano nie pustej macierzy.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se uma matriz não-vazia.

source: %s: Wrong size for input argument #%d: Non-empty matrix of strings expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Une matrice non vide de chaîne de caractères attendue.
pl_pl: %s: Nieprawidłowy rozmiar dla argumentu wejściowego #%d: Oczekiwano nie pustej macierzy łańcuchów znaków.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se uma matriz não-vazia de string.

source: %s: Wrong size for input argument #%d: Non-empty string expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Une chaîne de caractère non vide attendue.
pl_pl: %s: Nieprawidłowy rozmiar dla argumentu wejściowego #%d: Oczekiwano niepustego łańcuchu znaków.
pt_br: %s: Tamanho errado para o argumento de entrada #%d: Esperava-se string não-vazio.

source: %s: Wrong size for input argument #%d: Single string expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Une simple chaîne de caractères attendue.
pl_pl: %s: Nieprawidłowy rozmiar dla argumentu wejściowego #%d: Oczekiwano pojedynczego łańcuchu znaków.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um único string.

source: %s: Wrong size for input argument(s).
fr_fr: %s: Mauvaise taille pour le(s) argument(s) en entrée.
pl_pl: %s: Nieprawidłowy rozmiar argumentu(ów) wejściowego(ych).
pt_br: %s: Tamanho(s) errado(s) para o(s) argumento(s) de entrada.

source: %s: Wrong size for input arguments: Same sizes expected.
fr_fr: %s: Mauvaise taille pour les arguments en entrée: Même taille attendue.
pl_pl: %s: Nieprawidłowy rozmiar dla argumentów wejściowych: Oczekiwano tego samego rozmiaru.
pt_br: %s: Tamanho errado para argumentos de entrada: Esperava-se tamanhos iguais

source: %s: Wrong type for argument #%d: Matrix of strings or Integer matrix expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Une matrice de chaîne de caractères ou une matrice d'entiers attendue.
pl_pl: %s: Nieprawidłowy typ argumentu #%d: oczekiwana macierz ciągów lub macierz liczb całkowitych.
pt_br: %s: Tipo incorreto para o argumento #%d: Esperava-se uma matriz de strings ou de inteiros.

source: %s: Wrong type for input argument #%d.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d.
pl_pl: %s: Niewłaściwy typ argumentu wejściowego #%d.
pt_br: %s: Tipo errado para o argumento de entrada #%d.

source: %s: Wrong type for input argument #%d: '%s' expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: '%s' attendu.
pl_pl: %s: Niewłaściwy typ argumentu wejściowego #%d: '%s' oczekiwany.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se '%s'.

source: %s: Wrong type for input argument #%d: ''%s'' expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: ''%s'' attendu.
pl_pl: %s: Niewłaściwy typ argumentu wejściowego #%d: ''%s'' oczekiwany.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se "%s".

source: %s: Wrong type for input argument #%d: ''%s'' or ''%s'' expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: ''%s'' ou ''%s'' attendu.
pl_pl: %s: Niewłaściwy typ argumentu wejściowego #%d: ''%s'' lub ''%s'' oczekiwany.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se ''%s'' ou ''%s''.

source: %s: Wrong type for input argument #%d: A boolean expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Un booléen attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: Oczekiwana jest wartość typu boolean.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um booleano.

source: %s: Wrong type for input argument #%d: A character expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Un caractère attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwany znak.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um caractere.

source: %s: Wrong type for input argument #%d: A character or a vector of single characters expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Un caractères ou un vecteur de caractères seuls attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwany znak lub wektor pojedynczych znaków.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um caractere ou um vetor de caracteres simples.

source: %s: Wrong type for input argument #%d: A scalar expected.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: Oczekiwany jest skalar.

source: %s: Wrong type for input argument #%d: A string expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Une chaîne de caractères est attendue.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: Oczekiwana jest wartość typu string.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um string.

source: %s: Wrong type for input argument #%d: An integer expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Un entier attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: Oczekiwana liczba całkowita.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um número inteiro.

source: %s: Wrong type for input argument #%d: Character expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Un caractère attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: Oczekiwany znak.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um caractere.

source: %s: Wrong type for input argument #%d: Matrix of character strings.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Matrice de chaîne de caractères.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: Macierz ciągów znaków.
pt_br: %s: Tipo incorreto para o argumento de entrada #%d: Esperava-se matriz de strings.

source: %s: Wrong type for input argument #%d: Matrix of integers expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Une matrice d'entiers attendue.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwana macierz liczb całkowitych.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se uma matriz de inteiros.

source: %s: Wrong type for input argument #%d: Matrix of strings expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Une matrice de chaîne de caractères attendue.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwana macierz ciągów znaków.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se uma matriz de strings.

source: %s: Wrong type for input argument #%d: Matrix of strings or empty matrix expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Une matrice de chaîne de caractères ou une matrice vide attendue.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwana macierz ciągów znaków lub macierz pusta.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se uma matriz de strings ou uma matriz vazia.

source: %s: Wrong type for input argument #%d: Matrix of strings or empty real matrix expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Une matrice de chaîne de caractères ou une matrice réelle vide attendue.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwana macierz ciągów znaków lub macierz pusta typu real.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se uma matriz de strings ou matriz vazia de reais.

source: %s: Wrong type for input argument #%d: Real matrix expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Une matrice réelle attendue.
pl_pl: %s: Niewłaściwy typ argumentu wejściowego #%d: oczekiwana macierz wartości real.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se uma matriz de números reais.

source: %s: Wrong type for input argument #%d: Real matrix or matrix of strings expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Une matrice de réels ou une matrice de chaîne de caractères attendue.
pl_pl: %s: Niewłaściwy typ argumentu wejściowego #%d: oczekiwana macierz wartości real lub macierz ciągów znaków.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se uma matriz de reais de strings.

source: %s: Wrong type for input argument #%d: Real or Complex matrix, Matrix of character strings or list expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Matrice réelle ou complexe, matrice de chaîne de caractères ou list attendue.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: Oczekiwano rzeczywistych lub zespolonych macierzy, Macierzy ciągu znaków lub listy.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se uma matriz de reais ou complexos, de strings, ou uma lista

source: %s: Wrong type for input argument #%d: Row vector of strings or column vector of strings expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Un vecteur ligne de chaîne de caractères ou un vetceur colonne de chaîne de caractères attendu.
pl_pl: %s: Niewłaściwy typ argumentu wejściowego #%d: oczekiwany jest wektor wierszowy ciągów znaków lub wektora kolumnowy ciągów znaków.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um vetor-linha ou coluna de strings.

source: %s: Wrong type for input argument #%d: Single string expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Une simple chaîne de caractères attendue.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwany jest pojedynczy ciąg znaków.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um único string.

source: %s: Wrong type for input argument #%d: String expected.
fr_fr: %s: Mauvais type pour l'argument n° %d: Chaîne de caractères attendue.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwany jest ciąg znaków.
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um string.

source: %s: Wrong type for input argument #%d: a string vector expected.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: Oczekiwany wektor ciągów znaków.
pt_br: %s: Tipo errado para o argumento de entrada #%d: esperado um vetor de string.

source: %s: Wrong type for input argument(s).
fr_fr: %s: Mauvais type pour le(s) argument(s) en entrée.
pl_pl: %s: Nieprawidłowy typ argumentu(ów) wejściowego(ych).
pt_br: %s: Tipo(s) errado(s) para o(s) argumento(s) de entrada.

source: %s: Wrong type for input argument: String expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée: Chaîne de caractère attendue.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego: oczekiwany jest ciąg znaków.
pt_br: %s: Tipo errado para o argumento de entrada: Esperava-se um string.

source: %s: Wrong value for input argument #%d: %s or %s expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° %d: %s ou %s attendu.
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: oczekiwana %s lub %s.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se %s ou %s.

source: %s: Wrong value for input argument #%d: '%s' or '%s' expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° %d: '%s' ou '%s' attendu.
pl_pl: %s: Nieprawidłowa wartość parametru wejściowego #%d: oczekiwana '%s' lub '%s'.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se '%s' ou '%s'.

source: %s: Wrong value for input argument #%d: ''%s'' expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° %d: ''%s'' attendu.
pl_pl: %s: Nieprawidłowa wartość parametru wejściowego #%d: oczekiwana ''%s''.
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se ''%s''.

source: %s: Wrong value for input argument #%d: ''%s'' or ''%s'' expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° %d: ''%s'' ou ''%s'' attendu.
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: oczekiwana "%s" lub "%s" .
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se ''%s''' ou ''%s'.

source: %s: Wrong value for input argument #%d: 's' or 'r' expected.
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: oczekiwana 's' lub 'r'.
pt_br: %s: Valor errado para o argumento de entrada #%d: esperado 's' ou 'r'.

source: %s: Wrong value for input argument #%d: 'u' (Upper) or 'l' (Lower) expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° %d: 'u' (supérieur) ou 'l' (inférieur) attendu.
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: Oczekiwano wartości 'u' (górnej) lub 'l' (dolnej)
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se 'u' (Superior) ou 'l' (Inferior).

source: %s: Wrong value for input argument #%d: A valid string expected (UTF-8 Encoding problem).
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: Oczekiwana ważna zmienna typu string (UTF-8 Problem z kodowaniem).
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperado uma string válida (Problema de codificação UTF-8).

source: %s: Wrong value for input argument #%d: A value > 0 expected.
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: oczekiwana wartość > 0.

source: %s: Wrong value for input argument #%d: Must be between %d and %d.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° %d: Doit être entre %d et %d.
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: musi być pomiędzy %d i %d.
pt_br: %s: Valor incorreto para o argumento de entrada #%d: Deve estar entre %d e %d.

source: %s: Wrong value for input argument #%d: a string expected, not a regexp pattern.
pl_pl: %s: Nieprawidłowa wartość argumentu wejściowego #%d: oczekiwano zmienną typu string, nie wzór regexp.

source: %s: Wrong values for input argument #%d: ''r'',''l'' or ''c'' expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée #%d: ''r'',''l'' or ''c'' attendus.
pl_pl: %s: Nieprawidłowe wartości argumentu wejściowego #%d: oczekiwana ''r'',''l'' lub ''c''.
pt_br: %s: Valores incorretos para o argumento de entrada #%d: Esperava-se ''r'',''l'' ou ''c''.

source: %s: Wrong values for input argument #%d: An non-negative integer expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° %d: Un entier non-négatif attendu.
pl_pl: %s: Nieprawidłowe wartości argumentu wejściowego #%d: oczekiwana liczba całkowita nieujemna.
pt_br: %s: Valor errado para o argumento de entrada #%d: Era esperado um número natural (inteiro não negativo).

source: %s: Wrong values for input argument #%d: Must be >= 1.
fr_fr: %s: Mauvaise valeurs pour l'argument d'entrée n° %d: Doit être >= 1.
pl_pl: %s: Nieprawidłowe wartości argumentu wejściowego #%d: musi być >= 1.
pt_br: %s: Valores errados para o argumento de entrada #%d: Deve ser >= 1.

source: %s: Wrong values for input argument #%d: Non-empty strings expected.
fr_fr: %s: Mauvaise valeurs pour l'argument d'entrée n° %d: Des chaînes de caractères non vides attendues.
pl_pl: %s: Nieprawidłowe wartości argumentu wejściowego #%d: oczekiwany niepusty ciąg znaków.
pt_br: %s: Valores errados para o argumento de entrada #%d: Esperava-se strings não-vazios.

source: %s: error.
pl_pl: %s: Błąd.

source: %s: impossible to get dimensions of this matrix.
pl_pl: %s: nie można uzyskać wymiaru tej macierzy.

source: WARNING :
fr_fr: ATTENTION:
pl_pl: Uwaga :
pt_br: AVISO:

source: WARNING: Function %s is obsolete.
pl_pl: UWAGA: Funkcja %s jest zdezaktualizowana.

source: WARNING: Please use %s instead.
pl_pl: UWAGA: Proszę w zamian użyć %s.

source: WARNING: This function will be permanently removed in Scilab %s.
pl_pl: UWAGA: Ta funkcja zostanie na stałe usunięta w Scilab %s.

source: %s: Memory allocation error.
pt_br: %s : Erro na alocação de memória.
