Repository: ScilabOrg/scilab
Catalog: scilab/modules/helptools/locales/*/helptools.po
Languages: ja_jp, pl_pl

source: %s: Wrong number of input arguments: %d expected.
ja_jp: %s: 入力引数で不正な値: %d を想定します。
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano %d.

source: %s: Wrong number of input arguments: %d to %d expected.
ja_jp: %s: 入力引数で不正な値: %d から %d を想定します。
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano od %d do %d.

source: %s: Directory %s does not exist or read access denied.
ja_jp: %s: ディレクトリー %s は、存在しません。あるいは、読みこみは拒否されました。
pl_pl: %s: Katalog %s nie istnieje lub brak dostępu do odczytu.

source: -- Deleting help files --
ja_jp: -- ヘルプファイルを削除 --
pl_pl: -- Usuwanie plików pomocy --

source: Processing %s to %s
ja_jp: %s から %s へ加工

source: %s: Wrong type for input argument #%d: A string expected.
ja_jp: %s: 入力引数 #%d で不正な型: 文字列を想定します。
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwana jest wartości typu string.

source: %s: The help browser is disabled in %s mode.
ja_jp: %s: %s モードで、ヘルプブラウザは無効にされます。
pl_pl: %s: Przeglądarka pomocy jest nieaktywna w trybie %s.

source: %s: help module is not installed.
ja_jp: %s: ヘルプモジュールがインストールされていません。
pl_pl: %s: moduł pomocy nie jest zainstalowany.

source: Scilab 5.0 or more is required.
ja_jp: Scilab 5.0 以上が必要です。

source: ...demodir must be a directory.
ja_jp: ...demodir ディレクトリでなくてはなりません。

source: %s: Wrong number of input argument: %d expected.
ja_jp: %s: 入力引数で不正な値: %d を想定します。
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano %d.

source: %s: This function is only supported on Windows platforms.
ja_jp: %s: この関数はWindowsプラットホームだけをサポートします。
pl_pl: %s: Ta funkcja działa tylko na platformie Windows.

source: %s: Wrong number of input argument(s): At most %d expected.
ja_jp: %s: 入力引数(s)で不正な値: すくなくとも %d を想定します。
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano najwyżej %d.

source: Help chapter
ja_jp: ヘルプ章
pl_pl: Rozdział pomocy

source: %s: The %s files are up-to-date.
ja_jp: %s: %sファイルは、最新です。

source: Copying missing help files copied from the default language
ja_jp: デフォルト言語からヘルプファイルのコピー間違いです

source: Copying missing files copied from
ja_jp: 見当たらないコピーの間違いです

source: Copying missing from %s
ja_jp: %s からのコピー間違いです

source: Building the Scilab manual master document for %s.
ja_jp: %sのScilabマニュアル マスタードキュメントを構築。
pl_pl: Tworzenie podręcznika Scilab dokumentu głównego dla %s.

source: Building the master document: %s
ja_jp: マスタードキュメントの構築: %s

source: Building the master document for %s.
ja_jp: %s のマスタードキュメントの構築。

source: Building the master document in %s
ja_jp: %s でマスタードキュメントの構築

source: Building the scilab manual file [
ja_jp: scilabマニュアル・ファイル構築 [

source: %s: %s has not been generated.
ja_jp: %s: %s は構築できませんでした。
pl_pl: %s: %s nie zostały wygenerowane.

source: %s: %s file hasn''t been moved in the %s directory.
ja_jp: %s: %sファイルは、%sディレクトリーで動かせませんでした。
pl_pl: %s: plik %s nie został przeniesiony do katalogu %s.

source: Building the manual file [%s] in %s. (Please wait building ... this can take a while)
ja_jp: %2$s の [%1$s] ファイルの構築(しばらくお待ちください... これは少し時間がかかります)
pl_pl: Tworzenie pliku podręcznika [%s] w %s. (Proszę czekać tworzenie ... może chwile potrwać)

source: Building the manual file [%s]. (Please wait building ... this can take a while)
ja_jp: [%s] ファイルの構築(しばらくお待ちください... これは少し時間がかかります)
pl_pl: Tworzenie pliku podręcznika [%s]. (Proszę czekać tworzenie ... może chwile potrwać)

source: Deleting files copied from
ja_jp: コピーされたファイルを削除

source: Deleting files copied from %s
ja_jp: %sからコピーされたファイルを削除

source: Scilab manual
ja_jp: Scilab マニュアル

source: About Scicos
ja_jp: Scicosについて

source: Scicos Manual
ja_jp: Scicos マニュアル

source: Batch functions
ja_jp: バッチ関数

source: Editor
ja_jp: エディッタ

source: Sources Palette
ja_jp: ソースパレット

source: Linear Palette
ja_jp: 線パレット

source: Non-linear Palette
ja_jp: 非線パレット

source: Branching Palette
ja_jp: 分岐パレット

source: Others Palettes
ja_jp: その他パレット

source: Threshold Palette
ja_jp: 閾値パレット

source: Sinks Palette
ja_jp: SINKパレット

source: Events Palette
ja_jp: イベントパレット

source: Electrical Palette
ja_jp: 電気パレット

source: Thermohydraulics Palette
ja_jp: 熱流力特性パレット

source: Matrix Palette
ja_jp: 行列パレット

source: Integer Palette
ja_jp: 整数パレット

source: Demoblocks Palette
ja_jp: デモ ブロック パレット

source: ABCD Blocks
ja_jp: ABCD ブロック

source: C Computational Functions
ja_jp: Cのコンピュータ関数

source: Scilab Computational Functions
ja_jp: Scilab コンピュータ関数

source: Utilities Functions
ja_jp: ユーティリティ関数

source: Programming Scicos Blocks
ja_jp: Scicosブロック プログラミング

source: Scilab Utilities Functions
ja_jp: Scilab ユーティリティ関数

source: Diagram
ja_jp: 図式

source: Blocks
ja_jp: ブロック

source: Links
ja_jp: リンク

source: Compilation/Simulation
ja_jp: コンパイル/シミュレーション

source: Scilab Data Structures
ja_jp: Sciolab データ構造

source: Palettes
ja_jp: パレット

source: Old Blocks Palette
ja_jp: 古いブロック・パレット

source: Processing file %s.xml
ja_jp: ファイル %s.xml 加工
pl_pl: Przetwarzanie pliku %s.xml

source: Warning %s does not follow the dtd
ja_jp: 警告 %s は、dtdに従っていません
pl_pl: Uwaga %s nie wynika z dtd

source: Scilab '%s' module disabled in -nogui or -nwni mode.
ja_jp: -nogui または -nwni で、Scilab '%s' モジュール無効です。

source: %s: Wrong type for input argument #%d: String expected.
ja_jp: %s: 入力引数 #%d で不正な型: 文字列を想定します。
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwany jest ciąg znaków.

source: %s: Wrong for type for input argument #%d: String expected.
ja_jp: %s: 入力引数 #%d で不正な型: 文字列を想定します。
pl_pl: %s: Zły typ argumentu dla wejścia #%d: oczekiwany jest łańcuch.

source: %s: Could find or create the working directory %s.
ja_jp: %s: 作業ディレクトリ %s を作成するか、見つけます。
pl_pl: %s: Można znaleźć lub utworzyć katalog roboczy %s.

source: %s: Error while building documentation: %s.
ja_jp: %s: ドキュメントをビルドしている間のエラー: %s
pl_pl: %s: Błąd podczas budowania dokumentacji: %s.

source: Scilab '%s' module not installed.
ja_jp: Scilab '%s' モジュールはインストールされていません。
pl_pl: Moduł %s programu Scilab nie jest zainstalowany.

source: Building master documents:
pl_pl: Buduję główne dokumenty:

source: Building the master document:
pl_pl: Tworzenie głównego dokumentu:

source: %s: Cannot open file %s.
pl_pl: %s: Nie można otworzyć pliku %s.

source: %s: Execution Java stack %s.
pl_pl: %s: Wykonywanie stosu Java %s.

source: %s: File skipped %s.
pl_pl: %s: Pliki pomijane %s.

source: %s: Incompatible input arguments #%d and #%d: Same sizes expected.
pl_pl: %s: Niezgodne argumenty wejściowe #%d oraz #%d: Oczekiwany taki sam rozmiar.

source: %s: Processing file: %s
pl_pl: %s: Przetwarzanie pliku: %s

source: %s: Processing file: %s to %s
pl_pl: %s: Przetwarzanie pliku: %s do %s.

source: %s: Reading from directory %s
pl_pl: %s: Odczyt z katalogu %s.

source: %s: Scilab 5.0 or more is required.
pl_pl: %s: Wymagany jest Scilab 5.0 lub nowszy.

source: %s: The 2 mlist must not have any field in common .
pl_pl: %s: 2 mlist nie mogą mieć żadnego pola wspólnego.

source: %s: The CHAPTER file is not well formated at line %d
pl_pl: %s: Plik ROZDZIAŁU nie jest dobrze sformatowany w wierszu %d

source: %s: The file %s does not exist.
pl_pl: %s: Plik %s nie istnieje.

source: %s: The last_successful_build file is not well formated at line %d
pl_pl: %s: Ostatnio prawidłowo utworzony plik nie jest dobrze sformatowany w wierszu %d

source: %s: Wrong number of input argument: %d to %d expected.
pl_pl: %s: Nieprawidłowa liczba argumentów wejściowych: oczekiwano od %d do %d.

source: %s: Wrong size for input argument #%d: A integer expected.
pl_pl: %s: Nieprawidłowy rozmiar argumentu wejściowego #%d: oczekiwano wartości całkowitej.

source: %s: Wrong size for input argument #%d: A string expected.
pl_pl: %s: Nieprawidłowy rozmiar dla argumentu wejściowego #%d: oczekiwano wartości typu string.

source: %s: Wrong size for input argument #%d: Single string expected.
pl_pl: %s: Nieprawidłowy rozmiar dla argumentu wejściowego #%d: oczekiwano pojedynczego łańcuchu znaków.

source: %s: Wrong type for input argument #%d: A boolean expected.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: Oczekiwana jest wartości typu boolean.

source: %s: Wrong type for input argument #%d: A integer expected.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: Oczekiwano wartości całkowitej.

source: %s: Wrong type for input argument #%d: Single string expected.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwany jest pojedynczy łańcuch znaków.

source: %s: Wrong type for input argument #%d: String array expected.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwana jest tablica ciągów znaków.

source: %s: Wrong type for input argument #%d: matrix oriented typed list expected.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwano listy typu macierzowego.

source: %s: Wrong value for input argument #%d: A string that end with .last_successful_build expected.
pl_pl: %s: Nieprawidłowa wartość dla argumentu wejściowego #%d: Oczekiwano ciągu, który ostatnio został z sukcesem utworzony.

source: %s: Wrong value for input argument #%d: A string that end with CHAPTER expected.
pl_pl: %s: Zła wartość dla argumentu #%d: Oczekiwany ciąg kończący się słowem ROZDZIAŁ.

source: %s: Wrong value for input argument #%d: A valid existing directory is expected.
pl_pl: %s: Nieprawidłowa wartości argumentu wejściowego #%d: oczekiwany jest obowiązujący istniejący katalog.

source: %s: Wrong value for input argument #%d: A valid existing file is expected.
pl_pl: %s: Nieprawidłowa wartości argumentu wejściowego #%d: oczekiwany jest obowiązujący istniejący plik.

source: %s: Wrong value for input argument #%d: An existing directory expected.
pl_pl: %s: Nieprawidłowa wartości argumentu wejściowego #%d: oczekiwany jest istniejący katalog.

source: %s: hhc.exe not found.
pl_pl: %s: nie odnaleziono hhc.exe.

source: %s: no file generate.
pl_pl: %s: nie generuje pliku.

source: %s: processed %i files.
pl_pl: %s: przetworzonych plików %i.

source: Building the scilab manual file [
pl_pl: Budowanie pliku pomocy Scilab [

source: Scilab '%s' module disabled in -nogui or -nwni mode.
pl_pl: Moduł '%s' programu Scilab jest wyłączony w trybie -nogui lub -nwni.
