Repository: ScilabOrg/scilab
Catalog: scilab/modules/fileio/locales/*.po
Languages: fr_fr

source: %s: %s format not recognized.
fr_fr: %s : %s format non reconnu.

source: %s: An error occurred in %s: errno=%s
fr_fr: %s : Une erreur est survenue dans %s : errno=%s

source: %s: An error occurred.
fr_fr: %s: Une erreur est survenue.

source: %s: An error occurred: %s
fr_fr: %s : Une erreur s'est produite : %s

source: %s: An error occurred: field %d is too long (< %d) for %%c directive.
fr_fr: %s : Une erreur est survenue : le champ %d est trop long (< %d) pour la directive %%c.

source: %s: An error occurred: field %d is too long (< %d) for %%s directive.
fr_fr: %s : Une erreur est survenue : le champ %d est trop long (< %d) pour la directive %%s.

source: %s: An error occurred: field %d is too long (> %d) for %%[ directive.
fr_fr: %s : Une erreur est survenue : le champ %d est trop long (> %d) for la directive %%[.

source: %s: An error occurred: format is too long (> %d).
fr_fr: %s : Une erreur est survenue : le format est trop long (> %d).

source: %s: An error occurred: too many (> %d) conversion required.
fr_fr: %s : Une erreur est survenue : trop (> %d) de conversion demandées.

source: %s: Cannot close file whose descriptor is %d: File is not active.
fr_fr: %s : Ne peut pas fermer le fichier dont le descripteur est %d : Le fichier n'est pas actif.

source: %s: Cannot close file whose descriptor is %d: No file to close.
fr_fr: %s : Ne peut pas fermer le fichier dont le descripteur est %d : Aucun fichier à fermer.

source: %s: Cannot go to directory %s
fr_fr: %s : Ne peut pas aller dans le répertoire %s

source: %s: Cannot go to directory.
fr_fr: %s: Ne peux pas aller dans le répertoire.

source: %s: Cannot open file %s.
fr_fr: %s : Ne peut pas ouvrir le fichier %s.

source: %s: Cannot read file whose descriptor is %d: File is not active.
fr_fr: %s: Ne peux pas lire le fichier qui a pour descripteur %d: Le fichier n'est pas actif.

source: %s: Could not extend the number of files simultaneously open in Scilab.
fr_fr: %s : Ne peut pas augmenter le nombre de fichiers ouverts simultanément dans Scilab.

source: %s: Data mismatch.
fr_fr: %s : Donnée non correspondante.

source: %s: Error while opening, reading or writing '%s'.
fr_fr: %s : Erreur pendant l'ouverture, la lecture ou l'écriture '%s'.

source: %s: Error while opening, reading or writing.
fr_fr: %s : Erreur pendant l'ouverture, la lecture ou l'écriture.

source: %s: Error while trying to retrieve the name of the current directory.
fr_fr: %s : Erreur pendant la tentative de récupération du nom du répertoire courant.

source: %s: Incorrect format.
fr_fr: %s: Format incorrecte.

source: %s: Invalid conversion.
fr_fr: %s: Conversion invalide.

source: %s: Invalid format.
fr_fr: %s: Format invalide.

source: %s: Memory allocation error.
fr_fr: %s : Erreur d'allocation de mémoire.

source: %s: No File opened in Scilab.
fr_fr: %s: Pas de fichier ouvert dans Scilab.

source: %s: No input file associated to logical unit %d.
fr_fr: %s : Pas de fichier d'entrée associé à l'unité logique %d.

source: %s: No input file.
fr_fr: %s : Pas de fichier d'entrée.

source: %s: No more memory.
fr_fr: %s : Plus de mémoire disponible.

source: %s: No such file %s.
fr_fr: %s: Fichier %s inconnu.

source: %s: Options ignored.
fr_fr: %s : Options ignorées.

source: %s: Specified format cannot include any '\n'
fr_fr: %s : Le format spécifié ne peut pas inclure de '\n'

source: %s: The file %s is not opened in scilab.
fr_fr: %s: Le fichier %s n'est pas ouvert dans Scilab.

source: %s: Too many directives in scanf.
fr_fr: %s : Trop de directives dans scanf.

source: %s: Too many files opened!
fr_fr: %s : Trop de fichiers ouverts !

source: %s: Warning : only extend the limit for the number of scilab's files opened simultaneously.
fr_fr: %s : Attention : augmente uniquement la limite pour le nombre de fichiers ouverts simultanément dans Scilab.

source: %s: Warning: Directory '%s' already exists.
fr_fr: %s : Attention : le répertoire '%s' existe déjà.

source: %s: Warning: Specified maximum number of files (%d) > Absolute maximum number of files allowed (%d).
fr_fr: %s : Attention : Le nombre maximum de fichiers spécifié (%d) est supérieur au nombre de fichiers autorisé (%d).

source: %s: Wrong file descriptor: %d.
fr_fr: %s : Mauvais descripteur de fichier : %d.

source: %s: Wrong file mode: READ only.
fr_fr: %s : Mauvais mode pour le fichier : LECTURE seule.

source: %s: Wrong number of input argument(s).
fr_fr: %s : Mauvais nombre d'argument(s) d'entrée.

source: %s: Wrong number of input arguments: %d expected.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : %d attendu.

source: %s: Wrong number of input arguments: At least %d expected.
fr_fr: %s : Nombre d'arguments d'entrée incorrect : %d au moins sont attendus.

source: %s: Wrong number of output argument(s).
fr_fr: %s : Mauvais nombre d'argument(s) de sortie.

source: %s: Wrong number of output arguments: %d expected.
fr_fr: %s : Mauvais nombre d'arguments de sortie : %d attendus.

source: %s: Wrong size for input argument #%d ('%s'): Non-empty string expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d ('%s') : Une chaîne de caractères non vide attendue.

source: %s: Wrong size for input argument #%d.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d.

source: %s: Wrong size for input argument #%d: A 1-by-n or m-by-1 array expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Un tableau 1-par-n ou m-par-1 attendu.

source: %s: Wrong size for input argument #%d: A String expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Une chaîne de caractères attendue.

source: %s: Wrong size for input argument #%d: A boolean expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: un booléen attendu.

source: %s: Wrong size for input argument #%d: A file descriptor expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Un descripteur de fichier attendu.

source: %s: Wrong size for input argument #%d: A filename expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Un nom de fichier attendu.

source: %s: Wrong size for input argument #%d: A m-by-1 array expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Un table de dimension m par 1 attendue.

source: %s: Wrong size for input argument #%d: A string expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Une chaîne de caractères attendue.

source: %s: Wrong size for input argument #%d: An integer expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Un entier attendu.

source: %s: Wrong size for input argument #%d: Integer expected.
fr_fr: %s : Taille incorrecte pour l'argument d'entrée n°%d : un entier est attendu.

source: %s: Wrong size for input argument #%d: Must be less than %d characters.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Doit être inférieur à %d caractères.

source: %s: Wrong size for input argument #%d: Non-empty string expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Une chaîne de caractère non vide attendue.

source: %s: Wrong size for input argument #%d: Scalar expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Scalaire attendu.

source: %s: Wrong size for input argument #%d: String expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée n°%d : Une chaîne de caractères attendue.

source: %s: Wrong size for input argument #%d: String or logical unit expected.
fr_fr: %s : Taille incorrecte pour l'argument d'entrée #%d : Chaîne de caractères ou unité logique attendue.

source: %s: Wrong size for input argument: Scalar expected.
fr_fr: %s : Mauvaise dimension pour l'argument d'entrée : Scalaire attendu.

source: %s: Wrong type for input argument #%d: A String expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Une chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: A boolean expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n° %d : Un booléen attendu.

source: %s: Wrong type for input argument #%d: A file descriptor expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Un descripteur de fichier attendu.

source: %s: Wrong type for input argument #%d: A filename or file descriptor expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée %d: Un nom de fichier attendu.

source: %s: Wrong type for input argument #%d: A string expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Une chaîne de caractères est attendue.

source: %s: Wrong type for input argument #%d: A string.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Une chaîne de caractères est attendue.

source: %s: Wrong type for input argument #%d: An integer expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Un entier attendu.

source: %s: Wrong type for input argument #%d: An integer or string expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Un entier ou une chaîne de caractères attendu.

source: %s: Wrong type for input argument #%d: Integer expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Entier attendu.

source: %s: Wrong type for input argument #%d: Matrix of floating point numbers expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Matrice de nombres en virgule flottante attendue.

source: %s: Wrong type for input argument #%d: Real values expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Des valeurs réelles attendues.

source: %s: Wrong type for input argument #%d: String array expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : Table de chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: String expected.
fr_fr: %s : Mauvais type pour l'argument n° %d : Chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: String or logical unit expected.
fr_fr: %s : Type incorrect pour l'argument d'entrée #%d : Chaîne de caractères ou unité logique attendue.

source: %s: Wrong type for input argument #%d: a String or Integer expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: une chaîne de caractèrers ou un entier attendu.

source: %s: Wrong type for input argument: A string expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée : Une chaîne de caractères attendue.

source: %s: Wrong type for input argument: Matrix expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée : Matrice attendue.

source: %s: Wrong type for input argument: String expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée : Chaîne de caractère attendue.

source: %s: Wrong type for input arguments: Strings expected.
fr_fr: %s : Mauvais type pour les arguments d'entrée : Chaîne de caractères attendue.

source: %s: Wrong value for input argument #%d (%s): '%s' or '%s' or '%s' expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d (%s) : '%s' ou '%s' ou '%s' attendu.

source: %s: Wrong value for input argument #%d ('%s'): Format not recognized.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d ('%s') : Format non reconnu.

source: %s: Wrong value for input argument #%d.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée #%d.

source: %s: Wrong value for input argument #%d: '%s' is an invalid path.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : '%s' est un chemin invalide.

source: %s: Wrong value for input argument #%d: '%s' or '%s' or '%s' expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : '%s' ou '%s' ou '%s' attendu.

source: %s: Wrong value for input argument #%d: '%s', '%s' or '%s' expected.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : '%s', '%s' ou '%s' attendu.

source: %s: Wrong value for input argument #%d: ''w'' or ''u'' string expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° %d: Une chaîne ''w'' ou ''u'' attendue.

source: %s: Wrong value for input argument #%d: A string expected.
fr_fr: %s : Valur incorrecte de l'argument d'entrée #%d : Chaîne de caractères attendue.

source: %s: Wrong value for input argument #%d: A valid file descriptor expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° %d: Un descripteur de fichier valide attendu.

source: %s: Wrong value for input argument #%d: A valid filename or directory expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° %d: Un nom de fichier ou un répertoire valide attendu.

source: %s: Wrong value for input argument #%d: Format not recognized.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Format non reconnu.

source: %s: Wrong value for input argument #%d: Must be ''%s''.
fr_fr: %s : Mauvaise valeur pour l'argument d'entrée n°%d : Doit être ''%s''.

source: %s: Wrong value for input argument: no empty string expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée: pas de chaîne vide attendue.

source: %s: Wrong value(s) for input argument(s).
fr_fr: %s: Mauvaise valeur(s) pour le(s) argument(s) d'entrée.

source: %s: Wrong variable type (%s) found in ''%s''. File may be wrong or corrupted.
fr_fr: %s : Mauvais type de variable (%s) trouvé dans ''%s''. Le fichier est peut être mauvais ou corrompu.

source: %s: can not open file %s.
fr_fr: %s: ne peut pas ouvrir le fichier %s.

source: %s: can not read file %s.
fr_fr: %s: ne peut pas lire le fichier %s.

source: %s: end of input reached before final conversion.
fr_fr: %s: la fin de l'entrée a été atteinte avant la conversion finale.

source: %s: error.
fr_fr: %s: erreur.

source: %s: format is of 0 length.
fr_fr: %s : le format est de taille 0.

source: %s: invalid filename %s.
fr_fr: %s : nom de fichier non valide %s.

source: %s: invalid filename.
fr_fr: %s: nom de fichier invalide.

source: %s: invalid status.
fr_fr: %s: status invalide.

source: %s: unknown format %s.
fr_fr: %s : format inconnu %s.

source: A file with the same name already exists in
fr_fr: Un fichier avec le même nom existe déjà dans

source: Bad conversion.
fr_fr: Mauvaise conversion

source: Can't get current directory.
fr_fr: Impossible d'obtenir le répertoire courant.

source: Can't go to directory %s.
fr_fr: Ne peux pas aller dans le répertoire %s.

source: Can't go to directory %s: %s
fr_fr: Impossible d'atteindre le répertoire %s: %s

source: Impossible to create directory
fr_fr: Impossible de créer le répertoire

source: Invalid buffer.
fr_fr: Buffer Invalide.

source: No input file
fr_fr: Pas de fichier d'entrée

source: Not enough entries.
fr_fr: Pas suffisamment d'entrées.

source: This directory already exists in
fr_fr: Ce répertoire existe déjà dans

source: Unknown error.
fr_fr: Erreur inconnue.

source: Warning: Could not open directory %s: %s
fr_fr: Attention: Ne peux pas ouvrir le répertoire %s: %s

source: Warning: Could not remove directory %s: %s
fr_fr: Attention : Ne peut pas supprimer le répertoire %s : %s

source: Warning: Could not remove file %s: %s
fr_fr: Attention : Ne peut pas supprimer le fichier %s : %s

source: Warning: Error while opening %s: %s
fr_fr: Attention : Erreur pendant l'ouverture de %s : %s

source: Warning: file '%s' already opened in Scilab.
fr_fr: Attention : le fichier '%s' est déjà ouvert dans Scilab.

source: unclosed [ directive.
fr_fr: directive [ non fermée.
