Repository: ScilabOrg/scilab
Catalog: scilab/modules/optimization/locales/*/optimization.po
Languages: fr_fr, ja_jp

source: F(x)*Z has a negative eigenvalue.
fr_fr: F(x)*Z a une valeur propre négative.
ja_jp: F(x)*Zは、否定の固有値を持っています。

source: Function Value Average
ja_jp: 平均関数

source: Genetic algorithms
ja_jp: 遺伝アルゴリズム

source: Han and Neumann. Effect of dimensionality on the nelder-mead simplex method. Optimization Methods and Software, 2006.
ja_jp: HanおよびNeumann. nelder-mead シンプレックス法の次元効果. 最適化手法とソフトウエア, 2006.

source: Illustrates Box'' algorithm on Box problem A.
ja_jp: ボックス問題Aのボックス''アルゴリズムを描画する.

source: Illustrates Box'' algorithm on Box problem B.
ja_jp: ボックス問題Bのボックス''アルゴリズムを描画する.

source: Illustrates Box'' algorithm on Rosenbrock''s Post Office Problem.
ja_jp: Rosenbrock''s Post Office問題のボックス''アルゴリズムを描画する.

source: Illustrates Box'' algorithm on a simply bounds-constrained optimization problem.
ja_jp: 境界拘束付き最適化問題のBox''アルゴリズムを描画.

source: Illustrates that the Nelder-Mead algorithm performs correctly on a badly quadratic test case.
ja_jp: Nelder-Mead アルゴリズムが悪条件の二次テストケースで正しく動作することを図示する.

source: Illustrates that the fixed-shape Spendley et al. algorithm does NOT perform well on Rosenbrock test case.
ja_jp: 固定形状Spendley他のアルゴリズムがRosenbrock テストケースで正しく動作しないことを図示する.

source: Illustrates that the fixed-shape Spendley et al. algorithm performs badly on a badly quadratic test case.
ja_jp: 固定形状Spendley他のアルゴリズムが悪条件の二次 テストケースで正しく動作しないことを図示する.

source: Illustrates that the fixed-shape Spendley et al. algorithm performs well on a quadratic test case.
ja_jp: 固定形状Spendley他のアルゴリズムが二次 テストケースで正しく動作することを図示する.

source: Illustrates that the variable-shape Nelder-Mead algorithm performs well on a quadratic test case.
ja_jp: 可変形状Nelder-Meadアルゴリズムが二次 テストケースで正しく動作することを図示する.

source: Illustrates the 1st counter example given by Han et al.
ja_jp: Hanらにより定義された第一カウンタの例題を図示する.

source: Illustrates the 2nd counter example given by Han et al.
ja_jp: Hanらにより定義された第二カウンタの例題を図示する.

source: Illustrates the sensitivity to dimension of the Nelder-Mead algorithm
ja_jp: Nelder-Meadアルゴリズムの次元の感度を図示する

source: Initialization
ja_jp: 初期化

source: Iterations
ja_jp: 反復

source: L must be at least one.
fr_fr: L doit valoir au moins un.
ja_jp: Lは、最低でも1でなくてはなりません。

source: Logarithm Maximum Oriented length
ja_jp: 対数最大方向長

source: Logarithm Minimum Function Value
ja_jp: 対数最小関数値

source: Matrices Fi, i=1,...,m are linearly dependent.
fr_fr: Les matrices Fi, i=1,...,m sont linéairement dépendantes.
ja_jp: 行列 Fi, i=1,..., mは１次従属です。

source: Maximum Oriented length
ja_jp: 最大方向長

source: Maximum dimension:%d
ja_jp: 最大次元:%d

source: Minimum Function Value
ja_jp: 最小関数値

source: Non linear data fitting
ja_jp: 非線形データフィッティング

source: Number of function evaluations
ja_jp: 関数評価の回数

source: Number of parameters
ja_jp: パラメータの数

source: Optimisation
ja_jp: 最適化

source: Optimization and Simulation
fr_fr: Optimisation et Simulation
ja_jp: 最適化とシミュレーション

source: Output
ja_jp: 出力

source: Plot
ja_jp: プロット

source: Plot contour (please wait) ...
ja_jp: 等高線をプロット (お待ちください) ...

source: Plot contour (please wait)...
ja_jp: 等高線をプロット (お待ちください) ...

source: Plotting contour (please wait) ...
ja_jp: 等高線をプロット中 (お待ちください) ...

source: Plotting contour (please wait)...
ja_jp: 等高線をプロット中 (お待ちください) ...

source: Plotting history of fbar ...
ja_jp: fbarの履歴をプロット中 ...

source: Plotting history of fopt ...
ja_jp: foptの履歴をプロット中 ...

source: Plotting history of sigma ...
ja_jp: sigmaの履歴をプロット中 ...

source: Problem A
ja_jp: 問題A

source: Problem B
ja_jp: 問題B

source: Rate of convergence
ja_jp: 収束速度

source: Relative error = %e
ja_jp: 相対誤差 = %e

source: Rosenbrock
ja_jp: ローゼンブロック

source: Running optimization ...
ja_jp: 最適化を実行中 ...

source: Searching (please wait) ...
ja_jp: 探索中 (お待ちください) ...

source: Searching (please wait)...
ja_jp: 探索中 (お待ちください) ...

source: Setup output files...
ja_jp: 出力ファイルを設定...

source: Simulated Annealing
ja_jp: シミュレーティド・アニーリング

source: Spaceship landing trajectory
ja_jp: 宇宙船着陸軌道

source: The matrices F_i, i=1,...,m are linearly dependent (or the initial points are very badly conditioned).
fr_fr: Les matrices F_i, i=1,...,m sont linéairement dépendantes (ou alors la solution initiale est très mal conditionnée).
ja_jp: 行列 F_i, i=1,..., mは１次従属です(あるいは、最初の点は、とても悪い条件でした)

source: Work space is too small. Need at least %d*sizeof(double).
fr_fr: L'espace de travail est trop petit. Nécessite au moins %d*sizeof(double).
ja_jp: 作業空間はあまりにも小さいです。最低でも %d*sizeof(double) の必要があります。

source: Z0 does not satisfy equality conditions for dual feasibility.
fr_fr: Z0 ne satisfait pas les conditions d'égalité pour la faisabilité duale.
ja_jp: z0は、二つの部分から成る実現性のために平等条件を満足しません。

source: Z0 is not positive definite.
fr_fr: Z0 n'est pas définie positive.
ja_jp: Z0は、明確な定義ではありません。

source: and a comparison with other methods.
ja_jp: 他の手法との比較.

source: blck_szs[%d] must be at least one.
fr_fr: blck_szs[%d] doit valoir au moins un.
ja_jp: blck_szs[%d]は、最低でも1でなくてはなりません。

source: f computed = %f
ja_jp: fの計算値 = %f

source: f expected = %f
ja_jp: fの期待値 = %f

source: fminsearch - Option Display
ja_jp: fminsearch - オプション表示

source: fminsearch - Output Function
ja_jp: fminsearch - 出力関数

source: fminsearch - Plot F
ja_jp: fminsearch - Fプロット

source: fminsearch - Plot Func Count
ja_jp: fminsearch - プロット関数のカウント

source: fminsearch - Plot X
ja_jp: fminsearch - Xプロット

source: m must be at least one.
fr_fr: m doit valoir au moins un.
ja_jp: mは、最低でも1でなくてはなりません。

source: neldermead - Output Command
ja_jp: neldermead - 出力指令

source: neldermead - Rosenbrock Variable
ja_jp: neldermead - Rosenbrock 変数

source: nmplot - McKinnon #2
ja_jp: mplot - McKinnon #2

source: nmplot - Quadratic Fixed #1
ja_jp: nmplot - 二次固定 #1

source: nmplot - Quadratic Fixed #2
ja_jp: nmplot - 二次固定 #2

source: nmplot - Rosenbrock Fixed
ja_jp: nmplot - Rosenbrock 固定

source: nmplot - Rosenbrock Variable
ja_jp: nmplot - Rosenbrock 変数

source: nu must be at least 1.0.
fr_fr: nu doit valoir au moins 1.0.
ja_jp: muは、最低でも1.0でなくてはなりません。

source: x0 is not strictly primal feasible.
fr_fr: x0 n'est pas strictement primale faisable.
ja_jp: x0は、厳密でないため実行できそうもありません。

source: primal obj. dual obj. dual. gap
fr_fr: primal obj. dual obj. saut dual.
