Repository: ScilabOrg/scilab
Catalog: scilab/modules/optimization/locales/*/optimization.po
Languages: fr_fr, ja_jp

source: number of of constraints (%s)'),'lmisolver',%m,%fm));
fr_fr: nombre de contraintes (%s)'),'lmisolver',%m,%fm));
ja_jp: 制約,,数値 (%s)'),'lmisolver',%m,%fm));

source: %s: Accuracy insufficient to satisfy convergence criterion.
fr_fr: %s: Précision insuffisante pour satisfaire le critère de convergence.
ja_jp: %s: 収束基準は不正確で満足しません。

source: %s: Ambiguous property name %s matches several fields : %s
fr_fr: %s: Nom de propriété %s ambigu correspond à plusieurs champs: %s
ja_jp: %s: あいまいなプロパティ名 %s は、いくつかのフィールドと一致します: %s

source: %s: Argument 3: wrong number of columns %d expected
fr_fr: %s: Argument 3: mauvais nombre de colonnes %d attendue
ja_jp: %s: 引数 3: 列 %d の不正な値が想定されます。

source: %s: Cannot allocate more memory.
fr_fr: %s: Ne peut pas allouer plus de mémoire.
ja_jp: %s: これ以上メモリを割り当てられません。

source: %s: Cannot check cost function when x0 is empty
fr_fr: %s: Impossible de vérifier la fonction coût lorsque x0 est vide
ja_jp: %s: x0が空のコスト関数を調べることができません

source: %s: Cannot evaluate cost function from costf(x0,1).
fr_fr: %s: Impossible d'évaluer la fonction coût avec costf(x0,1).
ja_jp: %s: costf(x0,1) からコスト関数を評価することができません。

source: %s: Cannot evaluate cost function from costf(x0,2).
fr_fr: %s: Impossible d'évaluer la fonction coût avec costf(x0,2).
ja_jp: %s: costf(x0,2) からコスト関数を評価することができません。

source: %s: Cannot evaluate cost function from costf(x0,3).
fr_fr: %s: Impossible d'évaluer la fonction coût avec costf(x0,3).
ja_jp: %s: costf(x0,3) からコスト関数を評価することができません。

source: %s: Cannot evaluate cost function from costf(x0,4).
fr_fr: %s: Impossible d'évaluer la fonction coût avec costf(x0,4).
ja_jp: %s: costf(x0,4) からコスト関数を評価することができません。

source: %s: Cannot evaluate cost function from costf(x0,5).
fr_fr: %s: Impossible d'évaluer la fonction coût avec costf(x0,5).
ja_jp: %s: costf(x0,5) からコスト関数を評価することができません。

source: %s: Cannot evaluate cost function from costf(x0,6).
fr_fr: %s: Impossible d'évaluer la fonction coût avec costf(x0,6).
ja_jp: %s: costf(x0,6) からコスト関数を評価することができません。

source: %s: Empty function (use -function option).
fr_fr: %s: Fonction non définitie (utiliser l'option -function).
ja_jp: %s: 空関数(-function オプション使用)

source: %s: Expected boolean but for variable %s at input #%d, got %s instead.
fr_fr: %s: boolean attendu mais pour la variable %s en argument d'entrée%d, %s obtenu à la place.
ja_jp: %1$s: 入力 #%3$d で変数 %2$s にブーリアンを想定しました、しかし %4$s を代わりに得ました。

source: %s: Expected function but for variable %s at input #%d, got %s instead.
fr_fr: %s: Fonction prévue mais pour %s variable à l'entrée %d, obtenu %s à la place.
ja_jp: %1$s: 入力 #%3$d で変数 %2$s に関数を想定しました、しかし %4$s を代わりに得ました。

source: %s: Expected real variable for variable %s at input #%d, but got %s instead.
fr_fr: %s: variable réelle prévue pour %s variable à l'entrée %d, mais %s obtenu à la place.
ja_jp: %1$s: 入力 #%3$d で変数 %2$s に実変数を想定しました、しかし %4$s を代わりに得ました。

source: %s: Expected string variable for variable %s at input #%d, but got %s instead.
fr_fr: %s: Variable chaine de caracteres prévue pour %s variable à l'entrée %d, mais %s obtenu à la place.
ja_jp: %1$s: 入力 #%3$d の変数 %2$s で文字を想定しました、しかし、代わりに %4$s を得ました。

source: %s: H_form must be default,blockmat or hypermat, but current H_form=%s
ja_jp: %s: H_form は default,blockmatまたはhypermatである必要がありますが, H_form=%s となっています

source: %s: History disabled ; enable -storehistory option.
fr_fr: %s: L'historique est désactivé ; activer l'option -storehistory.
ja_jp: %s: 履歴無効 ; -storehistory オプション有効。

source: %s: History disabled ; turn on -storehistory option.
fr_fr: %s: Historique désactivé ; activez l'option -storehistory.
ja_jp: %s: 履歴無効 ; -storehistory オプションで設定

source: %s: Impossible to scale the vertex #%d/%d at [%s] into inequality constraints
fr_fr: %s: Impossible de mettre le vertex #%d/%d à l'échelle à [%s] dans les contraintes d'inégalités
ja_jp: %1$s: 不等式制約へ [%4$s] で頂点 #%2$d/%3$d へ到達できません。

source: %s: Initial guess [%s] is not feasible.
fr_fr: %s: Le point initial [%s] n''est pas faisable.
ja_jp: %s: 最初の推測[%s]は、実行できません。

source: %s: Initial guess not feasible.
fr_fr: %s: La solution initiale n'est pas faisable.
ja_jp: %s: 最初の推測でうまくいきそうもありません。

source: %s: Length of working array is too short.
fr_fr: %s: La longueur de la table de travail est trop courte.
ja_jp: %s: 作業整列の範囲は、あまりにも短いです。

source: %s: Log file handle non zero while starting up the logging.
fr_fr: %s : Le descripteur de fichier de log n''est pas nul au démarrage du journal.
ja_jp: %s: ロギングの開始中にログファイル・ハンドルはゼロではありません。

source: %s: Logging already started.
fr_fr: %s: Système de messages déjà démarré.
ja_jp: %s: ロギングは既に開始しています。

source: %s: Logging not started.
fr_fr: %s: L'archivage des messages n'est pas en fonctionnement.
ja_jp: %s: ロギングを開始できません。

source: %s: Negative iteration index %d is not allowed.
fr_fr: %s: L'indice d'itération négatif %d n'est pas autorisé.
ja_jp: %s: 負の反復インデックス %d は、許されません。

source: %s: Negative iteration index are not allowed.
fr_fr: %s: Les indices d'itération négatifs ne sont pas autorisés.
ja_jp: %s: 負の反復インデックスは、許されません。

source: %s: No default options available: the function ''%s'' does not exist on the path.
fr_fr: %s: Pas d''options par défaut disponible: la fonction ''%s'' n''existe pas dans le chemin.
ja_jp: %s: 初期化オプションが可能ではありません: 関数 "%s" は path に存在しません。

source: %s: No output command is defined.
fr_fr: %s: Aucune fonction d'affichage n'est définie.
ja_jp: %s: 出力関数は定義されていません。

source: %s: Number of columns of fv is %d, which is different from 1.
fr_fr: %s: Le nombre de colonnes de fv est %d, ce qui est différent de 1.
ja_jp: %s: fv の列の数は、 %d です、1と違います。

source: %s: Number of columns of x is %d, which is different from dimension = %d.
fr_fr: %s: Le nombre de colonnes de x est %d, ce qui est différent de dimension = %d.
ja_jp: %s: 次元 = %d から x の列の数は、%dと異ります。

source: %s: Number of rows of fv is %d, which is different from number of vertices = %d.
fr_fr: %s: Le nombre de lignes de fv est %d, ce qui est différent du nombre de sommets = %d.
ja_jp: %s: 頂点 = %d の数から fv の行の数は、%d と異ります。

source: %s: Number of rows of x is %d, which is different from number of vertices = %d.
fr_fr: %s: Le nombre de lignes de x est %d, ce qui est différent du nombre de sommets = %d.
ja_jp: %s: 頂点 = %d の数から x の列の数は、%d と異なります。

source: %s: Odd number of arguments : the first argument is expected to be a struct, but is a %s
fr_fr: %s: Nombre impair d'arguments : le premier argument devrait être un struct, mais il est de type %s
ja_jp: %s: 引数の奇数 : 最初の引数は、構造を予想しますが %s です

source: %s: Order must be 1, 2 or 4.
fr_fr: %s: L'ordre doit être 1, 2 ou 4.
ja_jp: %s:順序が１、２ または、４ でなくてはなりません。

source: %s: Problem has constraints, but fixed algorithm ignores them.
fr_fr: %s: Le problème d'optimisation a des contraintes, mais l'algorithme fixe les ignore.
ja_jp: %s: 問題は制約を持っています、しかし、固定したアルゴリズムはそれらを無視します。

source: %s: Problem has constraints, but variable algorithm ignores them.
fr_fr: %s: Le problème d'optimisation possède des contraintes, mais l'algorithme variable les ignore.
ja_jp: %s: 問題は制約を持っています、しかし、変数アルゴリズムはそれらを無視します。

source: %s: Problem has no constraints, but Box algorithm is designed for them.
fr_fr: %s: Le problème n'a pas de contraintes, mais l'algorithme de Box est conçu pour elles.
ja_jp: %s: 問題は制約を持っていません、しかし、ボックスアルゴリズムは、それらのためにデザインされます。

source: %s: Q is not symmetric positive definite.
fr_fr: %s: Q n'est pas symétrique définie positive.
ja_jp: %s: Qは、非対称な完全定義ではありません。

source: %s: Q must be orthogonal.
ja_jp: %s: Qは直交行列である必要があります.

source: %s: Randomized bounds initial simplex is not available without bounds.
fr_fr: %s: Le calcul du simplexe initial fondé sur un tirage aléatoire des contraintes de bornes n'est pas possible si il n'y a pas de bornes.
ja_jp: %s: 離散界の初期シンプレックスは界なしで利用できません。

source: %s: The -withderivatives option is true but all algorithms in neldermead are derivative-free.
fr_fr: %s: L'option -withderivatives est activée mais tous les algorithmes dans le composant neldermead sont sans dérivées.
ja_jp: %s: -withderivatives オプションは真です、しかし全てのアルゴリズムはNelder-Mead法の導函数です。

source: %s: The boundsmax vector is expected to be a row matrix, but current shape is %d x %d
fr_fr: %s: Le vecteur boundsmax devrait être une matrice ligne, mais la forme actuelle est %d x %d
ja_jp: %s: boundsmaxベクトルは、行の行列と予想されます、しかし、現在の形は %d x %d です

source: %s: The boundsmax vector is expected to have %d columns, but current shape is %d x %d
fr_fr: %s: Le vecteur de boundsmax attendu avec des colonnes de %d, mais la forme courante est %d x %d.
ja_jp: %s: boundsmaxベクトルは、%d 列を持っていると予想します、しかし、現在の形は、%d x %d です

source: %s: The boundsmin vector is expected to be a row matrix, but current shape is %d x %d
fr_fr: %s: Le vecteur boundsmin devrait être une matrice ligne, mais la forme actuelle est %d x %d
ja_jp: %s: boundsminベクトルは、行の行列と予想されます、しかし、現在の形は %d x %d です

source: %s: The boundsmin vector is expected to have %d columns, but current shape is %d x %d
fr_fr: %s: Le vecteur de boundsmin attendu avec des colonnes de %d, mais la forme courante est %d x %d
ja_jp: %s: boundsminベクトルは、%d 列を持っていると予想します、しかし、現在の形は、%d x %d です

source: %s: The constraints are inconsistent.
fr_fr: %s: Les contraintes sont inconsistantes.
ja_jp: %s: 制約は一貫性がないです。

source: %s: The elements of the argument #%d must be in [%d %d].
fr_fr: %s: Les éléments de l'argument #%d doivent être dans l'intervalle [%d %d].
ja_jp: %s: 引数 #%d の要素は、 [%d %d] でなくてはなりません。

source: %s: The exclusion index vector has %d rows instead of 1.
fr_fr: %s: Le vecteur d''indexes d''exclusion a %d lignes au lieu de 1.
ja_jp: %s: 排他インデックス・ベクトルは、１でなく %d を持っています。

source: %s: The gradient can be applied only with a simplex made of n+1 points, but the dimension is %d and the number of vertices is %d
fr_fr: %s: Le gradient peut uniquement être appliqué sur la base d'un simplexe constitué de n+1 points, mais la dimension est %d et le nombre de vertex est %d
ja_jp: %s: 勾配は、n+１点で作られているシンプレックスのみ適用することができます、しかし、次元は %d です、そして、頂点の数は、%dです。

source: %s: The len vector is expected to be a row matrix, but current shape is %d x %d.
fr_fr: %s : Le vecteur len doit etre un vecteur colonne, mais la forme courante est %d x %d.
ja_jp: %s: lenベクトルは、列行列と予想します、しかし、現在の形は、%d x %dです。

source: %s: The len vector is expected to be a scalar, but current shape is %d x %d
fr_fr: %s: Le vecteur len devrait être un scalaire, mais la forme actuelle est %d x %d
ja_jp: %s: lenベクトルは、スカラーと予想します、しかし、現在の形は、%d x %d です

source: %s: The len vector is not consistent with the x0 point. Current shape of x0 is %d x %d while current shape of len is %d x %d.
fr_fr: %s : Le vecteur de len n'est pas compatible avec le point x0. La forme courante de x0 est %d x %d tandis que la forme courante de len est %d x %d.
ja_jp: %s: lenベクトルは、x0点で一貫しませんでした。現在のlenの形が %d x %d である間、現在のxoの形は、%d x %d です。

source: %s: The matrix %s from costf(x0,%d) has %d columns, instead of %d.
fr_fr: %s: La matrice %s en sortie costf(x0,%d) possède %d colonnes, au lieu de %d.
ja_jp: %1$s: costf(x0,%3$d) の行列 %2$s は、 %4$d 列を持っています、 %5$d を代用

source: %s: The matrix %s from costf(x0,%d) has %d rows, instead of %d.
fr_fr: %s: La matrice %s en sortie de costf(x0,%d) possède %d lignes, au lieu de %d.
ja_jp: %1$s: costf(x0,%3$d) の行列 %2$s は、 %4$d 行を持っています、 %5$d を代用

source: %s: The minimization problem has no solution.
fr_fr: %s: Le problème de minimisation n'a pas de solution.
ja_jp: %s: 最小限化問題は、いかなる解決策も持っていません。

source: %s: The number of columns in the function value array is %d, while expected 1.
fr_fr: %s: Le nombre de colonnes dans la matrice de valeurs de fonction est %d, tandis que 1 colonne est attendue.
ja_jp: %s: 値配列が %d である関数の列の数、1を予想します。

source: %s: The number of columns in x is %d, while expected %d.
fr_fr: %s: Le nombre de colonnes de x est %d, alors que %d étaient attendues.
ja_jp: %1$s: %3$d が予想されましたが、列の数が %2$d です。

source: %s: The number of rows in the function value array is %d, while expected %d.
fr_fr: %s: Le nombre de lignes dans la matrice de valeurs de fonctions est %d, tandis que %d lignes sont attendues.
ja_jp: %s: 値配列が %d である関数の数、%d を予想します。

source: %s: The number of rows in x is %d, while expected %d.
fr_fr: %s: Le nombre de lignes de x est %d, alors que %d étaient attendues.
ja_jp: %1$s: %3$d が予想されましたが、行の数が %2$d です。

source: %s: The number of variable is zero.
fr_fr: %s: Le nombre de variables est zéro.
ja_jp: %s: 変数の数は、ゼロです。

source: %s: The number of vertices (i.e. the number of rows) is %d which is smaller than the number of columns %d (i.e. n+1).
fr_fr: %s: Le nombre de vertex (i.e. le nombre de lignes) est %d ce qui est plus petit que le nombre de colonnes %d (i.e. n+1).
ja_jp: %s: 頂点(列の数)の数は %d 、行の数よりも小さい %d (n+１) です。

source: %s: The numbers of columns of coords is %d but is expected to be at least %d
fr_fr: %s: Le nombre de colonnes dans la matrice coords est %d mais devrait être au moins %d
ja_jp: %s: coordsの列の数は、%d ですが、少なくとも %d を予想します

source: %s: The oriented simplex can be computed only with a simplex made of n+1 points, but the dimension is %d and the number of vertices is %d
fr_fr: %s: Le simplex orienté peut être calculé sur la base d'un simplexe constitué de n+1 points, mais la dimension est %d et le nombre de vertex est %d
ja_jp: %s: 方向づけられたシンプレックスは、n+１点で作られているシンプレックスでのみ計算することができます、しかし、次元は%dで、そして、頂点の数は、%dです。

source: %s: The restarteps option is expected to be a scalar, but current shape is %d x %d
ja_jp: %s: restarteps オプションはスカラーと思われますが, カレントの shape は %d x %d です

source: %s: The restarteps option is expected to be positive
ja_jp: %s: restarteps オプションは正としてください.

source: %s: The restartstep vector is expected to be positive
ja_jp: %s: restartstep ベクトルは正としてください.

source: %s: The restartstep vector is expected to have %d x %d shape, but current shape is %d x %d
ja_jp: %s: restartstep ベクトルは %d x %d の shape を有する必要がありますが, カレントの shape は %d x %d です

source: %s: The value of the ''OutputFcn'' option is neither a function nor a list.
fr_fr: %s: La valeur de l''option ''OutputFcn'' n''est ni une fonction ni une liste.
ja_jp: %s: ''OutputFcn'' オプション の値は、ノルム関数リストではありません。

source: %s: The value of the ''PlotFcns'' option is neither a function nor a list.
fr_fr: %s: La valeur de l''option ''PlotFcns'' n''est ni une fonction ni une liste.
ja_jp: %s: ''PlotFcns'' オプション の値は、ノルム関数リストではありません。

source: %s: The x0 vector is expected to be a column matrix, but current shape is %d x %d
fr_fr: %s: Le vecteur x0 devrait être une matrice colonne, mais la forme actuelle est %d x %d
ja_jp: %s: x0ベクトルは、列行列と予想します、しかし、現在の形は、%d x %d です

source: %s: The x0 vector is expected to be a row matrix, but current shape is %d x %d
fr_fr: %s: Le vecteur x0 devrait être une matrice ligne, mais la forme actuelle est %d x %d
ja_jp: %s: x0ベクトルは、行の行列と予想します、しかし、現在の形は、%d x %d です

source: %s: The x0 vector is expected to be a row matrix, but current shape is %d x %d.
fr_fr: %s: Le vecteur x0 doit etre une matrice colonne, mais la forme courante est %d x %d.
ja_jp: %s: x0ベクトルは、列行列と予想されます、しかし、現在の形は、%d x %d です。

source: %s: Too many iterations (more than %d).
fr_fr: %s: Trop d'itérations (plus de %d).
ja_jp: %s: 多すぎる反復(%d 以上)。

source: %s: Unbounded problem!
fr_fr: %s: Problème non-borné!
ja_jp: %s: 果てしない問題!

source: %s: Unexpected maximum number of function evaluations %s.
fr_fr: %s: Nombre maximum d''évaluation de la fonction %s inattendu.
ja_jp: %s: 関数評価 %s の思いがけない最大数です。

source: %s: Unexpected maximum number of iterations %s.
fr_fr: %s: Nombre maximum d''itérations %s inattendu.
ja_jp: %s: 反復 %s の思いがけない最大数です。

source: %s: Unexpected negative value %s for %s option
fr_fr: %s: Valeur négative %s inattendue for l''option %s
ja_jp: %1$s: %3$s オプション の想定しない負の値 %2$s

source: %s: Unexpected number of input arguments : %d provided while 0 to 7 are expected.
fr_fr: %s: Nombre d'arguments d'entrée inattendu : %d arguments sont fournis tandis que 0 à 7 sont attendus.
ja_jp: %s: 入力引数の数が不正です: 0 から 7 が予想されたので %d を提供します。

source: %s: Unexpected number of input arguments : %d provided while 1 to 3 are expected.
fr_fr: %s: Nombre d'arguments d'entrée inattendu : %d arguments sont fournis tandis que 1 à 3 arguments sont attendus.
ja_jp: %s: 入力引数の数が不正です: 1 から 3 が予想されたので %d を提供します。

source: %s: Unexpected number of input arguments : %d provided while 2 are expected.
fr_fr: %s: Nombre d'arguments d'entrée inattendu : %d arguments sont fournis tandis que 2 sont attendus.
ja_jp: %s: 入力引数の数が不正です: 2 が予想されたので %d を提供します。

source: %s: Unexpected number of input arguments : %d provided while 2 or 3 are expected.
fr_fr: %s: Nombre d''arguments d''entrée inattendu: %d fournis alors que 2 ou 3 sont attendus.
ja_jp: %s: 入力引数の数が不正です: 2 から 3 が予想されたので %d を提供します。

source: %s: Unexpected number of input arguments : %d provided while 2 to 4 are expected.
fr_fr: %s: Nombre d'arguments d'entrée inattendu : %d arguments sont fournis tandis que 2 à 4 arguments sont attendus.
ja_jp: %s: 入力引数の数が不正です: 1 から 4 が予想されたので %d を提供します。

source: %s: Unexpected number of input arguments : %d provided while 2 to 5 are expected.
fr_fr: %s: Nombre d'arguments d'entrée inattendu : %d arguments sont fournis tandis que 2 à 5 arguments sont attendus.
ja_jp: %s: 入力引数の数が不正です: 2 から 5 が予想されたので %d を提供します。

source: %s: Unexpected number of input arguments : %d provided while 2 to 6 are expected.
fr_fr: %s: Nombre d'arguments d'entrée inattendu : %d arguments sont fournis tandis que 2 à 6 arguments sont attendus.
ja_jp: %s: 入力引数の数が不正です: 2 から 6 が予想されたので %d を提供します。

source: %s: Unexpected number of input arguments : %d provided while 6 to 7 are expected.
fr_fr: %s: Nombre d'arguments d'entrée inattendu : %d arguments sont fournis tandis que 6 à 7 arguments sont attendus.
ja_jp: %s: 入力引数の数が不正です: 6 から 7 が予想されたので %d を提供します。

source: %s: Unexpected number of output arguments : %d provided while 3 to 5 are expected.
fr_fr: %s: Nombre d'arguments de sortie inattendu : %d sont fournis tandis que 3 à 5 arguments sont attendus.
ja_jp: %s: 出力引数の数が不正です: 3 から 5 が予想されたので %d を提供します。

source: %s: Unexpected number of variables %d. Cannot draw contour plot for functions which do not have two parameters.
fr_fr: %s: Nombre de variable %d inattendu. Impossible de dessiner les contours d'une fonction qui possède un nombre de paramètres différent de 2.
ja_jp: %s: 変数 %d の数は予想しませんでした。２つのパラメーターを持たない関数で描画を描くことができません。

source: %s: Unknown -method %s
fr_fr: %s: -method %s inconnue
ja_jp: %s: 未知の方法 %s です

source: %s: Unknown key %s
fr_fr: %s: Clé %s inconnue
ja_jp: %s: 未知のキー %s です

source: %s: Unknown method %s
fr_fr: %s: Méthode %s inconnue
ja_jp: %s: 未知の方法 %s です。

source: %s: Unknown restart detection %s
fr_fr: %s: Méthode de détection du redémarrage inconnue : %s
ja_jp: %s: 未知の再開の検出 %s

source: %s: Unknown restart simplex method %s
fr_fr: %s: Méthode %s de redémarrage du simplex inconnue
ja_jp: %s: 未知の再開 シンプレックス方法 %s

source: %s: Unknown simplex size method %s
fr_fr: %s: Méthode de calcul de la taille du simplex %s inconnue
ja_jp: %s: 未知のシンプレックス・サイズ方法 %s

source: %s: Unknown status %s
fr_fr: %s: Status %s inconnu
ja_jp: %s: 未知の状態 %s です。

source: %s: Unknown step %s
fr_fr: %s: Pas %s inconnu
ja_jp: %s: 未知の刻み %s です

source: %s: Unknown value %s for %s option
fr_fr: %s: Valeur inconnue %s pour l''option %s
ja_jp: %1$s: %3$s オプション の未知の値 %2$s

source: %s: Unknown value %s for -scalingsimplex0 option
fr_fr: %s: Valeur %s inconnue pour l'option -scalingsimplex0
ja_jp: %s: -scalingsimplex0 オプションで未知の値 %s

source: %s: Unknown value %s for -simplex0method option
fr_fr: %s: Valeur %s inconnue pour l'option -simplex0method
ja_jp: %s: -simplex0method オプション で、未知の値 %s

source: %s: Unrecognized parameter name ''%s''.
fr_fr: %s: Nom de paramètre ''%s'' non reconnu.
ja_jp: %s: 承認されないパラメータ名 "%s" です。

source: %s: Unrecognized value ''%s'' for ''Display'' option.
fr_fr: %s: Valeur ''%s'' non reconnue pour l'option ''Display''.
ja_jp: %s: "Display" オプションの承認されない値 "%s" です。

source: %s: Weighting matrix must be square.
fr_fr: %s: La matrice de pondération doit être carrée.
ja_jp: %s: 行列の分母は、平方でなくてはなりません。

source: %s: Wrong number of arguments : %d expected while %d given
fr_fr: %s: Mauvais nombre d''arguments: %d attendus alors que %d donnés
ja_jp: %1$s: 入力引数の数が不正です: %3$d が与えられるので %2$d を想定します。

source: %s: Wrong number of elements in input argument #%d: At least %d elements expected, but current number is %d.
ja_jp: %s: 入力引数 #%dの要素数に誤りがあります: %d 個以上の要素が必要ですが, %d 個しかありません.

source: %s: Wrong number of input argument(s).
fr_fr: %s : Mauvais nombre d'argument(s) d'entrée.
ja_jp: %s: 入力引数の数が不正です。

source: %s: Wrong number of input arguments: %d to %d expected.
fr_fr: %s : Mauvais nombre d'arguments d'entrée : %d à %d attendus.
ja_jp: %s: 入力引数の数が不正です: %d から %d が想定されます。

source: %s: Wrong size for input argument #%d.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d.
ja_jp: %s: 入力引数 #%d で不正なサイズです。

source: %s: Wrong size for input argument #%d: A column vector expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: Un vecteur colonne attendu.
ja_jp: %s: 入力引数 #%d で不正な型: 列ベクトルを想定します。

source: %s: Wrong size for input argument #%d: number of columns %d expected.
fr_fr: %s: Mauvaise dimension pour l'argument d'entrée n° %d: nombre de colonnes %d attendu.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 列 %d の数を想定します。

source: %s: Wrong type for element #%d in input argument #%d: A function is expected, but current type is %s.
ja_jp: %s: 要素 #%d (入力引数 #%d)の型が間違っています: 関数を指定する必要がありますが, %s 型が指定されています.

source: %s: Wrong type for input argument #%d: A function expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Une fonction est attendue.
ja_jp: %s: 入力引数 #%d で不正な型: 関数を想定します。

source: %s: Wrong type for input argument #%d: N-dimensionnal array expected.
fr_fr: %s : Mauvais type pour l'argument d'entrée n°%d : une table de dimension N attendue.
ja_jp: %s: 入力引数 #%d で不正な型: N-次元配列 を想定します。

source: %s: Wrong type for input argument #%s: external expected.
fr_fr: %s: Mauvais type pour l'argument #%s: une fonction externe est attendue.
ja_jp: %s: 入力引数 #%s で不正な型: 外部を想定します。

source: %s: x0 is not feasible.
fr_fr: %s: x0 n'est pas faisable.
ja_jp: %s: x0 はうまくいきそうもありません。

source: ...Done
ja_jp: ...完了

source: A new method of constrained optimization
ja_jp: 拘束条件付き最適化の新手法

source: Column #1: number of dimensions
ja_jp: #1列: 次元数

source: Column #2: number of function evaluations
ja_jp: #2列 : 関数評価の回数

source: Column #3: number of iterations
ja_jp: #3列: 反復回数

source: Column #4: convergence rate (lower is better)
ja_jp: #4列: 収束率 (小さい方が優れる)

source: Computation of optimal parameters
ja_jp: 最適パラメータの計算

source: Configuring nmplot object...
ja_jp: nmplotオブジェクトを設定中...

source: Creating nmplot object ...
ja_jp: nmplotオブジェクトを作成中...

source: Creating nmplot object...
ja_jp: nmplotオブジェクトを作成中...

source: Creating object ...
ja_jp: オブジェクトを作成中 ...

source: Creating object...
ja_jp: オブジェクトを作成中 ...

source: Defining Han function...
ja_jp: ハン関数を定義中...

source: Defining McKinnon function...
ja_jp: McKinnon関数を定義中...

source: Defining Rosenbrock Post Office function...
ja_jp: Rosenbrock Post Office 関数を定義中...

source: Defining Rosenbrock function ...
ja_jp: Rosenbrock 関数を定義中...

source: Defining Rosenbrock function...
ja_jp: Rosenbrock 関数を定義中...

source: Defining initial simplex coordinates...
ja_jp: 初期シンプレックス座標を定義中...

source: Defining quadratic function ...
ja_jp: 二次関数を定義中...

source: Defining quadratic function...
ja_jp: 二次関数を定義中...

source: Derivative
ja_jp: 微分

source: End of Optimization
ja_jp: 最適化の終了

source: End of demo.
ja_jp: デモの終了

source: Error in dgels, info = %d.
fr_fr: Erreur dans dgels, info = %d.
ja_jp: dgelsでエラー、情報 = %d

source: Error in dspev, info = %d.
fr_fr: Erreur dans dspev, info = %d.
ja_jp: dspev でエラー, 情報 = %d.

source: Error in dspgv, info = %d.
fr_fr: Erreur dans dspgv, info = %d.
ja_jp: dspgvでエラー, 情報 = %d

source: Error in dspst, info = %d.
fr_fr: Erreur dans dspst, info = %d.
ja_jp: dspst でエラー, 情報 = %d.

source: Error in dtrcon, info = %d.
fr_fr: Erreurr dans dtrcon, info = %d.
ja_jp: dtrconでエラー、情報 = %d
