Repository: ScilabOrg/scilab
Catalog: scilab/modules/tclsci/locales/*/tclsci.po
Languages: fr_fr, pl_pl

source: %s: Wrong number of input argument(s): %d to %d expected.
fr_fr: %s: Mauvais nombre d'argument(s) d'entrée: %d à %d attendu.
pl_pl: %s: Niewłaściwa liczba argumentów wejściowych: oczekiwano %d do%d

source: %s: Wrong number of output argument(s): %d expected.
fr_fr: %s: Mauvais nombre d'argument(s) de sortie: %d attendu.
pl_pl: %s: Nieprawidłowa liczba argumentów wyjściowych: oczekiwano %d.

source: %s: Wrong type for input argument #%d: A String expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Une chaîne de caractères attendue.
pl_pl: %s: Niewłaściwy typ argumentu wejściowego #%d: Oczekiwano ciągu znaków.

source: %s: Wrong type for input argument #%d: A Boolean expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Un booléen attendu.
pl_pl: %s: Niewłaściwy typ argumentu wejściowego #%d: Oczekiwano wartości typu Boolean.

source: %s: Slave interpreter already exists.
fr_fr: %s: L'interpréteur esclave existe déjà.
pl_pl: %s: Tłumaczenie slave już istnieje.

source: Tcl/Tk interface not loaded.
fr_fr: Interface TCL/TK n'est pas chargée.
pl_pl: Tcl/Tk nie dodano interfejsu.

source: %s: Wrong type for input argument #%d: Real or String matrix expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Un réel ou une matrice de chaîne de caractères attendue.

source: %s: No such slave interpreter.
fr_fr: %s: Pas d'interpréteur esclave.
pl_pl: %s: Nie znaleziono tłumaczenia slave.

source: Updating, please wait
fr_fr: Mise à jour, patientez s'il vous plait
pl_pl: Aktualizowanie, proszę czekać

source: Error %s while loading library %s
fr_fr: Erreur %s pendant le chargement de la librairie %s
pl_pl: %s Błąd podczas ładowania biblioteki %s

source: &File
fr_fr: &Fichier
pl_pl: &Plik

source: &Tools
fr_fr: &Outils
pl_pl: &Narzędzia

source: &Edit
fr_fr: &Edition
pl_pl: &Edycja

source: %s: Error main TCL interpreter not initialized.
fr_fr: %s: Erreur interpréteur principal TCL non initialisé.
pl_pl: %s: Błąd główny tłumacz TCL nie zainicjowany.

source: %s: Wrong type for input argument #%d: String expected.
fr_fr: %s : Mauvais type pour l'argument n° %d: Chaîne de caractères attendue.
pl_pl: %s: Niewłaściwy typ argumentu wejściowego #%d: Oczekiwano ciągu znaków.

source: %s: Wrong type for input argument #%d or #%d: String expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° #%d ou #%d: Chaîne de caractères attendue.
pl_pl: %s: Niewłaściwy typ argumentu wejściowego #%d lub #%d : Oczekiwano ciągu znaków.

source: %s: No more memory.
fr_fr: %s: Plus de mémoire disponible.
pl_pl: %s: Brak pamieci.

source: %s: Could not read Tcl Variable.
fr_fr: %s: Ne peut pas lire la Variable Tcl.
pl_pl: %s: Nie można odczytać zmiennej Tcl.

source: This function doesn't work with Complex.
fr_fr: Cette fonction ne marche pas avec des complexes.
pl_pl: Ta funkcja nie działa z Complex.

source: [] doesn't work with Tcl/Tk.
fr_fr: [] ne marchent pas avec Tcl/Tk.
pl_pl: [] Nie działa z Tcl / TK.

source: %s: Wrong type for input argument #%d: Matrix expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée #%d: une matrice est attendue.
pl_pl: %s: Niewłaściwy typ argumentu wejściowego #%d: oczekiwano macierzy.

source: %s: Wrong type for input argument #%d: String or vector of strings expected.
fr_fr: %s: Mauvais type pour l'argument n° #%d: Chaîne de caractères ou vecteur de chaînes de caractères attendu.
pl_pl: %s: Nieprawidłowy typ argumentu wejściowego #%d: oczekiwany ciąg znaków lub wektor ciągów znaków.

source: %s: File %s not found.
fr_fr: %s: Fichier %s pas trouvé.
pl_pl: %s: Pliku %s nie odnaleziono.

source: %s, at line %i of file %s %s.
fr_fr: %s, à la ligne %i du fichier %s %s.
pl_pl: %s, w linii %i z pliku %s %s.

source: Warning: Problem(s) with TCL/TK interface. Interface not enabled.
fr_fr: Attention : Problème(s) avec l'interface TCL/TK. L'interface n'est pas activée.
pl_pl: Uwaga: Problem z interfejsem TCL/TK. Interfejs nie aktywny.

source: Tcl/TK interface disabled in -nogui mode.
fr_fr: L'interface Tcl/TK est désactivée en mode -nogui.
pl_pl: Interfejs Tcl/TK nie jest sprawny w module -nogui.

source: Alpha Release
fr_fr: Release Alpha
pl_pl: Wersja Alfa

source: Beta Release
fr_fr: Release Beta
pl_pl: Wersja Beta

source: Final Release
fr_fr: Release Finale
pl_pl: Wersja Finałowa

source: Unknown Release
fr_fr: Release inconnue
pl_pl: Wersja Nieznana

source: %s: Wrong value for input argument #%d: '%s' expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° #%d: '%s' attendue.
pl_pl: %s: Nieprawidłowa wartość dla argumentu wejściowego #%d: oczekiwano '%s'

source: The SCI environment variable is not set. TCL initialisation failed !
fr_fr: LA variable d'environnement SCI n'est pas réglée. Echec de l'initialisation de TCL !
pl_pl: Zmienna środowiskowa SCI nie jest ustawiona. Inicjalizacja TCL nieudana !

source: Unable to find Tcl initialisation scripts. Check your SCI environment variable. Tcl initialisation failed !
fr_fr: Impossible de trouver les scripts d'initialisation TCL. Vérifier votre variable d'environnement SCI. Echec de l'initialisation de TCL !
pl_pl: Nie można znaleźć skryptu inicjalizcji Tcl. Sprawdź swoją zmienną środowiskową SCI. Inicjalizacja Tcl nie udana !

source: The SCI environment variable is not set. Tcl initialisation failed !
fr_fr: La variable d'environnement SCI n'est pas réglée. Echec de l'initialisation de TCL !
pl_pl: Zmienna środowiskowa SCI nie jest ustawiona. Inicjalizacja TCL nieudana !

source: Tcl Error: Unable to create Tcl interpreter (Tcl_CreateInterp).
fr_fr: Erreur Tcl: Impossible de créer l'interpréteur TCL (Tcl_CreateInterp).
pl_pl: Błąd Tcl: Nie można utworzyć interpretatora Tcl (Tcl_CreateInterp).

source: Tcl Error: Error during the Tcl initialization (Tcl_Init): %s
fr_fr: Erreur TCL: Erreur pendant l'initialisation de TCL (Tcl_Init): %s
pl_pl: Błąd Tcl: Błąd podczas inicjalizacji Tcl (Tcl_Init): %s

source: Tcl Error: Error during the Scilab/Tcl init process. Could not set SciPath: %s
fr_fr: Erreur TCL: Erreur pendant le processus Scilab/TCL init. Ne peux pas régler SciPath: %s
pl_pl: Błąd Tcl: Błąd podczas Scilab/Tcl procesu init. Nie można ustawić SciPath: %s

source: Tcl Error: Error during the Scilab/TK init process. Error while loading %s: %s
fr_fr: Erreur TCL: Erreur pendant le processus Scilab/TK init. Erreur pendant le chargement de %s: %s
pl_pl: Błąd Tcl: błąd podczas Scilab/TK procesu init. Błąd podczas wczytywania %s: %s

source: Tcl Error : %s
fr_fr: Erreur Tcl : %s

source: Variable too long.
fr_fr: Variable trop longue.
pl_pl: Zmiennej za długa.

source: %s: Error TCL interpreter not initialized.
fr_fr: %s: Erreur interpréteur TCL non initialisé.
pl_pl: %s: Błąd tłumacz TCL nie zainicjowany.

source: Tcl Error: %s
fr_fr: Erreur Tcl: %s

source: Execution starts for %s
fr_fr: L'exécution commence à %s
pl_pl: Wykonanie zaczyna się dla %s

source: Execution ends for %s
fr_fr: L'exécution finit à %s
pl_pl: Wykonanie kończy się dla %s

source: Flushing starts for queued commands.
fr_fr: Commence à vider les commandes de la queue.
pl_pl: Rozpoczyna się proces czyszczenia dla poleceń w kolejce.

source: Warning: Too many callbacks in queue!
fr_fr: Attention: trop de callbacks dans la queue!
pl_pl: Uwaga: Zbyt wiele połączeń oczekujących w kolejce!

source: Flushed execution starts for %s - No option
fr_fr: Vide %s du début de l'exécution - Pas d'option
pl_pl: Wykonanie czyszczenia rozpoczęte dla %s - Brak opcji

source: Flushed execution starts for %s - seq
fr_fr: Vide %s du début de l'exécution - seq
pl_pl: Wykonanie czyszczenia rozpoczęte dla %s - seq

source: Flushed execution ends for %s
fr_fr: Vide %s de la fin de l'exécution
pl_pl: Wykonanie końcowego czyszczenia dla %s

source: Flushing ends
fr_fr: Vidage terminé
pl_pl: Czyszczenie zakończone

source: %s: Wrong number of input argument(s): at least one expected.
fr_fr: %s: Mauvais nombre d'argument(s) d'entrée: Au moins un attendu.
pl_pl: %s: Niewłaściwa liczba argumentów wejściowych: oczekiwano co najmniej jednej wartość.

source: %s: An error occurred: %s
fr_fr: %s: Une erreur s'est produite: %s
pl_pl: %s: Wystąpił błąd: %s

source: Impossible to set environment variable.
fr_fr: Impossible de définir la variable d'environnement.
pl_pl: Nie można ustawić zmiennej.

source: Impossible to set system encoding.
fr_fr: Impossible de définir l'encodage système.
pl_pl: Nie można ustawić kodowania.

source: Scilab TCL/TK module not installed.
fr_fr: Le module TCL/TK de Scilab n'est pas installé.
pl_pl: Scilab TCL/TK moduł nie zainstalowany.

source: Tcl Error: Error during the TK initialization (Tk_Init): %s
pl_pl: Błąd Tcl: Błąd podczas inicjalizacji TK (Tk_Init): %s
