Repository: ScilabOrg/scilab
Catalog: scilab/modules/functions/locales_macros/*.po
Languages: fr_fr

source: %s is already compiled for profiling.
fr_fr: %s est déjà compilé pour le profilage.

source: %s is already compiled.
fr_fr: %s est déjà compilé.

source: %s is already noncompiled.
fr_fr: %s n'est pas compilée.

source: %s: %s file cannot be created
fr_fr: %s : Impossible de créer le fichier %s

source: %s: %s file compilation forced
fr_fr: %s : %s compilation du fichier forcée

source: %s: File %s does not contain any function.
fr_fr: %s : Le fichier %s ne contient aucune fonction.

source: %s: File %s doesn''t exist.
fr_fr: %s : Le fichier %s n''existe pas.

source: %s: I cannot find any files with extension %s in %s
fr_fr: %s : Impossible de trouver un fichier avec l''extension %s dans %s

source: %s: Impossible to open file %s for writing
fr_fr: %s : Impossible d''ouvrir le fichier %s en écriture

source: %s: Incorrect function in file %s.
fr_fr: %s : Fonction incorrecte dans le fichier %s.

source: %s: No files with extension %s found in %s
fr_fr: %s : Pas de fichiers avec l''extension %s trouvés dans %s

source: %s: Please check: %s
fr_fr: %s : Veuillez vérifier : %s

source: %s: Private function: cannot access to this function directly.
fr_fr: %s : Fonction privée : Impossible d'accéder directement à cette fonction.

source: %s: Processing file: %s
fr_fr: %s : Traitement du fichier : %s

source: %s: Regenerate names and lib
fr_fr: %s : Régénère les noms et les bibliothèques

source: %s: The function has not been built for profiling
fr_fr: %s : La fonction n''a pas été construite pour le profilage

source: %s: Undefined variable %s.
fr_fr: %s : Variable non définie %s.

source: %s: Warning: Error in file %s : %s. File ignored
fr_fr: %s : Attention : Erreur dans le fichier %s : %s. Fichier ignoré

source: %s: Wrong size for input argument #%d: A string expected.
fr_fr: %s : Dimension erronée de l''argument d''entrée n°%d : Une chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d.
fr_fr: %s : Type erroné de l''argument d''entrée n°%d.

source: %s: Wrong type for input argument #%d: A character string expected.
fr_fr: %s : Type erroné de l''argument d''entrée n°%d : Un caractère attendu.

source: %s: Wrong type for input argument #%d: A string expected.
fr_fr: %s : Type erroné de l''argument d''entrée n°%d : Une chaîne de caractères attendue.

source: %s: Wrong type for input argument #%d: Scilab function expected.
fr_fr: %s : Type erroné de l''argument d''entrée n°%d : Une fonction Scilab attendue.

source: %s: Wrong value for input argument #%d: A Scilab function name is expected.
fr_fr: %s : Valeur erronée de l''argument d''entrée n°%d : Un nom de fonction Scilab attendu.

source: %s: Wrong value for input argument #%d: Name of a Scilab function expected.
fr_fr: %s : Valeur erronée de l''argument d''entrée n°%d : Un nom de fonction Scilab attendu.

source: %s: Wrong values for input argument: No profile data in the function
fr_fr: %s : Valeurs erronées de l''argument d''entrée : Pas de données de profil dans la fonction

source: %s: obsolete op-code %d.
fr_fr: %s : op-code obsolète %d.

source: -- Creation of [%s] (Macros) --
fr_fr: -- Création de [%s] (Macros) --

source: Checking: %s.
fr_fr: Vérification : %s.

source: Click to get corresponding line, move with a-z.
fr_fr: Cliquez pour obtenir les lignes correspondantes, déplacez avec a-z.

source: Complexity
fr_fr: Complexité

source: Edit
fr_fr: Édition

source: Exit
fr_fr: Quitter

source: Feature %s is obsolete.
fr_fr: La fonctionnalité %s est obsolète.

source: Library file %s has been updated, but cannot be loaded into Scilab because %s is a protected variable.
fr_fr: Le fichier bibliothèque %s a été mis à jour, mais ne peut pas être chargé dans Scilab car %s est une variable protégée.

source: No comment available.
fr_fr: Pas de commentaire disponible.

source: No variable named: %s.
fr_fr: Aucune variable du nom : %s.

source: Please use %s instead.
fr_fr: Veuillez utiliser %s à la place.

source: This feature will be permanently removed in Scilab %s
fr_fr: Cette fonctionnalité va être définitivement supprimée dans Scilab %s

source: Tools
fr_fr: Outils

source: line %s [%s call, %s sec] ::
fr_fr: ligne %s [%s appel, %s sec] ::

source: line %s [%s calls, %s sec] ::
fr_fr: ligne %s [%s appels, %s sec] ::
