Repository: ScilabOrg/scilab
Catalog: scilab/modules/functions/locales/*/functions.po
Languages: fr_fr, ja_jp, pt_br

source: %s : Memory allocation error.
ja_jp: %s: メモリの割り当てに失敗しました。

source: %s is already compiled for profiling, nothing to do!
fr_fr: %s est déjà prète pour être profilée, il n'y a rien à faire!
ja_jp: %s は、プロファイルのため既にコンパイルされました、なにもする必要はありません!
pt_br: %s já está compilado para profiling, nada a fazer!

source: %s is already compiled, nothing to do!
fr_fr: %s est déja sous forme compilée, il n'y a rien à faire!
ja_jp: %s は既にコンパイルされました、なにもする必要はありません!
pt_br: %s já está compilado, nada a fazer!

source: %s is already noncompiled, nothing to do!
fr_fr: %s est déja sous forme non-compilée, il n'y a rien à faire!
ja_jp: %s はコンパイル不要です、なにもする必要はありません!
pt_br: %s já não está compilado, nada a fazer!

source: %s: %s file cannot be created
fr_fr: %s: Le fichier %s n'a pu être créé.
ja_jp: %s: ファイル %s を作成できません。
pt_br: %s: %s arquivo não pode ser criado

source: %s: %s file compilation forced
fr_fr: %s: La compilation du fichier %s a été forcée.
ja_jp: %s: %s ファイルの強制コンパイル
pt_br: %s: compilação de arquivo %s forçada

source: %s: File %s does not contain any function.
fr_fr: %s: Le fichier %s ne contient aucune fonction.
ja_jp: %s: ファイル %s は、どんな関数も含みません。
pt_br: %s: Arquivo %s não contém nenhuma função.

source: %s: File %s doesn''t exist.
fr_fr: %s: Le fichier %s n'existe pas.
ja_jp: %s: ファイル %s は存在しません。
pt_br: %s: Arquivo %s não existe.

source: %s: I cannot find any files with extension %s in %s
fr_fr: %s: Il n'y a pas de fichier d'extension %s dans le répertoire %s.
ja_jp: %1$s: 私は、どんなファイルも %3$s の拡張 %2$s で見つけることができません。
pt_br: %s: Não é possível achar arquivos com a extensão %s em %s

source: %s: Impossible to open file %s for writing
fr_fr: %s: Il n'est pas possible d'ouvrir le fichier %s en écriture.
ja_jp: %s: 書くためのファイル %s を開くことができません。
pt_br: %s: Impossível abrir o arquivo %s para escrita

source: %s: Incorrect function in file %s.
fr_fr: %s: Fonction incorrecte dans le fichier %s.
ja_jp: %s: ファイル %s の不正確な関数です。
pt_br: %s: Função incorreta em %s.

source: %s: Invalid library %s.
ja_jp: %s: 無効なライブラリ %s.

source: %s: No files with extension %s found in %s
fr_fr: %s: Aucun fichier d'exension %s n'a été trouvé dans le répertoire %s.
ja_jp: %s: 拡張 %s を持ついかなるファイルも、%sで見つけませんでした。
pt_br: %s: Nenhum arquivo com extensão %s encontrado em %s

source: %s: Please check: %s
fr_fr: %s: Veuillez vérifier : %s.
ja_jp: %s: 確認してください: %s.
pt_br: %s: Por favor verifique: %s

source: %s: Processing file: %s
fr_fr: %s: Traitement du fichier: %s.
ja_jp: %s: ファイルを加工: %s
pt_br: %s: Processando arquivo: %s

source: %s: Regenerate names and lib
fr_fr: %s: Regénération des fichiers names et lib.
ja_jp: %s: 再生された名前とライブラリ
pt_br: %s: Regenerando nomes e biblioteca

source: %s: The function has not been built for profiling
fr_fr: %s: Cette fonction n'a pas été construite pour être profilée.
ja_jp: %s: 関数は、プロファイルのために構築できません
pt_br: %s: Esta função não foi construída para profiling

source: %s: There is no file named %s.sci in the library directory %s.
fr_fr: %s: Il n'y a pas de fichier nommé %s.sci dans le répertoire de la bibliothèque %s.
ja_jp: %1$s: ライブラリ・ディレクトリー %3$s に %2$s.sci 名のいかなるファイルもありません。
pt_br: %s: Não há arquivo de nome %s.sci no diretório de biblioteca %s.

source: %s: Undefined variable %s.
fr_fr: %s: La variable %s n'est pas définie.
ja_jp: %s: 変数 %s は定義されていません。
pt_br: %s: Variável indefinida %s.

source: %s: Warning: Error in file %s : %s. File ignored
fr_fr: %s: Attention une erreur a été rencontrée dans le fichier %s: %s. Le fichier a été ignoré.
ja_jp: %s: 警告: ファイル %s でエラー : ファイル %s を無視します。
pt_br: %s: Aviso: Erro no arquivo %s : %s. Arquivo ignorado

source: %s: Wrong size for input argument #%d.
ja_jp: %s: 入力引数 #%d で不正なサイズです。

source: %s: Wrong size for input argument #%d: A scalar expected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: スカラーを想定します。

source: %s: Wrong size for input argument #%d: A string expected.
ja_jp: %s: 入力引数 #%d で不正なサイズ: 文字列を想定します。

source: %s: Wrong type for input argument #%d.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d.
ja_jp: %s: 入力引数 #%d で不正な型です。.
pt_br: %s: Tipo errado para o argumento de entrada #%d.

source: %s: Wrong type for input argument #%d: A character string expected.
fr_fr: %s: Mauvais type pour l'argument d'entrée n° %d: Une chaine de caractères est attendue.
ja_jp: %s: 入力引数 #%d で不正な型: 文字列を想定します。
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se um string.

source: %s: Wrong type for input argument #%d: A scalar or a string expected.
ja_jp: %s: 入力引数 #%d で不正な型: スカラー、または、文字列を想定します。

source: %s: Wrong type for input argument #%d: A string expected.
ja_jp: %s: 入力引数 #%d で不正な型: 文字列を想定します。

source: %s: Wrong type for input argument #%d: Scilab function expected.
fr_fr: %s: Mauvais type pour l'arguemnt d'entrée n° %d: Une fonction Scilab est attendue.
ja_jp: %s: 入力引数 #%d で不正な型: Scilab 関数を想定します。
pt_br: %s: Tipo errado para o argumento de entrada #%d: Esperava-se uma função Scilab.

source: %s: Wrong type of input argument #%d: String expected.
ja_jp: %s: 入力引数 #%d で、不正な型: 文字列を想定します。

source: %s: Wrong value for input argument #%d: 'errcatch' expected.
ja_jp: %s: 入力引数 #%d で不正な値: 'errcatch' を想定します。

source: %s: Wrong value for input argument #%d: 'm' or 'n' expected.
ja_jp: %s: 入力引数 #%d で不正な値: 'm' または 'n' を想定します。

source: %s: Wrong value for input argument #%d: A Scilab function name is expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n°%d: Le nom d'une fonction Scilab est attendu.
ja_jp: %s: 入力引数 #%d で不正な型: Scilab 関数名を祖宛居します。
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se um nome de função Scilab.

source: %s: Wrong value for input argument #%d: A integer expected.
ja_jp: %s: 入力引数 #%d で不正な値: 整数 を想定します。

source: %s: Wrong value for input argument #%d: Name of a Scilab function expected.
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée n° %d: Le nom d'une fonction Scilab est attendu.
ja_jp: %s: 入力引数 #%d で不正な値: Scilab 関数の名前を想定します。
pt_br: %s: Valor errado para o argumento de entrada #%d: Esperava-se o nome de uma função Scilab.

source: %s: Wrong value(s) for input argument(s).
ja_jp: %s: 入力引数(s)で不正な値(s)です。

source: %s: Wrong values for input argument: No profile data in the function
fr_fr: %s: Mauvaise valeur pour l'argument d'entrée: Il n'y a aucune donnée de profile.
ja_jp: %s: 入力引数で不正な値: 関数のプロファイル・データはありません
pt_br: %s: Valores errados para o argumento de entrada: Nenhum dado de perfil na função

source: %s: obsolete op-code %d.
fr_fr: %s: Le code opératoire %d est obsolète.
ja_jp: %s: もはや用いられない op-code %d です。
pt_br: %s: código de operador %d obsoleto.

source: -- Creation of [%s] (Macros) --
fr_fr: -- Création de [%s] (Macros) --
ja_jp: -- [%s] の作成(マクロ) --
pt_br: -- Criação de [%s] (Macros) --

source: Checking: %s.
fr_fr: Test de %s.
ja_jp: 調査: %s
pt_br: Verificando: %s.

source: Click to get corresponding line, move with a-z.
fr_fr: Cliquer pour sélectionner la ligne correspondante, bouger avec a-z.
ja_jp: 一致する行をクリックしてください、 a-z を移動
pt_br: Clique para obter a linha correspondente, mova com a-z.

source: Complexity
fr_fr: Complexité
ja_jp: 複雑性
pt_br: Complexidade

source: Edit
fr_fr: Editer
ja_jp: 編集
pt_br: Editar

source: Exit
fr_fr: Quitter
ja_jp: 終了
pt_br: Sair

source: Function %s is obsolete.
fr_fr: La fonction %s est obsolete.
ja_jp: 関数 %s は廃れました。
pt_br: A função %s está obsoleta.

source: Library file %s has been updated, but cannot be loaded into Scilab because %s is a protected variable.
ja_jp: ライブラリ・ファイル %s は、更新されました。 しかし、%s は保護された変数なのでScilabへロードできません。
pt_br: O arquivo bibilioteca %s foi atualizado, mas não pode ser carregado no Scilab porque %s é uma variável protegida.

source: No comment available.
fr_fr: Aucun commentaire n'est présent.
ja_jp: コメントは有効でありません。
pt_br: Nenhum comentário disponível.

source: No variable named: %s
fr_fr: Il n'y a pas de variable de nom: %s
ja_jp: 変数に名前がありません: %s
pt_br: Não há variável chamada: %s

source: Please use %s instead.
fr_fr: Elle peut être remplacée par %s.
ja_jp: どうぞ代わりに %s を使って下さい。
pt_br: Por favor, utilize %s ao invés.

source: This function will be permanently removed in Scilab %s
fr_fr: Cette fonction sera supprimée définitivement de Scilab %s
ja_jp: この関数は、Scilab %s で使われなくなります
pt_br: Esta função será permanentemente removida no Scilab %s

source: Tools
ja_jp: ツール

source: WARNING: Function %s is obsolete.
ja_jp: 警告: 関数 %s は廃れました。

source: WARNING: Please use %s instead.
ja_jp: 警告: どうぞ代わりに %s を使って下さい。

source: WARNING: This function will be permanently removed in Scilab %s.
ja_jp: 警告: この関数は、Scilab %s で使われなくなります。

source: line %s [%s call, %s sec] ::
fr_fr: Ligne %s [%s appels, %s s] ::
ja_jp: 行 %s [%s 呼び出し, %s 秒] ::

source: line %s [%s calls, %s sec] ::
fr_fr: Ligne %s [%s appels, %s s] ::
ja_jp: 行 %s [%s 呼び出し, %s 秒] ::

source: Library file %s has been updated, but cannot be loaded into Scilab because ''%s'' is a protected variable.
fr_fr: Le fichier de bibliothèque %s a été mis à jour, mais n'a pas pu être chargé dans Scilab car %s est une variable protégée.

source: Insert
fr_fr: Insérer

source: &Edit
fr_fr: &Edition

source: File
fr_fr: Fichier

source: &File
fr_fr: &Fichier
